[{"id":"65f747a3-4a1f-47b3-8caf-1d92f6d0a39e","type":"Full Time","url":"https://jobs.github.com/positions/65f747a3-4a1f-47b3-8caf-1d92f6d0a39e","created_at":"Sat Jan 09 03:23:58 UTC 2021","company":"PAI Health","company_url":"https://www.paihealth.com","location":"Vancouver, British Columbia","title":"Software Development Team Lead","description":"\u003cp\u003e\u003cstrong\u003ePAI Health is hiring a Software Development Team Lead with a passion for healthy living to help revolutionize global wellness!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout PAI Health\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur health software uses wearable technology to turn data insights into tailored, actionable health and wellness advice based on each user’s heart rate and preferences. Our mission is to help people live longer, healthier lives.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat’s Next for PAI Health?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur API product suite caught the attention of Huami Corporation, one of the world’s largest smart wearable technology company, who has taken the market by storm since 2013. With Huami’s proven AI algorithms, massive data sets and analytical capabilities, global distribution channels, and demonstrated success launching international products in the health tech space, this acquisition has put PAI Health on a whole new playing field.\u003c/p\u003e\n\u003cp\u003eLooking ahead, we have a unique opportunity to scale up our product at an international level, backed by the expertise and power of a global organization.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat to Expect\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a Team Lead at PAI Health, you will be a trusted advisor to both leadership and your team. You will work cross-departmentally to help translate business requirements into delivered platform features, providing feedback and expertise along the way.\u003c/p\u003e\n\u003cp\u003eYour daily responsibilities include:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003ePlanning – Lead our agile development process, gather project requirements, set timelines, communicate milestones, collaborate with key stakeholders and proactively troubleshoot.\u003c/li\u003e\n\u003cli\u003eExecution – Produce clean, performant code and contribute to the design of systems architecture and CI/CD infrastructure.\u003c/li\u003e\n\u003cli\u003eCoaching – Lead and mentor junior engineers, establish quality standards, perform code reviews and delivering meaningful feedback to help the team grow.\u003c/li\u003e\n\u003cli\u003eEngagement – Motivate team members, lead by example and ensure alignment to company and department objectives, metrics and values.\u003c/li\u003e\n\u003cli\u003eContribution – Advise on fresh ideas and concepts by actively seeking out new technologies and best practices.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eWho You Are\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperienced – 5+ years of full stack development experience with relevant post-secondary education and experience leading projects or teams\u003c/li\u003e\n\u003cli\u003eTeam player – you include your team in the process, you’re not looking to walk alone\u003c/li\u003e\n\u003cli\u003eMentorship – you lead by example and give and take constructive feedback\u003c/li\u003e\n\u003cli\u003eCommunication – you can express your ideas concisely and effectively\u003c/li\u003e\n\u003cli\u003eCommitment – you encourage ideation and suggestions, but can evoke a collective decision when it matters\u003c/li\u003e\n\u003cli\u003eHands-on contributor – you enjoy writing code, solving problems, and being in the trenches\u003c/li\u003e\n\u003cli\u003eProcess-oriented – you see things logically and enjoy optimizing process\u003c/li\u003e\n\u003cli\u003eConfident – you manage stakeholder expectations and know when to say ‘no’\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Tech Stack\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eModern full-stack frameworks (NodeJS is ideal)\u003c/li\u003e\n\u003cli\u003eModern front-end languages \u0026amp; frameworks (React is ideal)\u003c/li\u003e\n\u003cli\u003eStrong understanding of AWS and cloud native application development (microservices architecture)\u003c/li\u003e\n\u003cli\u003eExperience with Docker\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNot Convinced Yet?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn addition to being part of a great company with a proven product, you’ll lead work on new and interesting technical challenges every day. You will be a trusted leader as we scale up. You will be empowered to succeed in your role with the resources and technology of an established global market leader. We also offer:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive compensation with extended benefits to look after the ones you love\u003c/li\u003e\n\u003cli\u003eFlexible schedule with a commitment to work-life balance – put your family first, for real\u003c/li\u003e\n\u003cli\u003eOpportunity to be a valued leader and work closely with our leadership team\u003c/li\u003e\n\u003cli\u003eOngoing training and development opportunities to propel your career\u003c/li\u003e\n\u003cli\u003eLeading, modern technology and tools to build and experiment with\u003c/li\u003e\n\u003cli\u003eInclusive and collaborative culture built on communication and respect\u003c/li\u003e\n\u003cli\u003eFun social events to spend time with your teammates\u003c/li\u003e\n\u003cli\u003eSocial team and a physical environment designed for connection (On-site foosball, ping pong, beer on tap, gym, rooftop patio, and more!)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eExcited to learn more? Apply today with your resume and cover letter!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePAI Health is an Equal Opportunity employer and welcomes everyone to our team. If you need reasonable accommodation at any point in the application or interview process, please let us know. In your application, please feel free to note which pronouns you use (for example: she/her/hers, he/him/his, they/them/theirs, etc).\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply directly through our career page!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://paihealth.bamboohr.com/jobs/view.php?id=124\"\u003ehttps://paihealth.bamboohr.com/jobs/view.php?id=124\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdk9VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--610dedda3ec8002b2b35934b4f2d7c6d45460449/PAI%20Logo.png"},{"id":"c1d87c76-9f54-44b2-807c-983109e7c503","type":"Full Time","url":"https://jobs.github.com/positions/c1d87c76-9f54-44b2-807c-983109e7c503","created_at":"Fri Jan 08 16:23:54 UTC 2021","company":"Cognate BioServices","company_url":"http://www.cognatebioservices.com","location":"Memphis, TN ","title":"Data Analytics Engineer","description":"\u003cp\u003eData Analytics Engineer (Business Intelligence)\u003c/p\u003e\n\u003cp\u003eThis position will play an important role in transforming data into actionable information by enabling deeper understanding and improvement of business processes. In this role, the individual will assist in analyzing and implementing business intelligence architecture for the organization. Additionally, identifying conclusions from business intelligence initiatives, interacting with a variety of stakeholders, and communicating critical requirements will be essential to help Cognate achieve its organizational goals.\nEDUCATION and EXPERIENCE\nBachelor's degree in IT, Computer Science, Engineering, Finance or related field.\n3+ years of experience in data management, data engineering, visualization, and/or data warehousing\nDATA MANAGEMENT AND ANALYTICS\nExperience with data management and analysis. Skilled in dashboard design and development. Experience in Excel is required. Proficiency in Power BI / Tableau and database technologies such as SQL Server is required. Hands-on experience building, maintaining, and supporting business intelligence data backends, specifically data warehouses.\nExperience with enterprise (Azure, AWS, etc.) or open-source (Apache Spark, Delta Lake, etc.) cloud services preferred.\nSpecific skills consistent with Microsoft technical architecture preferred, including Microsoft BI stack (SSIS, SSAS, SSRS, Power BI, Azure Data Factory)\nAbility to write and develop SQL queries required\nProficiency with DAX measures in Power BI\nData integration, ETL, or ELT experience required\nPython programming experience preferred\nIdeal candidate possesses strong business acumen, project management, and organizational skills\u003c/p\u003e\n\u003cp\u003eOTHER SKILLS AND REASONING ABILITY\nAdvanced skills in Office 365 products, especially Power Platform.\nExperience leveraging data to drive decisions in professional or extracurricular endeavors.\nComfortable working independently and collaboratively.\nProven (GitHub, Kaggle, etc.) ability to automate tasks or provide solutions that require a proficiency in programming.\nAbility to understand and use REST APIs\nAbility to comprehend, analyze, and interpret complex data sets.\nAbility to solve problems involving several options and forecast multiple outcomes.\nAdvanced analytical and quantitative aptitude.\nESSENTIAL DUTIES AND RESPONSIBILITES\nDevelops a deep familiarity with a variety of data sources including transactional databases, data warehouses, internal tools, and external integrations.\nCollaborate in the deployment of reporting and dashboard solutions\nParticipate in design, development, and analysis of data architecture and warehousing approaches\nUse effective data visualization techniques to communicate information clearly and efficiently\nWork to ensure the quality, accuracy, and integrity of data\nBuild, implement, support BI solutions\nTest, monitor, manage, and validate BI activity including data extraction, transformation, movement, loading, cleansing, and updating processes\nDevelop BI databases\nDemonstrate knowledge of enterprise source systems and database schemas\nBuild and maintain tabular models\nDevelop measures for aggregate analysis of production metrics\nPerform varying methods of data analysis\nParticipate in the development of consistent data definitions and use\nCreation of data / process flow documentation\nParticipate in developing and upholding data management and governance strategies\nDemonstrates a self-directed approach to departmental responsibilities\nDemonstrates the ability to deal with pressure to meet deadlines, to be accurate, and to handle constantly changing situations.\nAccepts additional projects and responsibilities as assigned\nDemonstrates capacity to deal with a variety of people and engage others in a cooperative and collaborative workspace\nCommitment to continuous education and exposure to modern tools and techniques\nContribute project deliverables to business intelligence projects internal groups.\nReview project deliverables including Power BI dashboards, formal reports, PowerPoint briefings, etc.\nAssist presentations (both in-person or virtually) of project progress meetings and presentations of results.\nProblem solve technical issues and answer internal stakeholder questions. Escalate issues to supervisor and dedicated technical resources as needed.\nRigorous review and improvement of project processes.\nProvide subject matter expertise on data-related processes and analyses.\nCreate, maintain and optimize creative data visualizations and dashboards (primarily in Power BI) to derive actionable intelligence.\nAggregation and analysis of quantitative data; forecast and trending of performance data.\nDevelop and refine cost models for licensing requirements of the organization\u003c/p\u003e\n\u003cp\u003e“Cognate BioServices provides equal employment opportunities to all employees and qualified applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.”\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"http://www.cognatebioservices.com/recruitment\"\u003ewww.cognatebioservices.com/recruitment\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eQuestions?\nContact \u003ca href=\"mailto:recruitment@cognatebioservices.com\"\u003erecruitment@cognatebioservices.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWith Enthusiasm,\nCognate BioServices Recruitment Team\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdTZVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--83e969b610128c8db511b3056aaa341eaba6f04a/CB_logo_50px.jpg"},{"id":"6b9326ee-7b5a-4346-95ea-a2e5ac4b7e81","type":"Full Time","url":"https://jobs.github.com/positions/6b9326ee-7b5a-4346-95ea-a2e5ac4b7e81","created_at":"Fri Jan 08 13:47:30 UTC 2021","company":"Limango","company_url":"https://www.limango.de/ehp","location":"Munich","title":"Backend Developer (m/w/d)","description":"\u003cp\u003e\u003cstrong\u003eOUR MISSION\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003elimango is the Online Shop for families – We wow our customers every day with a fantastic range of brands at very attractive prices. Based in Munich, our 300 employees share a passion for families. We do everything we can to understand their needs and fulfil their wishes. limango has everything families need: Fashion for Babies, Kids, Women and Men as well as Homeware, Toys, Cosmetics and Family holidays. At limango you’ll find both classic brands and upcoming brands from across Europe. Founded in 2007 and a member of the Otto Group since 2009 limango now has over 14 million members across Germany, Austria, France, the Netherlands and Poland and sells over 40 000 products daily to German customers alone. We want to continue to grow and win the trust of all mums in Europe. To help us achieve this, we’re looking for motivated, talented individuals to work with us and be a part of something big.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYOUR JOB\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIn the limango IT you get the chance to contribute your own ideas and know-how to the development of services all around the different processes of our ecommerce business\u003c/li\u003e\n\u003cli\u003eTogether with our experienced and international development teams you will improve and expand our backend systems.\u003c/li\u003e\n\u003cli\u003eYou will become part of our well-rehearsed agile teams of versatile and experienced developers and a dedicated product owner\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYOUR PROFILE\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA degree with a focus on IT or a comparable training\u003c/li\u003e\n\u003cli\u003eYou have sound professional experience in the development of scalable eCommerce applications in common PHP frameworks such as Symfony3+ as well as knowledge of OOP and design patterns\u003c/li\u003e\n\u003cli\u003eYou bring practical experience with RESTful APIs and service-oriented architecture\u003c/li\u003e\n\u003cli\u003eYou have profound experience in relational databases (MySQL/MariaDB)\u003c/li\u003e\n\u003cli\u003eDevOps and GoLang experience are desirable\u003c/li\u003e\n\u003cli\u003eA well-functioning tool is not enough for you - you enjoy optimizing complex IT processes!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOUR OFFER\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExciting, technically demanding challenges in a highly frequented online shop with focus on high scalability and performance\u003c/li\u003e\n\u003cli\u003eAgile development, Scrum teams, flat hierarchies and direct communication in a very comradely atmosphere\u003c/li\u003e\n\u003cli\u003eA steep learning curve in a dynamic company with international orientation\u003c/li\u003e\n\u003cli\u003eA great office in the Tech-Spot of Munich with probably the coolest roof terrace in the city\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eInterested? We look forward to receiving your complete application including a letter of motivation, salary requirements and your earliest possible starting date.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/91dfc700401f4516f524de96e990bd8e67c96cd6/68747470733a2f2f742e676f686972696e672e636f6d2f682f34366236373564613935616566336365303536613030383437393632343532633831363964663335383433356265613637343039303730353131343137333765\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/3da19f382e8b03a3806792ef69bba9bf9409afc798b74a417b52a1f9d37bf191\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdWlVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--03c2e83fd8a5bf41c8741c6fd2f78d253e64955c/Limango.jpg"},{"id":"148384d7-0fd0-4663-b888-119325b05d0d","type":"Full Time","url":"https://jobs.github.com/positions/148384d7-0fd0-4663-b888-119325b05d0d","created_at":"Fri Jan 08 12:07:52 UTC 2021","company":"Picnic Technologies BV","company_url":"http://join.picnic.app","location":"Amsterdam","title":"Java Developer","description":"\u003cp\u003e\u003cem\u003eAt Picnic we care about health and safety, so currently all interviews are done online and our team is working from home. We keep a close eye on the developments around Covid-19, and support your relocation to Amsterdam when it is safe to do so. It is possible to start working remotely with us.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003ePicnic is an app-only supermarket. We’re data driven with software at our core. Our world-class developers write immaculate code to support the world’s fastest growing supermarket. We’re on a quest for like-minded people to be part of the future of digital grocery shopping.\u003c/p\u003e\n\u003cp\u003e🏢 \u003cstrong\u003eWhere you fit in\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur developers are highly involved and essential to each part of our company. From route planning, scaling our customers’ analytics to handle enormous chunks of data, to calculating how many bananas we should have in our warehouse on a Thursday – our teams write, plan, and predict.\u003c/p\u003e\n\u003cp\u003eAs one of our Java Developers, you grab ownership of projects, grow, and work collaboratively with your colleagues. You design, test, evolve, and evaluate the nuts and bolts of our operation while offering a creative and analytical approach. You feel at home writing platforms and display an intricate understanding of how each line of code fits into a business plan.\u003c/p\u003e\n\u003cp\u003eAt Picnic your skills will be complemented with the latest tech and our diverse projects will keep you challenged and motivated. From designing, developing, and testing new user-facing features, to optimizing supply chain systems and improving the scalability and security of our platform: you’ll be managing individual project priorities, deadlines, and deliverables, while finding yourself fully immersed in an engaging startup culture.We don’t hide what we do. Instead, we open-source with the community that helped us grow. Here’s proof: \u003ca href=\"http://picnic.tech\"\u003ehttp://picnic.tech\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e👉🏼 \u003cstrong\u003eWho you are\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have a Bachelor’s or Master’s Degree in Computer Science or a related technical field\u003c/li\u003e\n\u003cli\u003eYou have at least three years of professional experience in programming and software development\u003c/li\u003e\n\u003cli\u003eYou have a profound understanding of back-end development, including Java, Spring MVC, MongoDB, Elastic and PostgreSQL\u003c/li\u003e\n\u003cli\u003eYour English skills are on point (no Dutch required)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e👩‍💻 \u003cstrong\u003eThe tech we use\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJava 11 (Reactor and Spring 5)\u003c/li\u003e\n\u003cli\u003eElasticSearch, RabbitMQ, Kinesis\u003c/li\u003e\n\u003cli\u003eMaven and Git\u003c/li\u003e\n\u003cli\u003ePostgreSQL, MongoDB\u003c/li\u003e\n\u003cli\u003eElastic MapReduce (EMR)\u003c/li\u003e\n\u003cli\u003eAWS, Docker, Kubernetes, Terraform, Vault\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eHungry for more? Check out \u003ca href=\"https://stackshare.io/picnic-technologies\"\u003ehttps://stackshare.io/picnic-technologies\u003c/a\u003e for an overview of our tech stack.\u003c/p\u003e\n\u003cp\u003e🍩 \u003cstrong\u003ePicnic perks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLocated in Amsterdam, our fun-filled office is the best place for you to focus on your Picnic projects. Equipped with your favorite hardware and surrounded by like-minded people, you’ll grow professionally and personally, while enjoying the startup life along the way. We like to keep our 40-hour work-week flexible around here.\u003c/p\u003e\n\u003cp\u003eOur tech team consists of 15 product teams, which handle tons of innovative projects. Sharing, mentoring and keeping up to date is a must at Picnic: Meetups, webinars, Lunch \u0026amp; Learn sessions, and our very own Tech academy make sure that’s taken care of. Your soft skills will get some attention as well, with tailored training and courses.\u003c/p\u003e\n\u003cp\u003eOur salaries are market competitive and our pension program will put your mind at ease.\u003c/p\u003e\n\u003cp\u003e🏡 \u003cstrong\u003eRelocation package?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSure! If you join Picnic from abroad, we’ll cover your trip to Amsterdam, sponsor your Visa, and offer you a month of accommodation while you settle in.\u003c/p\u003e\n\u003cp\u003eIf you are joining us from a country that doesn’t allow traveling to the Netherlands just yet, there's a chance that your onboarding could take place remotely. We had lots of new team members starting their Picnic-journey remotely already, you can have a peek at how it's going here.\u003c/p\u003e\n\u003cp\u003eWhat are you waiting for? Get in touch! And no worries, the whole process is currently fully remote, to keep everyone safe and healthy.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eYou can apply via \u003ca href=\"mailto:jobs@teampicnic.com\"\u003ejobs@teampicnic.com\u003c/a\u003e or our  \u003ca href=\"https://join.picnic.app/job/java-developer-986403\"\u003ehttps://join.picnic.app/job/java-developer-986403\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdWFVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--deef7b7ea376417227c6fd2b4b7d4754ee5fa03e/Picnic_FC%20(1).jpg"},{"id":"d4b2f167-45b2-42a2-bc1b-7684996c0c47","type":"Full Time","url":"https://jobs.github.com/positions/d4b2f167-45b2-42a2-bc1b-7684996c0c47","created_at":"Fri Jan 08 10:51:54 UTC 2021","company":"HROffice","company_url":"http://www.hroffice.nl","location":"Utrecht","title":"Developer tech hub HROffice in Utrecht","description":"\u003cp\u003e\u003cem\u003eKom jij ons team versterken als Developer bij onze Tech Hub in Utrecht?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eHROffice heeft voor haar locatie in Utrecht een vacature voor een\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDeveloper Tech Hub\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBij HROffice, een onderdeel van de organisatie Adver-Online, bedenken, ontwikkelen en leveren we unieke en mooie softwareoplossingen voor HR gerelateerde vraagstukken. Omdat we deze oplossingen zelf van A tot Z ontwikkelen, vormen we met onze collega's een veelzijdig en mooi team. Met veel passie helpen we op deze manier grote klanten in de uitzendwereld, zoals Start People, Flexibility en Unique, maar hebben we ook partnerships met Ingram Micro, Bol.com, Motip Dupli en Holland Casino.\u003c/p\u003e\n\u003cp\u003eWij helpen deze, en meer dan 200 andere klanten, met SAAS software op het gebied van onder andere recruitment (HROffice ATS), contracting (HROffice Contracts), planning en workforce management (Isabel en HROffice Workforce Management) en ons event-driven connectiesysteem (HROffice Connect). Daarnaast helpen we klanten met onboarding via ons zusterbedrijf Appical.\u003c/p\u003e\n\u003cp\u003eIn een niet-Corona periode werken we hoofdzakelijk vanuit ons kantoor in Utrecht, met een prima verhouding op het gebied van thuiswerken. Na onze dagelijkse standup (verdeeld over 2 teams) werken we samen aan de doorontwikkeling van onze producten. Om ons proces fijn te laten lopen, hanteren we onderdelen van de projectmethodieken Scrum en Kanban. Daarnaast zorgen we ervoor dat je tijdens het werk veel vrijheid voelt, je de ruimte hebt om zelfstandig en met jouw team beslissingen te nemen en ligt er om die reden veel verantwoordelijk bij jezelf.\u003c/p\u003e\n\u003cp\u003eOm onze software te ontwikkelen, maken we gebruik van veel Microsoft based oplossingen. Werken met de .NET stack in combinatie met Angular is de basis en we maken gebruik van diverse andere technieken.\u003c/p\u003e\n\u003cp\u003eVoor ons ontwikkelteam zijn we op zoek naar twee nieuwe collega’s. Wij vinden hierbij de volgende zaken belangrijk:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJe hebt veel persoonlijk contact en denkt actief mee met onze klanten;\u003c/li\u003e\n\u003cli\u003eAls actief onderdeel van het team heb je veel vrijheid om de werkzaamheden naar eigen inzicht in te delen;\u003c/li\u003e\n\u003cli\u003eEr zijn veel mogelijkheden om met nieuwe technieken te experimenteren;\u003c/li\u003e\n\u003cli\u003eJe krijgt de ruimte om te groeien in de rol die je uitvoert, van junior naar medior of van medior naar senior.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDaarnaast ga je als developer het volgende doen:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJe versterkt het team in Utrecht, als junior, medior of senior developer;\u003c/li\u003e\n\u003cli\u003eJe werkt met het team, de scrum master / product owner en de klant de gewenste functionaliteiten uit en bekijkt hoe deze functionaliteiten ontwikkeld kunnen worden;\u003c/li\u003e\n\u003cli\u003eJe verdeelt de taken met jouw team en realiseert (in onder andere C#), documenteert en test (functionaliteit, veiligheid en performance) de door jou en je team opgepakte functionaliteit (UI, backend).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWij hebben met ons team nadacht over wat wij belangrijke eigenschappen en kenmerken van onze nieuwe teamleden vinden:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJe bent leergierig, flexibel, enthousiast en hebt een team-gerichte en positief ingestelde persoonlijkheid;\u003c/li\u003e\n\u003cli\u003eJe daagt jezelf uit om processen binnen onze systemen te doorgronden en te begrijpen;\u003c/li\u003e\n\u003cli\u003eJe spreekt bij voorkeur Nederlands, Engels is een pre;\u003c/li\u003e\n\u003cli\u003eJe bent communicatief vaardig en vindt het leuk om klanten te woord te staan;\u003c/li\u003e\n\u003cli\u003eHebben we humor al genoemd? ;)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWord je blij van de manier waarop wij als team mooie software ontwikkelen? En, is er een goede match met ons team? Dan bieden we jou natuurlijk een marktconform salaris, veel flexibiliteit en veel gedreven collega’s.\u003c/p\u003e\n\u003cp\u003eDe ingangsdatum is in overleg, want wij vinden een goede match voor beide partijen belangrijker dan te gehaast te werk gaan. Maar, we kunnen niet wachten tot je aansluit bij ons team.\u003c/p\u003e\n\u003cp\u003eZodra we van je horen, laten wij weten of we (digitale) koffie gaan drinken. Tijdens het eerste gesprek zullen er 2 teamleden uit ons team aanhaken. Na de eerste kennismaking zullen we, bij wederzijds enthousiasme, in een vervolggesprek concreter worden over de samenwerking.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eHeb je interesse in deze vacature? Dan nodigen wij je van harte uit om te reageren. Laat je CV en motivatie achter via onze \u003ca href=\"https://werkenbij.adver-online.nl/vacatures/172065-vacature/solliciteren?utm_source=github\u0026amp;utm_medium=referral\u0026amp;utm_term=2021\u0026amp;utm_content=172065\u0026amp;utm_campaign=developer-tech-hub\"\u003esollicitatiepagina\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eTrefwoorden: IT, ICT, Developer, Software Developer, Software Ontwikkelaar, Software Ontwikkeling, .NET Developer, .NET Ontwikkelaar, vacature Utrecht\u003c/em\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdCtVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--715b7ac3785011de9292da5aca30fdd353c8b634/Logo%20nieuw.jpg"},{"id":"85ba20ff-912e-40c9-98c2-1cfe050dfe90","type":"Full Time","url":"https://jobs.github.com/positions/85ba20ff-912e-40c9-98c2-1cfe050dfe90","created_at":"Fri Jan 08 06:16:54 UTC 2021","company":"DocVocate, Inc.","company_url":"http://docvocate.com","location":"Portland, Oregon or US West Coast","title":"Lead Engineer - Healthcare SaaS  ","description":"\u003cp\u003e\u003cstrong\u003eTitle:\u003c/strong\u003e Lead Engineer\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLocation:\u003c/strong\u003e Portland, OR or US West Coast\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation:\u003c/strong\u003e $200k-$300k/year\u003c/p\u003e\n\u003cp\u003eThe US healthcare system does not cover all Americans, and is often frustrating for those that it does. The frustration comes from unnecessarily high medical care costs and a complete lack of cost transparency. At DocVocate, we’re out to fix that!\u003c/p\u003e\n\u003cp\u003eDocVocate is a VC-backed, rapidly growing healthtech startup on a mission to make medical claim processing easy for doctors and patients. Our API-driven platform is a first of its kind: universal, AI-driven claims management solution for healthcare providers.\u003c/p\u003e\n\u003cp\u003eWe are looking for a Lead Engineer with a mix of hands-on software development and agile management skills to join our team.  We are seeking a Lead Engineer looking to develop into a company leader. The ideal candidate resides in or near the US Pacific Time Zone. If you are passionate about building a deeply impactful and innovative platform, and working tirelessly to achieve success, we’d love to meet with you.\u003c/p\u003e\n\u003cp\u003eIn partnership with DocVocate’s leadership team, the Lead Engineer will be responsible for building, leading, and managing our engineering team to deliver the AI-driven healthcare financial platform of the future.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003eWhat You Will Do\u003c/strong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCoordinate and direct our existing SW development, DevOps, and QA resources.\u003c/li\u003e\n\u003cli\u003eBuild our capabilities by adding and developing staff as necessary, and maturing our software - development lifecycle.\u003c/li\u003e\n\u003cli\u003ePrioritize engineering team backlogs and plan releases.\u003c/li\u003e\n\u003cli\u003eLead agile rituals such as standups, grooming sessions, retrospectives, and demos.\u003c/li\u003e\n\u003cli\u003eContribute to our products directly by developing software.\u003c/li\u003e\n\u003cli\u003eParticipate in relationships with key customers and partners that inform engineering plans.\u003c/li\u003e\n\u003cli\u003eRegularly and proactively communicate delivery schedules and achievements to key stakeholders.\u003c/li\u003e\n\u003cli\u003eTravel occasionally to industry events as well as internal, customer and partner meetings (when it is safe to do so).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003eWho You Are\u003c/strong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have played a major role in building a successful, high-volume B2B SaaS solution, preferably  in healthcare, financial services, or another highly regulated industry.\u003c/li\u003e\n\u003cli\u003eYou are an experienced engineer or engineering manager that can be effective right away in a cloud-native AWS environment that uses the following technologies:\u003c/li\u003e\n\u003cli\u003ePython, JavaScript, PostgreSQL\u003c/li\u003e\n\u003cli\u003eReact, Django\u003c/li\u003e\n\u003cli\u003eAWS Cloudfront, EC2. S3, Lambda, Fargate, Athena\u003c/li\u003e\n\u003cli\u003eGithub, CircleCI\u003c/li\u003e\n\u003cli\u003eTerraform, Packer, Cypress\u003c/li\u003e\n\u003cli\u003eElastic Cloud\u003c/li\u003e\n\u003cli\u003eJira, Slack, Confluence, Trello\u003c/li\u003e\n\u003cli\u003eYour primary competence is software development, but you have sufficient knowledge of QA, data engineering, and DevOps to set priorities for these disciplines and gauge the quality of their work.\u003c/li\u003e\n\u003cli\u003eYou have experience personally resolving production issues in multilayered SaaS products.\u003c/li\u003e\n\u003cli\u003eYou have a deep curiosity that drives you to learn, investigate, and constantly ask why.\u003c/li\u003e\n\u003cli\u003eYou have a strong sense of ownership and a \"whatever it takes\" attitude towards getting stuff done.\u003c/li\u003e\n\u003cli\u003eYou have expert communication skills, including the ability to motivate and direct other engineers.\u003c/li\u003e\n\u003cli\u003eYou are comfortable with ambiguity, and have an instinct for moving quickly.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003eWhat’s In It For You\u003c/strong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBuild revenue cycle products to improve efficiency of health care delivery as COVID-19 continues to expose and overwhelm the U.S. healthcare system.\u003c/li\u003e\n\u003cli\u003eWork closely with top healthcare professionals in a rapidly growing, seed-stage startup.\u003c/li\u003e\n\u003cli\u003eReceive attractive cash and equity compensation, based on experience.\u003c/li\u003e\n\u003cli\u003eThrive in a flexible, open-minded, and supportive culture.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAt DocVocate, we are committed to building a diverse and inclusive company. We seek to create a culture where everyone can belong because we believe that people do their best work when they can show up every day as their authentic selves. We welcome people of different backgrounds, experiences, abilities, and perspectives.\u003c/p\u003e\n\u003cp\u003eDocVocate is an equal opportunity employer. We do not make hiring or employment decisions on the basis of race, religion, color, national origin, gender, gender identity, sexual orientation, age, marital status, veteran status, disability status or genetic information, in compliance with applicable federal, state and local law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply here: \u003ca href=\"https://airtable.com/shrFWheKWwIWuvY1x\"\u003ehttps://airtable.com/shrFWheKWwIWuvY1x\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDJVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2ae04973291e4e16939a8307828ba18f857d4b22/logo-docvocate@2x.png"},{"id":"1731001f-91e1-415e-a865-898a9f1279fa","type":"Full Time","url":"https://jobs.github.com/positions/1731001f-91e1-415e-a865-898a9f1279fa","created_at":"Thu Jan 07 23:34:50 UTC 2021","company":"avoMD","company_url":"http://avomd.io","location":"Remote in the US","title":"Lead Engineer","description":"\u003cp\u003eJob Description – Lead Engineer\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eavoMD Overview\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eavoMD is a software platform for next-gen clinical guidelines and pathways. By transforming complex medical guidelines into interactive apps that clinicians love, our technology ensures the practice of evidence-based medicine and enhances patient care. Some of our current partners include PM Pediatrics, the nation’s largest pediatric urgent care, and Samsung Medical Center, Korea’s 2nd largest hospital. We were recently accepted into 500 Startups and Startup Health, received a large investment from Columbia’s endowment, and won 1st place in Columbia and Penn Medicine’s annual startup competitions.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eProduct Overview\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eavoMD is a no-code platform for creating bot-based modules that help providers (physicians, nurse practitioners, nurses)  make better decisions. Each module is functionally similar to buttons bots with conversational interfaces. The platform consists of two components:  (1) the avoBuilder, a no-code authoring tool for these bot modules that allows clinician authors to collaboratively “drag and drop” their way to building and updating bots without coding. The avoBuilder is based on ReactJS/Django/PostgreSQL. (2) The PoC/Client App, a mobile and desktop app (available on iOS, Android, and desktop) for clinician end users who can open and access the bot modules created in the avoBuilder. This tool is based on React Native/Firebase.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eavoMD is seeking an experienced software engineer who can step in and lead our fast growing, dynamic engineering team (which includes offshore developers), deliver timely solutions to the market, and collaborate with the product team and company founders. Ultimately, the Lead Engineer will be responsible for ensuring that the product vision is realized through excellence in execution. The Lead Engineer will have the ability to bridge technology with business acumen, bring experience in developing customer-facing applications, and develop and sustain a culture of passion, hard-work, and innovation that makes avoMD the place to be for anyone interested in developing healthcare’s next best mobile platform.\u003c/p\u003e\n\u003cp\u003eThe position can be remote and we are willing to offer competitive salary and equity compensation. We are looking for candidates who can start working immediately on a full-time basis.\n \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKey Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Lead Engineer has responsibility for the overall engineering, testing, and architecture of the avoMD platform. Additionally, this individual will get their hands dirty and is expected to directly work on the code base when needed.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePeople. Directly manages and supervises our rapidly growing offshore development team (we’re now at 6 developers in Pakistan).\u003c/li\u003e\n\u003cli\u003eProjects + Engineering. Oversees the development, implementation and execution of multiple projects ensuring scope and schedule are established for projects; determines prioritization and staff deployment; acts based on changed priorities; can optimize scaling processes and architecture\u003c/li\u003e\n\u003cli\u003eTechnical. Technical lead who is willing to design, develop, and implement software components across the entire software stack\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe anticipate the Lead Engineer will spend 30% of their time on people and team management and 70% of their time on technical work, including architecture/best practices management and hands-on development.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSkills \u0026amp; Qualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of software engineering experience and background in managing small to medium-sized engineering teams (5+ people)\u003c/li\u003e\n\u003cli\u003eStrong working proficiency in React Native and React JS\u003c/li\u003e\n\u003cli\u003eDeep understanding of back-end technologies (we use Firebase and Django)\u003c/li\u003e\n\u003cli\u003eWorking knowledge of change management, disaster recovery, business continuity, and (internal) customer usage/access\u003c/li\u003e\n\u003cli\u003eAbility to think and plan strategically around scaling processes and architecture\u003c/li\u003e\n\u003cli\u003eComfortable with managing many work streams, and coordinating resources and prioritizing work across teams\u003c/li\u003e\n\u003cli\u003eStrong written and verbal communication skills\u003c/li\u003e\n\u003cli\u003eBonus: Prior experience (i) at an early stage company (if you’ve been a TLM) and (ii) developing user-facing products\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to Laurence at \u003ca href=\"mailto:lc@avomd.io\"\u003elc@avomd.io\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFNVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e8987daa090e02cb2c7aae43336eb78bc49219f0/Green%20algo%20black%20text%20logo.png"},{"id":"bdbcfdbd-8082-438a-b72e-19329f10c1ed","type":"Full Time","url":"https://jobs.github.com/positions/bdbcfdbd-8082-438a-b72e-19329f10c1ed","created_at":"Thu Jan 07 18:49:44 UTC 2021","company":"Inficon","company_url":"http:","location":"East Syracuse, NY, US 13057","title":"Senior Software Engineer","description":"\u003cp\u003eInficon\u003c/p\u003e\n\u003cp\u003eCategory: Engineering\nReq Number: SENIO01895\nJob Type: Full-Time\nLocation: East Syracuse, NY, United States\u003c/p\u003e\n\u003cp\u003eDescription\u003c/p\u003e\n\u003cp\u003eCOMPANY OVERVIEW:\u003c/p\u003e\n\u003cp\u003eINFICON is a growing, global, leading provider of innovative technologies that enhances productivity and quality in sophisticated industrial processes. The products provided by INFICON are world-class instruments for gas analysis, measurement, and control and are vital to manufacturers and end-users in the complex fabrication of semiconductors and thin film coatings for optics, flat panel displays, solar cells, and industrial vacuum coating applications. INFICON is headquartered in Switzerland and has world-class manufacturing facilities in Europe, the United States and China with subsidiaries located throughout the world. This position will be located at INFICON's U.S. headquarters in East Syracuse, NY. For more detailed information about INFICON, please visit our website at \u003ca href=\"http://www.inficon.com\"\u003ewww.inficon.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eJOB DESCRIPTION:\u003c/p\u003e\n\u003cp\u003eIn this position you will design, implement, test, deploy and maintain Linux-based software and firmware that interacts with underlying hardware modules across multiple products. You will immediately be integrated into multidisciplinary Agile engineering teams that work with a wide range of technologies including FPGAs, electronic sensors, and chemical analysis. You will solve difficult technical problems and focus on developing great code for multiple new products.\u003c/p\u003e\n\u003cp\u003eResponsibilities\nDesign, develop, and maintain embedded software for innovative scientific and industrial instruments\nUse Agile development processes to contribute via daily scrums, design/task planning, and code reviews\nBuild, test, and tune Linux application software and system services\nDesign and run laboratory and field tests to validate and troubleshoot software\nStay up to date on state of the art software technologies\u003c/p\u003e\n\u003cp\u003eREQUIRED QUALIFICATIONS:\nBachelors of Science (BS) in computer science, computer engineering, or software engineering.\n7+ years of C/C++ development experience in one or more of the following areas:\nLinux system/kernel development\nFirmware running under embedded and/or real-time OSes\nBare-metal microcontroller development\nBootloader development and initial board bring-up\u003c/p\u003e\n\u003cp\u003ePREFERRED QUALIFICATIONS:\nMasters of Science (MS) in computer science or related field\nExperience developing with Python, Git, Bash, Google Test, and RESTful APIs\nExperience with the YOCTO Project\nExperience with FPGA design and troubleshooting\nExperience with real-time DSP firmware\nContinuous integration, test automation, release management\u003c/p\u003e\n\u003cp\u003eCOMPENSATION \u0026amp; BENEFITS:\u003c/p\u003e\n\u003cp\u003eCompensation will be commensurate with experience including a competitive base salary, bonus opportunity, competitive benefits package, and generous relocation package.\u003c/p\u003e\n\u003cp\u003eEqual Opportunity Employer/Protected Veterans/Individuals with Disabilities\u003c/p\u003e\n\u003cp\u003eThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41 CFR 60-1.35(c)\u003c/p\u003e\n\u003cp\u003eEducation\u003c/p\u003e\n\u003cp\u003eBachelors or betterComputer Science\u003c/p\u003e\n\u003cp\u003eApply Here: \u003ca href=\"https://www.click2apply.net/NanEEyskJkpEf6jLsA1Eq\"\u003ehttps://www.click2apply.net/NanEEyskJkpEf6jLsA1Eq\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePI128268820\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply Here: \u003ca href=\"https://www.click2apply.net/NanEEyskJkpEf6jLsA1Eq\"\u003ehttps://www.click2apply.net/NanEEyskJkpEf6jLsA1Eq\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"0f5223c5-650a-4a97-be13-a45eb5e3f639","type":"Full Time","url":"https://jobs.github.com/positions/0f5223c5-650a-4a97-be13-a45eb5e3f639","created_at":"Thu Jan 07 16:50:21 UTC 2021","company":"Parity Technologies","company_url":"https://www.parity.io/","location":"Berlin/Remote","title":"CI/CD Engineer (m/f/d)","description":"\u003cp\u003eAre you the kind of person who tracks their shopping list with git?\u003c/p\u003e\n\u003cp\u003eOr maybe your cat feeder is activated automatically with Github Actions?\u003c/p\u003e\n\u003cp\u003eAre your opinions on Ansible vs Docker Compose for container orchestration coming from real-life experience?\u003c/p\u003e\n\u003cp\u003eParity Technologies is looking for a CI/CD Engineer to help us with automating an ever-growing set of open source repos in \u003ca href=\"https://github.com/paritytech\"\u003ehttps://github.com/paritytech\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWe’re looking for someone who prefers autonomy (\u003ca href=\"https://medium.com/paritytech/engineering-at-parity-what-its-like-c0e5c8a17870\"\u003ehttps://medium.com/paritytech/engineering-at-parity-what-its-like-c0e5c8a17870\u003c/a\u003e) over being told what to do, a person who would enjoy having to communicate the solutions of their own picking to others in a loosely-structured work environment, and someone who sees their life goal in automating the unautomateable and then optimizing its’ build pipeline for sub-second latencies.\u003c/p\u003e\n\u003cp\u003eYou would need to be proficient with:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGithub Actions, Gitlab CI or similar workflow automation tools (we might challenge you with building us a time-off notification bot using nothing but CI tools on occasion)\u003c/li\u003e\n\u003cli\u003eTheir ancestors: makefiles and bash scripting (are you able to tell \u003ccode\u003e[\u003c/code\u003e and \u003ccode\u003e[[\u003c/code\u003e apart in a script?)\u003c/li\u003e\n\u003cli\u003eAnatomy of Linux systems (what are the most used option flags for \u003ccode\u003ejournalctl\u003c/code\u003e?)\u003c/li\u003e\n\u003cli\u003eAnd then treating those systems like cattle, not pets — with Ansible, Terraform or similar orchestration tools\u003c/li\u003e\n\u003cli\u003eFancy new container tech: Docker, Podman etc (do you know what buildkit adds to the table? What would you do to extract a binary from a prebuilt third-party image?)\u003c/li\u003e\n\u003cli\u003eand of course, the omnipresent elephant in the room, git in its numerous applications (did you know that we use Github as an improvised CMS for our websites?)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIt would also help if you:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHave an idea of how Rust code is being built and what Cargo do\u003c/li\u003e\n\u003cli\u003eSpeak some other programming languages: JS, Python, Go, maybe even Perl (but you would have to make a really convincing case before introducing this one into our pipelines)\u003c/li\u003e\n\u003cli\u003eEver solved non-trivial issues with CI caching in large-scale build systems\u003c/li\u003e\n\u003cli\u003eWill be able to look into eyes of Kubernetes and whisper “I’m not afraid of you”\u003c/li\u003e\n\u003cli\u003eDisplay obsessive traits when it comes to retaining and organizing operation metrics of the tools you use\u003c/li\u003e\n\u003cli\u003eAre able to reason about security properties of codebases and infrastructure setups, or even (in an ideal case) know how to fuzz.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBenefits:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorking at Parity means focusing on the stuff that counts: building of the most cutting-edge technology for the future web. Our teams enjoy a high degree of trust, freedom and autonomy to achieve that goal.\u003c/li\u003e\n\u003cli\u003eBecause we value initiative and learning, we've defined a generous personal budget to attend conferences or skills courses of your own choosing. We think you know what's best for you!\u003c/li\u003e\n\u003cli\u003eParity is a diverse company with people from various countries and we will support you with German language courses and relocation where needed.\u003c/li\u003e\n\u003cli\u003eMany of us who collaborate do not work in the same place. We have a remote-friendly company setup.\u003c/li\u003e\n\u003cli\u003eBringing the team together is something we value a lot, so we used to regularly go on team retreats and are planning to do so again, once the international health regulations allow it.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTo see how we use your data please see our Applicant Notice (\u003ca href=\"https://www.parity.io/applicant-notice/\"\u003ehttps://www.parity.io/applicant-notice/\u003c/a\u003e).\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply here: \u003ca href=\"https://www.parity.io/apply/?gh_jid=4030037003\"\u003ehttps://www.parity.io/apply/?gh_jid=4030037003\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEdVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0f77848ec5d36830d7bed1729b29d2a3c3ecbe6a/parity-logo-high-res-white-with-spacing.png"},{"id":"72dd792b-5789-4451-b403-9510d0e478d3","type":"Full Time","url":"https://jobs.github.com/positions/72dd792b-5789-4451-b403-9510d0e478d3","created_at":"Thu Jan 07 15:36:41 UTC 2021","company":"Rails Machine","company_url":"https://www.railsmachine.com","location":"REMOTE","title":"Site Reliability Engineer","description":"\u003cp\u003eRails Machine has been handling infrastructure and managed operations for Rails Applications since 2006.  We handle all of our customers Infrastructures, Daily Operational needs, and 24x7 Alert Response so that they can focus on their application.   If you’re passionate about Ruby on Rails and managing Cloud Infrastructure, you’re going to LOVE working with us.\u003c/p\u003e\n\u003cp\u003eMinimum Qualifications :\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with config management or automation frameworks. (i.e. Ansible / Terraform /  CloudFormation / Capistrano)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eProficient in at least one Programming Language\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience maintaining production infrastructure in a Linux Environment.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong DevOps Experience and Customer Service mindset.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAbility to participate in on-call/pager rotation.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eU.S. Residents Only.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eInterested? Tell us what you can bring to the team by emailing \u003ca href=\"mailto:hiring@railsmachine.com\"\u003ehiring@railsmachine.com\u003c/a\u003e !\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcytVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--321295c0e9e1fc8abf130bbab878469d2fb87f37/RM-Logo-1x1.png"},{"id":"493d2348-2d02-4ee6-8c3e-e4e72da01af8","type":"Full Time","url":"https://jobs.github.com/positions/493d2348-2d02-4ee6-8c3e-e4e72da01af8","created_at":"Thu Jan 07 14:30:17 UTC 2021","company":"PVH","company_url":"http:","location":"Amsterdam","title":"Senior Software Engineer ","description":"\u003cp\u003eAt PVH we are transforming the fashion industry by breaking conventions every single day. We are always exploring ways to bring the industry forward and constantly accelerating the pace in which we do business. We believe that to succeed as a fashion lifestyle company we need to offer much more than high quality trendy collections. Our goal is to become the ultimate Fashion Tech brand.\u003c/p\u003e\n\u003cp\u003eOur Technology team is the driving force in the organization for technology strategies \u0026amp; tools that enable the company’s growth and create ever-increasing value for the end-user, be it the PVH organization, the employees, our customers or consumers.\u003c/p\u003e\n\u003ch2\u003eThe role\u003c/h2\u003e\n\u003cp\u003eAs part of Enablers for B2C \u0026amp; B2B Ecosystem you will be responsible for building and maintaining APIs that allow integrations between different systems with B2C \u0026amp; B2B Ecosystem, consisting of Ecommerce, B2C, B2B WebShop, Digital Showroom and many others. Quality, performance under load, observability and building portable and reusable solutions are key.\u003c/p\u003e\n\u003ch2\u003eKey Responsibilities:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop APIs that are scalable and high performing\u003c/li\u003e\n\u003cli\u003eDeliver maintainable code\u003c/li\u003e\n\u003cli\u003eDefine the CI/CD strategy in collaboration with the rest of the team + DevOps team\u003c/li\u003e\n\u003cli\u003eWork with the teams to identify improvements for existing and new core services, define the solution direction\u003c/li\u003e\n\u003cli\u003eLiaise with other tech leads, architects and communities to ensure knowledge sharing\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eThe Ideal Candidate:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eIs inspiring and exude energy and passion for IT solutions\u003c/li\u003e\n\u003cli\u003eIs focused on collaboration including non-tech people\u003c/li\u003e\n\u003cli\u003eActively seeks help and feedback, but is not afraid to give feedback either\u003c/li\u003e\n\u003cli\u003eIs curious and always looks out for innovation opportunities in his/her focus area\u003c/li\u003e\n\u003cli\u003e7+ years experience in Software Engineering\u003c/li\u003e\n\u003cli\u003e5+ years experience in developing API’s, Web applications and integrations with different systems\u003c/li\u003e\n\u003cli\u003eStrong experience with Java and/or .Net\u003c/li\u003e\n\u003cli\u003eWorking experience with frameworks like Quarkus, Spring, SpringBoot, Micronaut or Vert.x\u003c/li\u003e\n\u003cli\u003eGood knowledge and understanding of REST\u003c/li\u003e\n\u003cli\u003eExperience in building Microservices, Docker, CI/CD, and DevOps way of working\u003c/li\u003e\n\u003cli\u003eExperience with AWS or other Cloud providers is a plus\u003c/li\u003e\n\u003cli\u003eKnowledge of technologies like GraphQL, Kafka, ELK stack, Couchbase, MsSQL, Ansible, gRPC, and BDD/TDD is a plus\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWhat you can expect form us:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eA beautiful state-of-the-art Campus, complete with our very own People's Place Gym and People's Place Cafés\u003c/li\u003e\n\u003cli\u003eA company culture that fosters development, offering training and learning opportunities through our very own PVH University\u003c/li\u003e\n\u003cli\u003eAn international environment which respects diversity, equality, and individuality\u003c/li\u003e\n\u003cli\u003eA smart work program that empowers our associates to work at their preferred location within a flexible schedule\u003c/li\u003e\n\u003cli\u003eA chance to unwind with weekly social activities\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003ePVH Europe and our brands, TOMMY HILFIGER and CALVIN KLEIN, are committed to fostering an inclusive and diverse community of associates with a strong sense of belonging. We believe we are bettered by all forms of diversity, and take pride in working with top talent from every walk of life and corner of the world. In the spirit of inclusivity, qualified applicants will be considered without regard to age, ethnicity, ability, gender, gender expression, gender identity, nationality, race, religion or sexual orientation.\u003c/em\u003e\u003c/p\u003e\n\u003ch2\u003eInterested\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/2XfGnrC\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/2XfGnrC\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczJVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7d13e28dc3e53eb4a6eed60e80b20671b48c3e3e/PVH.jpeg"},{"id":"6986e1a2-990e-4386-9ca7-80a56293a4b3","type":"Full Time","url":"https://jobs.github.com/positions/6986e1a2-990e-4386-9ca7-80a56293a4b3","created_at":"Thu Jan 07 11:49:50 UTC 2021","company":"Hasura","company_url":"https://hasura.io/","location":"Remote","title":"Support Engineer (Hasura Cloud)","description":"\u003cp\u003eHasura is hiring Customer Support Engineers who can help our users get productive with Hasura Cloud. This is a technical customer-facing role with a focus on helping users and customers achieve success in their use of Hasura Cloud.\u003c/p\u003e\n\u003cp\u003eYou will work with our users to ensure their queries are responded to and their problems are resolved. Internally, you will act as the voice of the user within the company, and liaise with the product and documentation teams to surface necessary changes.\u003c/p\u003e\n\u003cp\u003eWe are a globally distributed team, with offices in San Francisco.\u003c/p\u003e\n\u003cp\u003eWhat the role will involve:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAnswer questions, troubleshoot problems, and provide deep technical support to our users over email and live chat.\u003c/li\u003e\n\u003cli\u003eSchedule calls and/or pair programming sessions as needed to help users resolve problems.\u003c/li\u003e\n\u003cli\u003eSpecial focus on onboarding support to help new users get productive with Hasura Cloud quickly.\u003c/li\u003e\n\u003cli\u003eWork with the Product team to tweak the onboarding and overall Product UX for a better developer experience.\u003c/li\u003e\n\u003cli\u003eWork with the Documentation team to ensure our docs address common questions and use-cases.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSolid understanding of the modern web application stack. You are familiar with one or more of the following technologies: Typescript, React, Angular, Vue, GraphQL, Node.js.\u003c/li\u003e\n\u003cli\u003ePrevious experience in a customer-facing technical role.\u003c/li\u003e\n\u003cli\u003eCreative problem-solving skills, with the ability to troubleshoot problems and identify workarounds.\u003c/li\u003e\n\u003cli\u003eVery good written \u0026amp; spoken communication skills in English.\u003c/li\u003e\n\u003cli\u003eBonus: Familiarity with one or more of: Kubernetes/Docker, Android/iOS, Postgres, Java, CI/CD tooling.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eLocation:\u003c/p\u003e\n\u003cp\u003eThis role will be based out of the following locations:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOur office in Bangalore, India\u003c/li\u003e\n\u003cli\u003eOut of US: We hire remotely in these 10 states in the US: Illinois, Virginia, California, Washington State, Maryland, Florida, Colorado, Massachusetts, Oregon, New York.\nWe have an office in SF, and if you're based in SF, you can choose to work out of our office.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWorking at Hasura:\u003c/p\u003e\n\u003cp\u003eAt Hasura, we help developers build modern apps and APIs faster. Through your work at Hasura, you will have the opportunity to make a lasting impact on both Hasura as well as the larger developer ecosystem.\u003c/p\u003e\n\u003cp\u003eAs a team, we take a lot of pride in our work. We obsess over the developer experience, and our first priority as a company will always be to make things easier for our users.\u003c/p\u003e\n\u003cp\u003eWe offer competitive salaries, have a generous vacation policy and provide health insurance for everyone employed with Hasura.\u003c/p\u003e\n\u003cp\u003eWe are an equal opportunity employer and do not tolerate discrimination of any kind.\u003c/p\u003e\n\u003cp\u003eAbout Hasura:\u003c/p\u003e\n\u003cp\u003eHasura is a venture-backed open-source technology company with offices in San Francisco and Bangalore. Hasura makes your data instantly accessible over a real-time GraphQL API, so you can build and ship modern apps and APIs faster. Hasura connects to your databases, REST servers, GraphQL servers and third-party APIs (eg: Stripe, Salesforce) and provides a unified API across all your data sources.\u003c/p\u003e\n\u003cp\u003eWe are a globally distributed team, with offices in San Francisco \u0026amp; Bangalore.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eYou can apply using this link:\n\u003ca href=\"https://hasura.info/3rWJvXP\"\u003ehttps://hasura.info/3rWJvXP\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3VVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dae42066003da6174c28bccad65275d46797aee2/logo_black.png"},{"id":"81f1d6e5-1d71-4142-8216-f8629ef88019","type":"Full Time","url":"https://jobs.github.com/positions/81f1d6e5-1d71-4142-8216-f8629ef88019","created_at":"Thu Jan 07 11:43:34 UTC 2021","company":"Hasura","company_url":"http:","location":"Remote","title":"Senior DevOps / Site Reliability Engineer (SRE) - Hasura Cloud","description":"\u003cp\u003eBrief Overview:\u003c/p\u003e\n\u003cp\u003eDevOps Engineers and Site Reliability Engineers (SREs) are responsible for keeping Hasura Cloud systems running smoothly and making sure updates can be rolled out reliably without any downtime.\u003c/p\u003e\n\u003cp\u003eHasura Cloud is a unique GraphQL infrastructure product where we try to abstract away all the raw compute concepts from the user. A user should be able to only care about the limits they set based on the concurrent requests and latencies they can afford and the system should be able to accommodate and scale to the user requirements.\u003c/p\u003e\n\u003cp\u003eKey Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe on a PagerDuty rotation to respond to Hasura Cloud availability incidents and provide support for service engineers with customer incidents.\u003c/li\u003e\n\u003cli\u003eUse your on-call time to be on the front line: respond to incidents, and take action to fulfil our SLOs. Use your dev time to address the systemic issues you’ve identified, to proactively prevent incidents from happening.\u003c/li\u003e\n\u003cli\u003eRun our infrastructure with Terraform, Kubernetes, VMs and bare metal instances.\u003c/li\u003e\n\u003cli\u003eDesign smart monitoring that alerts on symptoms (our SLIs) rather than on causes, to make each alert meaningful and actionable.\u003c/li\u003e\n\u003cli\u003eDocument every action so your findings turn into repeatable actions–and then into automation.\u003c/li\u003e\n\u003cli\u003eImprove the deployment process to make it as boring as possible.\u003c/li\u003e\n\u003cli\u003eDesign, build and maintain core infrastructure pieces that allow Hasura Cloud scaling to support thousands of concurrent requests from our users.\u003c/li\u003e\n\u003cli\u003eDebug production issues across services and levels of the stack.\u003c/li\u003e\n\u003cli\u003eExpand Hasura Cloud to support multiple Cloud providers.\u003c/li\u003e\n\u003cli\u003ePlan the growth of Hasura Cloud's infrastructure.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou may be a fit to this role if you:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThink about systems - edge cases, failure modes, behaviors, specific implementations.\u003c/li\u003e\n\u003cli\u003eKnow your way around Linux and the Unix Shell.\u003c/li\u003e\n\u003cli\u003eKnow what is the use of declarative infrastructure tools like Terraform.\u003c/li\u003e\n\u003cli\u003eHave strong programming skills (Go/Python).\u003c/li\u003e\n\u003cli\u003eHave an urge to collaborate and communicate asynchronously.\u003c/li\u003e\n\u003cli\u003eHave an urge to document all the things so you don't need to learn the same thing twice.\u003c/li\u003e\n\u003cli\u003eHave an urge to build automation and tooling so that you never have to do the same work twice.\u003c/li\u003e\n\u003cli\u003eHave an enthusiastic, go-for-it attitude. When you see something broken, you can't help but fix it.\u003c/li\u003e\n\u003cli\u003eHave an urge for delivering quickly and iterating fast.\u003c/li\u003e\n\u003cli\u003eHave experience with Nginx, Openresty, Docker, Kubernetes, Terraform, or similar technologies.\u003c/li\u003e\n\u003cli\u003eHave experience with various Cloud providers like AWS, GCP, Azure, DO etc., their systems, products and APIs.\u003c/li\u003e\n\u003cli\u003eHave experience with monitoring tools like Datadog/Prometheus/Grafana.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points for:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHave experience with Hasura and its GraphQL APIs.\u003c/li\u003e\n\u003cli\u003eHave strong fundamentals in SQL, particularly with PostgreSQL.\u003c/li\u003e\n\u003cli\u003eHave experience with database management and scaling.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eLocation:\u003c/p\u003e\n\u003cp\u003eThis role is fully remote. We hire in most countries. If you're applying from the US, we hire remotely in these 10 states in the US: Illinois, Virginia, California, Washington State, Maryland, Florida, Colorado, Massachusetts, Oregon, New York or this role will be based out of our office in Bangalore, India.\u003c/p\u003e\n\u003cp\u003eWorking at Hasura:\u003c/p\u003e\n\u003cp\u003eAt Hasura, we help developers build modern apps and APIs faster. Through your work at Hasura, you will have the opportunity to make a lasting impact on both Hasura as well as the larger developer ecosystem.\u003c/p\u003e\n\u003cp\u003eAs a team, we take a lot of pride in our work. We obsess over the developer experience, and our first priority as a company will always be to make things easier for our users.\u003c/p\u003e\n\u003cp\u003eWe offer competitive salaries, have a generous vacation policy and provide health insurance for everyone employed with Hasura.\u003c/p\u003e\n\u003cp\u003eWe are an equal opportunity employer and do not tolerate discrimination of any kind.\u003c/p\u003e\n\u003cp\u003eAbout Hasura:\u003c/p\u003e\n\u003cp\u003eHasura is a venture-backed open-source technology company with offices in San Francisco and Bangalore. Hasura makes your data instantly accessible over a real-time GraphQL API, so you can build and ship modern apps and APIs faster. Hasura connects to your databases, REST servers, GraphQL servers and third party APIs (eg: Stripe, Salesforce) and provides a unified API across all your data sources.\u003c/p\u003e\n\u003cp\u003eWe are a globally distributed team, with offices in San Francisco \u0026amp; Bangalore.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eYou can apply by using the link:\n\u003ca href=\"https://hasura.info/35ieu6J\"\u003ehttps://hasura.info/35ieu6J\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc21VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--96b259726793a4dbc2b48c114912be6d1ed983cd/logo_black.png"},{"id":"bbe1e167-f135-4b0c-9d78-2f1825b6dac8","type":"Full Time","url":"https://jobs.github.com/positions/bbe1e167-f135-4b0c-9d78-2f1825b6dac8","created_at":"Thu Jan 07 11:35:14 UTC 2021","company":"Hasura","company_url":"https://hasura.io/","location":"Remote","title":"Fullstack Web Developer","description":"\u003cp\u003eWe are looking for a fullstack web developer who can take ownership of multiple frontend sites at Hasura, both on the UI and backend front.\u003c/p\u003e\n\u003cp\u003eYou will be a part of a global team realizing a vision to build the next generation of application development powered by GraphQL. Hasura is focused on making data access fast, secure \u0026amp; scalable; so that developer teams or API consumers can immediately get productive. We want to get to a world where data delivery is just another piece of infrastructure.\u003c/p\u003e\n\u003cp\u003eWe are a globally distributed team, with offices in San Francisco \u0026amp; Bangalore.\u003c/p\u003e\n\u003cp\u003eBrief Overview:\nWe are looking for a fullstack web developer (in Bangalore preferably, but we’re open to remote applications as well). Your role will involve creating, improving and maintaining the web assets at Hasura including our main website, docs and learn assets. You will be working closely with the marketing, growth, community and design teams at Hasura.\u003c/p\u003e\n\u003cp\u003eWe’re looking for someone who is very familiar with web technologies and cares deeply about the end-user experience. Our ideal candidate will be someone who has an extremely high attention to detail, is very focussed on performance, automation, accessibility as well as the aesthetic aspects of the website.\u003c/p\u003e\n\u003cp\u003eKey Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBuild and maintain reusable UI components for the web platform.\u003c/li\u003e\n\u003cli\u003eSetup APIs for any dynamic functionalities across the website.\u003c/li\u003e\n\u003cli\u003eTake ownership of the website metrics focussed on speed - lighthouse metrics, health and monitoring by setting up tooling around it and constantly monitoring for changes.\u003c/li\u003e\n\u003cli\u003eBuild CMS interfaces for the product and marketing team to be able to quickly make modifications to the website.\u003c/li\u003e\n\u003cli\u003eWork with the Growth team for setting up different integration pipelines (database to different external services).\u003c/li\u003e\n\u003cli\u003eSetup A/B testing pipeline for React apps.\u003c/li\u003e\n\u003cli\u003eTake ownership and initiative of upgrading any legacy components of the architecture in moving to a more modern and maintainable stack.\u003c/li\u003e\n\u003cli\u003eSetup CI/CD pipelines for automating deployments of web apps.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2+ years of work experience as a fullstack engineer\u003c/li\u003e\n\u003cli\u003eIn-depth experience with HTML/CSS/Javascript and React/Gatsby.\u003c/li\u003e\n\u003cli\u003eExperience with writing, managing and testing APIs in either of Node.js/Golang is a must.\u003c/li\u003e\n\u003cli\u003eWorking knowledge of Docker and Kubernetes.\u003c/li\u003e\n\u003cli\u003eExperience in setting up CI/CD pipelines.\u003c/li\u003e\n\u003cli\u003eGood written and verbal communication skills in English.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eGood to have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKnowledge of GraphQL / Hasura.\u003c/li\u003e\n\u003cli\u003eGood understanding of SEO best practices for frontend.\u003c/li\u003e\n\u003cli\u003eDesign \u0026amp; UX Experience is a plus.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eLocation:\u003c/p\u003e\n\u003cp\u003eThis role is fully remote. We hire in most countries. If you're applying from the US, we hire remotely in these 10 states in the US: Illinois, Virginia, California, Washington State, Maryland, Florida, Colorado, Massachusetts, Oregon, New York.\u003c/p\u003e\n\u003cp\u003eWorking at Hasura:\u003c/p\u003e\n\u003cp\u003eAt Hasura, we help developers build modern apps and APIs faster. Through your work at Hasura, you will have the opportunity to make a lasting impact on both Hasura as well as the larger developer ecosystem.\u003c/p\u003e\n\u003cp\u003eAs a team, we take a lot of pride in our work. We obsess over the developer experience, and our first priority as a company will always be to make things easier for our users.\u003c/p\u003e\n\u003cp\u003eWe offer competitive salaries, have a generous vacation policy and provide health insurance for everyone employed with Hasura.\u003c/p\u003e\n\u003cp\u003eWe are an equal opportunity employer and do not tolerate discrimination of any kind.\u003c/p\u003e\n\u003cp\u003eAbout Hasura:\u003c/p\u003e\n\u003cp\u003eHasura is a venture-backed open-source technology company with offices in San Francisco and Bangalore. Hasura makes your data instantly accessible over a real-time GraphQL API, so you can build and ship modern apps and APIs faster. Hasura connects to your databases, REST servers, GraphQL servers and third party APIs (eg: Stripe, Salesforce) and provides a unified API across all your data sources.\u003c/p\u003e\n\u003cp\u003eWe are a globally distributed team, with offices in San Francisco \u0026amp; Bangalore.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eYou can apply by visiting the link:\n\u003ca href=\"https://hasura.info/3s5OANE\"\u003ehttps://hasura.info/3s5OANE\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2FVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--06ada3c68c12dc04e0b1429d8f6da0a4cdf2ea43/logo_black.png"},{"id":"4e26ede3-b242-4366-8b99-22ecf8405ce1","type":"Full Time","url":"https://jobs.github.com/positions/4e26ede3-b242-4366-8b99-22ecf8405ce1","created_at":"Thu Jan 07 09:38:54 UTC 2021","company":"airfocus","company_url":"https://airfocus.com","location":"Hamburg","title":"Fullstack engineer (React.js/Scala) (m/f/d)","description":"\u003cp\u003e\u003cstrong\u003eYour mission\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe're growing faster than ever and are on the lookout for an experienced HR manager/recruiter to join our team. As our first HR hire, you will be the driving force in helping accelerate airfocus as an awesome tech brand.\u003c/p\u003e\n\u003cp\u003eYou will collaborate closely with and report directly to the founders. You will focus on recruiting remote and Hamburg-based talent including software engineers, product managers, marketing \u0026amp; sales enthusiasts, and more. You will help build a friendly place that people like.\u003c/p\u003e\n\u003cp\u003eIf you are looking for a strategic position where you can make a tremendous impact at a fast-growing startup, this is the right opportunity for you.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUse your detective skills to find the best fitting technical and non-technical talent. You'll match future airfolks to their dream job and provide a bespoke candidate experience that people share.\u003c/li\u003e\n\u003cli\u003eCombine our ambitious growth mindset with maintaining a high talent bar and preserving airfocus’ unique culture.\u003c/li\u003e\n\u003cli\u003eContinuously improve our talent acquisition functions, including recruiting process improvement, tracking individual quality and efficiency metrics, and establishing best practices.\u003c/li\u003e\n\u003cli\u003eDevelop the employer brand strategy further.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eSkilled.\u003c/strong\u003e You have demonstrated success in converting passive leads to active candidates. You provide a delightful experience to every candidate, regardless of the hiring outcome, and push for high standards in the recruiting process.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eLimitless.\u003c/strong\u003e We're looking for someone who wants to push the boundaries on how recruitment and HR are currently done and enjoys getting creative about finding and retaining awesome talent.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eCurious.\u003c/strong\u003e You want to know not just what people do, but why/how they do it and how that might be transferable to airfocus.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSense of urgency.\u003c/strong\u003e You know how to work with multiple competing priorities, to shift focus as needs or requirements change, and to manage the expectations of those you work with.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eLove tech.\u003c/strong\u003e Broad understanding of the SaaS market and a deep appreciation for the ways technology makes work better, and are comfortable learning/using different tools to accomplish a goal.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003ePrefer diverse teams.\u003c/strong\u003e You understand that a diverse team outperforms a homogeneous team and that it takes active work to build a diverse pool of candidates.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy us?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou'll join a diverse and talented team, with plenty of opportunities for personal growth, impact, and learning.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA steep learning curve. Take responsibilities as big as you can handle.\u003c/li\u003e\n\u003cli\u003eCompetitive compensation based on prior experience.\u003c/li\u003e\n\u003cli\u003ePermanent contract and flexible working hours (incl. remote work).\u003c/li\u003e\n\u003cli\u003eMacBook Pro or notebook and monitor of your choice.\u003c/li\u003e\n\u003cli\u003eFree snacks and drinks.\u003c/li\u003e\n\u003cli\u003eTeam events, such as happy hours, off-sites, and retreats.\u003c/li\u003e\n\u003cli\u003eLanguage lessons and education courses.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://airfocus.join.com/jobs/1754156-senior-hr-manager-recruiter-m-f-d?pid=4ec1816f9ee4a4ce1bd6\u0026amp;utm_source=grunderszene\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bhr%2Bmanager%2Brecruiter%2Bm%2Bf%2Bd\"\u003ehttps://airfocus.join.com/jobs/1754156-senior-hr-manager-recruiter-m-f-d?pid=4ec1816f9ee4a4ce1bd6\u0026amp;utm_source=grunderszene\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bhr%2Bmanager%2Brecruiter%2Bm%2Bf%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc0NVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--85aff07a91c85b4054eabd8b3d1af3b1c059eaa1/airfocus600px.jpg"},{"id":"7045ea85-c536-4891-8a90-8857f4ef4d34","type":"Full Time","url":"https://jobs.github.com/positions/7045ea85-c536-4891-8a90-8857f4ef4d34","created_at":"Thu Jan 07 09:21:52 UTC 2021","company":"Wired Relations","company_url":null,"location":"Copenhagen","title":"Senior Frontend Developer","description":"\u003cp\u003e\u003cstrong\u003eSenior Frontend Developer for Wired Relations\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWith a passion for design\u003c/p\u003e\n\u003cp\u003eWired Relations has built a flexible and easy-to-use privacy management tool that allows organisations to maintain GDPR compliance in a smart and automated way. What organisations love most about the software is the structure and overview it provides, because it allows them to maintain privacy compliance in the most cost-efficient way.\u003c/p\u003e\n\u003cp\u003eWired Relations are looking for a Senior Frontend Developer with a passion for great design to strengthen the team and play a key role in the evolution and continued growth of the SaaS platform.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEvolve existing design guides and create design systems\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFirst of all, you get an interesting challenge and the opportunity to learn and grow with the platform and team. You will become responsible for evolving the existing design guides and for creating components and patterns that are consistent and delightful throughout the product. In short, you will have great influence on how the product feels and is experienced.\u003c/p\u003e\n\u003cp\u003eWork with a modern tech stack built on React, Redux, Hooks, React Functional Components and a backend of Java Microservices all running on AWS.\u003c/p\u003e\n\u003cp\u003eAs part of this fast-growing start-up, you will work with high levels of freedom and responsibility and as a key player when future design and frontend technology decisions are made. You will have 8 colleagues in the product team, where five are developers. You can read more about Wired Relations and the team here and \u003ca href=\"https://wiredrelations.com/en/careers/\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOne foot in design and another in frontend development\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe most important qualification is your personality! The team is looking for a person with passion and energy who wants to be part of something bigger and dedicate their time and skills towards building a great product in collaboration with talented and friendly colleagues. You are driven by taking responsibility and owning a product in order to achieve success.\u003c/p\u003e\n\u003cp\u003eFor skills, we are looking for a Frontend Developer with design skills and a comprehensive understanding of modern design concepts, design systems and building frontend components in React. Your education and previous jobs have given you the skills and desire to be hands-on solving complex design and technical challenges with simple solutions.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour responsibilities in the role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDeveloping design guides and creating consistent and delightful components and patterns\nProducing frontend features with React\nWorking cross-functionally to ensure design consistency\nTaking part in producing great UX designs and customer journeys\nWorking with a design and development approach with focus on intuitiveness and value for customers\nWorking in an agile development team\nDocumenting what needs to be documented, and not just for the sake of documents\nEnsuring that all frontend and design parts of the SaaS solution are covered in a professional manner including design, usability, scalability, maintainability etc.\nAre you the right match for the role?\nWell, if you consider yourself a senior frontend developer with experience with design systems and building components in React or another JS framework you are well on your way. If you have worked on a SaaS product you are even closer. The more of the mentioned tech stack you know, the easier your life will be in the beginning.\u003c/p\u003e\n\u003cp\u003eIn short: You don’t need to be able to tick off everything to apply; most importantly, you are a senior frontend developer and designer with a proven track record.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the hiring process\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eKold+Partners are handling the recruiting process. Our process is fast, transparent and tailored to your needs. We are conscious of your time and the fact that you are busy in your daily life. Read more about our approach and your journey as a candidate \u003ca href=\"https://www.koldpartners.com/en/for-candidates/our-approach/\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIf you have any questions regarding the job or Wired Relations, feel free to contact Valdemar Jørgensen, Recruiter \u0026amp; Project Manager, on +45 42 22 72 68 or at \u003ca href=\"mailto:valdemar@koldpartners.com\"\u003evaldemar@koldpartners.com\u003c/a\u003e.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.lever.co/koldpartners/e9b6bae3-7a5c-4019-b21f-12f4091f0c52/apply\"\u003eClick here to apply\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcnlVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--046fa4f658774aad9ae3f4e70b5c697293d2fe17/Wired.png"},{"id":"37d79e89-f50f-459a-bc29-76e499cd4cba","type":"Full Time","url":"https://jobs.github.com/positions/37d79e89-f50f-459a-bc29-76e499cd4cba","created_at":"Thu Jan 07 09:11:18 UTC 2021","company":"VISI/ONE GmbH","company_url":"https://www.visi-one.com/de","location":"Berlin","title":"Senior Fullstack Engineer - Javascript","description":"\u003cp\u003eVISI/ONE is the world's leading company in price labeling systems. Since our foundation in 1998, our products have become today's global standard for more than 40 automotive brands in over 70 countries. We believe in simple, high-quality products that have been developed to perfection. We believe in products that are of inspiring design and quality, surprising our customers with new ideas and unexpected solutions.\u003c/p\u003e\n\u003cp\u003eOur CSI (CarSales Intelligence) Display is the world's first product solution with cutting-edge cloud software and NB-IoT hardware technology for automotive digital pricing. With CSI Display, car dealers can update digital price boards inside cars wirelessly and from anywhere. This game-changing technology innovation not only eliminates the inconvenience and inefficiency of traditional paper-based solutions, but also creates entirely new and innovative opportunities to increase dealership profits.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a Fullstack Engineer at VISI/ONE you are part of a development team of passionate and dedicated developers. In a collaborative and agile environment, you'll work on the next generation of our highly scalable cloud platform, leveraging the latest cutting-edge technology.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDegree in computer science or equivalent or you have acquired a deep understanding of software development in a comparable education or practical experience.\u003c/li\u003e\n\u003cli\u003eSeveral years of professional experience in software development, design and development of object-oriented software.\u003c/li\u003e\n\u003cli\u003eKnowledge of the following web technologies: Node.js, JavaScript/TypeScript, Rest APIs, GraphQL, Test frameworks, React, HTML5 and CSS.\u003c/li\u003e\n\u003cli\u003eGood command of SQL.\u003c/li\u003e\n\u003cli\u003eExperience with Python is a plus.\u003c/li\u003e\n\u003cli\u003eVery good understanding and the passion to write Clean Code with the ability and the need to implement elegant, durable solutions.\u003c/li\u003e\n\u003cli\u003eExperience with cloud, micro-service and serverless architecture, ideally on the AWS platform and with common development tools such as versioning, build and test tools.\u003c/li\u003e\n\u003cli\u003eEnjoyment of solving complex problems.\u003c/li\u003e\n\u003cli\u003eOpen-minded towards new technologies and enjoyment of learning.\u003c/li\u003e\n\u003cli\u003eFluent written and spoken English skills, German is a big plus.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eInternational team of passionate tech enthusiasts with great team spirit and hands-on mentality.\u003c/li\u003e\n\u003cli\u003eOutstanding career opportunities in a growth oriented environment.\u003c/li\u003e\n\u003cli\u003eContinuous development of skills and knowledge.\u003c/li\u003e\n\u003cli\u003eStartup feeling at a global Market Leader.\u003c/li\u003e\n\u003cli\u003eNew designed office located in the heart of Berlin.\u003c/li\u003e\n\u003cli\u003eCompetitive payment structure.\u003c/li\u003e\n\u003cli\u003eLast, but not least: beverages, organic fruits and delicious sweets at work – enjoy.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe look forward to your application!\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://visione.join.com/jobs/1726380-senior-fullstack-engineer-javascript?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bfullstack%2Bengineer%2B-%2Bjavascript\"\u003ehttps://visione.join.com/jobs/1726380-senior-fullstack-engineer-javascript?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bfullstack%2Bengineer%2B-%2Bjavascript\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcm1VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--583a643cf1cc2cbba7ecaeb1463e0f3f87551df6/visi%20one.png"},{"id":"1a2d2306-3510-4ee2-945d-4c2217d35c24","type":"Full Time","url":"https://jobs.github.com/positions/1a2d2306-3510-4ee2-945d-4c2217d35c24","created_at":"Thu Jan 07 08:22:53 UTC 2021","company":"FRIDAY","company_url":"https://www.friday.de","location":"Berlin","title":"Software Engineer (Data Focus) (all genders)","description":"\u003cp\u003eWe are an independent team of technical diverse engineers and analysts taking care of the data platform at FRIDAY. Our mission is to bring data \u0026amp; statistics to FRIDAY's products and processes which includes data ingestion, analysis and software development.\u003c/p\u003e\n\u003cp\u003eFor instance, last year we developed an internal product that simulates the yearly renewal process in car insurance in order to help our pricing team to adjust premiums to the best for our customers. In this project, we are connecting a lot of different data sources, analyze data using statistical models and provide a simple user interface for our pricing team so they can run simulations on their own.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYour first task could include an extension of this product. You would work hand-in-hand with our data analysts in order to improve statistical models that were developed by them, add more data sources, improve the user interface and the overall - still PoC-ish - architecture.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePython powers most of our microservices which are deployed to Kubernetes. We prefer quality over high output: All code is committed to Git. We use GitLab CI and manage our infrastructure in Terraform. Our services are running on AWS exclusively. Data processing and business logic happen in SQL, Spark, workflow orchestration are done by Airflow.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOpportunity to work for one of the fast-rising InsurTech Startups in Europe.\u003c/li\u003e\n\u003cli\u003eCulture of diversity and creativity with smart people who take pride in what they do.\u003c/li\u003e\n\u003cli\u003eWe offer you a fair salary, flexible working hours, the possibility of remote work, a permanent work contract and 30 vacation days.\u003c/li\u003e\n\u003cli\u003eGet the best benefit for you: choose between a free public transport ticket, an Urban Sports Club membership or a subsidy for your lunch meals.\u003c/li\u003e\n\u003cli\u003eWe maintain an open and friendly working atmosphere and offer you an exciting workplace in Berlin-Mitte.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://friday.join.com/jobs/1744265-software-engineer-data-focus-all-genders?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=software%2Bengineer%2Bdata%2Bfocus%2Ball%2Bgenders\"\u003ehttps://friday.join.com/jobs/1744265-software-engineer-data-focus-all-genders?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=software%2Bengineer%2Bdata%2Bfocus%2Ball%2Bgenders\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmVVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3251e3622ff8687f07b1b5b35f81967795da1c82/friday-insurance-s-a-logo-xl.png"},{"id":"377e8e58-7bd1-45ca-8ccf-4d633381d4c8","type":"Full Time","url":"https://jobs.github.com/positions/377e8e58-7bd1-45ca-8ccf-4d633381d4c8","created_at":"Thu Jan 07 06:47:16 UTC 2021","company":"Ikayzo","company_url":"http://ikayzo.com","location":"United States","title":"Senior Enterprise Software Engineer (Kotlin)","description":"\u003cp\u003e\u003cem\u003eWork with an award-winning team designing and implementing systems for customers from New York to Tokyo.\u003c/em\u003e Ikayzo, a boutique software development and interactive design agency, is looking for a Senior Enterprise Software Engineer (Kotlin / Spring) capable of taking complex projects from ideation to release. In this role he/she will be responsible for designing and implementing applications for a wide range of customers ranging from fintech startups and renewable energy companies to global banks. We promote from within, and this position has the potential to develop into a tech lead role. Ikayzo offers competitive compensation and benefits including 24 days of paid time off per annum for full time employees.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eNote: We are currently only hiring in the United States and Japan. Remote developers are being considered, but they must be US or Japanese citizens or have valid work visas.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJob Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe position of Senior Enterprise Software Engineer entails software architecture, implementation, development of best operational practices, testing and documentation of non-trivial systems with massive scalability requirements. Full stack experience with popular client frameworks such as  React.js is preferred. As a boutique consultancy we are looking for motivated individuals who do not require step-by-step directions and can work cohesively with our team.\u003c/p\u003e\n\u003cp\u003eSuccessful applicants will have a proven track record with non-trivial enterprise Kotlin and Java projects, be comfortable with agile development methodologies, have a solid grounding in OO software architecture / design patterns and be comfortable with the enterprise Kotlin / Java technology stack including frameworks such as Spring from front to back. Most importantly, candidates must have a passion for programming. Our interviews are rigorous, so only serious developers with the requisite skills need apply.\u003c/p\u003e\n\u003cp\u003eSend your resume and a link to your GitHub profile to \u003ca href=\"mailto:career@ikayzo.com\"\u003ecareer@ikayzo.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA solid grounding in OO software architecture / design patterns\u003c/li\u003e\n\u003cli\u003eExperience designing and implementing successful non-trivial enterprise Kotlin projects\u003c/li\u003e\n\u003cli\u003eExperience with agile development methodologies\u003c/li\u003e\n\u003cli\u003eDeep knowledge of the de facto Kotlin enterprise stack including Spring and Hibernate\u003c/li\u003e\n\u003cli\u003eFirm grasp of data modeling\u003c/li\u003e\n\u003cli\u003eA passion for software development\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePreferred\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePostgreSQL and MongoDB expertise\u003c/li\u003e\n\u003cli\u003eContributions to open source projects\u003c/li\u003e\n\u003cli\u003eFinancial systems experience a plus\u003c/li\u003e\n\u003cli\u003eFamiliarity with React.js\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Ikayzo\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIkayzo is a boutique software development and interactive design agency working in areas ranging from fin-tech to renewable energy. Ikayzo develops desktop, web and mobile applications for multiple platforms including Ruby on Rails, Kotlin / Java, iPhone, Android, and .NET. We are active in the open source community.\u003c/p\u003e\n\u003cp\u003eIkayzo has worked with Google, IBM, Intel, Sun, Adobe, Oracle, Apache, Red Hat and SAP on developing technology standards for everything from enterprise software to scientific applications. From New York to Tokyo, our customers range from database leader Oracle to trusted financial institutions like Bank of America. We work with customers of all sizes in a variety of industries including biotechnology, banking, renewable energy, social media / web 2.0 and software.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail resume and GitHub profile to \u003ca href=\"mailto:career@ikayzo.com\"\u003ecareer@ikayzo.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdG1VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e254e5368909e8a838138a58a81c6d352af03cdd/logo-final.png"},{"id":"75e06ee5-aed7-40c5-8e97-c906f6dff08f","type":"Full Time","url":"https://jobs.github.com/positions/75e06ee5-aed7-40c5-8e97-c906f6dff08f","created_at":"Wed Jan 06 21:21:59 UTC 2021","company":"InMotion Hosting","company_url":"https://www.inmotionhosting.com/employment/","location":"Remote ","title":"Senior Software Developer","description":"\u003cp\u003eOur Development Team is looking for a Senior Software Developer to join them in shaping our company by creating, enhancing, and maintaining PHP based internal and external products. As part of the team, you will work within the LAMP stack in an Agile based environment to help ensure our products provide a great user experience and significant value to the customer.\u003c/p\u003e\n\u003cp\u003eThis role can be filled remotely or from one of our offices.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat You’ll Do:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Develop structured application/interface code, new program documentation, operations documentation and user guides in a casual, flexible environment\u003c/p\u003e\n\u003cp\u003e-Communicate with end users and internal customers to develop, debug, and test application software for accuracy, integrity, interoperability and completeness.\u003c/p\u003e\n\u003cp\u003e-Produce reliable, testable software applications using a disciplined development approach\u003c/p\u003e\n\u003cp\u003e-Utilize your advanced PHP and MySQL skills to create back end tooling\u003c/p\u003e\n\u003cp\u003e-Collaborate with stakeholders and leadership to prioritize and implement features\u003c/p\u003e\n\u003cp\u003e-Develop new functionality and applications on cross functional Agile project teams\u003c/p\u003e\n\u003cp\u003e-Review and test team member’s code to ensure the software meets our high quality standards and operates efficiently\u003c/p\u003e\n\u003cp\u003e-Build your skill set in a collaborative, team-focused environment\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat You’ll Get:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Profit-sharing twice yearly\u003c/p\u003e\n\u003cp\u003e-Customizable 401(k) plans that include company matching\u003c/p\u003e\n\u003cp\u003e-Medical, dental, vision, disability, life Insurance\u003c/p\u003e\n\u003cp\u003e-Paid time off and company paid holidays\u003c/p\u003e\n\u003cp\u003e-Reimbursement for tuition, certifications, or professional memberships\u003c/p\u003e\n\u003cp\u003e-Additional paid time off to volunteer in your community\u003c/p\u003e\n\u003cp\u003eAnd when onsite…\u003c/p\u003e\n\u003cp\u003e-Awesome company parties and events\u003c/p\u003e\n\u003cp\u003e-Free weekly lunch and snacks\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIdeal Candidates Have:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-5-8 years progressive development experience, primarily focused on web applications, back end automation\u003c/p\u003e\n\u003cp\u003e-Bachelor’s Degree in Computer Science and/or equivalent experience\u003c/p\u003e\n\u003cp\u003e-Extensive background in LAMP development\u003c/p\u003e\n\u003cp\u003e-Ability to move back and forth between Front End and API Back End work\u003c/p\u003e\n\u003cp\u003e-Experience with UI/UX fundamentals\u003c/p\u003e\n\u003cp\u003e-Advanced experience with PHP and MySQL\u003c/p\u003e\n\u003cp\u003e-Advanced understanding of object oriented principles\u003c/p\u003e\n\u003cp\u003e-Talent for building user interfaces using JS, jQuery, HTML, CSS and AJAX\u003c/p\u003e\n\u003cp\u003e-Background in refactoring/verifying systems through automated testing and test-driven development in large scale systems\u003c/p\u003e\n\u003cp\u003e-Experience with software deployment, Continuous Integration (CI), and Continuous Delivery (CD) concepts, applications, and tools highly preferred\u003c/p\u003e\n\u003cp\u003e-Basic knowledge of the Linux/Unix command-line\u003c/p\u003e\n\u003cp\u003e-Experience with PHP based MVC frameworks required\n-Advanced JavaScript experience and mid-level or better experience with one or more of the common frameworks like React or Vue.js is a plus\u003c/p\u003e\n\u003cp\u003e-A passion for creating a high quality user experience\u003c/p\u003e\n\u003cp\u003e-Experience with development of automated customer processes and systems\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLocation\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Virginia Beach, VA\u003c/p\u003e\n\u003cp\u003e-Denver, CO\u003c/p\u003e\n\u003cp\u003e-Permanent remote\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply Here: \u003ca href=\"https://inmotionhosting.applytojob.com/apply/xAnYXfMgfO/Senior-Software-Developer-Remote-Available?source=GitHub+Sponsored\"\u003ehttps://inmotionhosting.applytojob.com/apply/xAnYXfMgfO/Senior-Software-Developer-Remote-Available?source=GitHub+Sponsored\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcXVVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8c966cc914d50b5a7aebfaa03a4c4df03d5e25c4/InMotion%20Hosting.jpg"},{"id":"f72115bb-319a-4d82-beed-e0fd4fb5be39","type":"Full Time","url":"https://jobs.github.com/positions/f72115bb-319a-4d82-beed-e0fd4fb5be39","created_at":"Wed Jan 06 16:44:43 UTC 2021","company":"NJI Media","company_url":"https://www.njimedia.com/","location":"Alexandria, VA","title":"Full Stack Developer","description":"\u003cp\u003eNJI is a wildly creative and strategically disciplined agency with offices in London, Washington, D.C., and Singapore. We work seamlessly across teams and time zones to align and deliver for our clients.\u003c/p\u003e\n\u003cp\u003eWe seek a versatile web developer to join our Alexandria, VA office with at least 3+ years of experience who enjoys a broad range of both front-end and back-end development responsibilities. The ideal candidate is able to quickly, independently, and precisely build a PHP-driven website from design assets and functional documentation. Maintenance and updates to existing sites also factors heavily into the responsibilities of this position. PHP experience is a must – we frequently build on proven and popular content management systems like Drupal and WordPress.\u003c/p\u003e\n\u003cp\u003eWe hope to find a developer that can build a site from Sketch/Adobe XD into WordPress or Drupal and be able to use WPVIP PHPCS standard.\u003c/p\u003e\n\u003cp\u003eSkills\u003c/p\u003e\n\u003cp\u003ePlease examine the many skills we look for in a candidate. The right technical experience and skill will get you an interview, attitude and professionalism will get you the job.\u003c/p\u003e\n\u003cp\u003eRequired Professional Skills\u003c/p\u003e\n\u003cp\u003eAttention to Detail – You must be naturally precise, and you must take genuine, personal pride in being meticulous about your craft.\nCommunication – Our operational style emphasizes flexibility and encourages autonomy. As a result, uncommonly good common sense, and exceptional communication skills are absolutely indispensable for every team member.\nTime Management – We know that nothing is ever ‘done’. The proven ability to manage your time sensibly and proportionately with project priorities is critical.\u003c/p\u003e\n\u003cp\u003eFront-end Experience\u003c/p\u003e\n\u003cp\u003eHTML – Demonstrated correct and semantic application of markup, including headers, lists, forms, etc, ability to distinguish HTML 5 from XHTML 1, HTML 4.01, etc.\nCSS – Mastery of clean and organized styling techniques, including responsive techniques. Knowledge of graceful degradation/progressive enhancement approaches to browser support\nJavascript – Strong knowledge of syntax, variables, and operators. Experience using basic features of consoles and other debugging tools\njQuery – Capable of leveraging jQuery to modify existing UI behaviors and interactions and to create brand new interactions from scratch\nSketch/Adobe XD – Strong knowledge on creating a site from Sketch and AD files\u003c/p\u003e\n\u003cp\u003eBack-end Experience:\u003c/p\u003e\n\u003cp\u003eWordPress/Drupal – Demonstrated experience installing and developing quality sites in WordPress 5+ or Drupal 7+\nPHP5 – Very strong with PHP syntax and features. Understand variables, constants, arrays, loops, internal functions, php configurations, error logging/reporting, and OOP principles\nLinux – Basic familiarity working from shell or terminal in Mac or Linux\nApache – Background with Apache web server, knowledge of basic configuration, optimization and authentication techniques\nMySQL – Knowledge of schemas, tables, users and privileges, principles of relational databases, and SQL commands. Able to migrate legacy data from unlike management systems\nAnalytics – Familiar with implementing and evaluating results from metric gathering technologies such as Google Analytics\nSSL – Experience requesting and installing certificates, directing traffic through secure ports, and encrypting protected data\nMVC – Good grasp of the MVC architectural pattern\nAPIs and Web Services – Experience working with APIs, and creating and consuming web services, using SOAP and REST protocols\nJSON – Familiar with JSON syntax, asynchronous Javascript, and encoding/decoding JSON data in PHP\nGit – Familiar with Git commands including branching, merging and fixing merge conflicts\nGitHub: Familiar with PR and Merging\nPHPCS – have built site using the PHPCS code standards\nXML – Understand how to properly structure and use XML for transferring data\u003c/p\u003e\n\u003cp\u003eAdditional Skills\u003c/p\u003e\n\u003cp\u003eThese are not required, but would be considered plusses:\u003c/p\u003e\n\u003cp\u003eSass, SCSS\nGulp/Grunt, Bower package manager\nRegEx skills\nOther technologies such as NGINX, PHP–FPM, APC, Memcache, Varnish, and CDN\nWorked locally using Lando or Vagrant\nDrupal 7/8\u003c/p\u003e\n\u003cp\u003eTHANKS, BUT…\u003c/p\u003e\n\u003cp\u003eOh, and thanks for reading this all the way through. To be clear, we’re not interested in hearing from recruiters, recruiters who claim not to be “recruiters,” headhunters, or staffing companies.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply here: \u003ca href=\"https://recruiting.paylocity.com/recruiting/jobs/Details/414298/NJI-Media-LLC/Full-Stack-Developer\"\u003ehttps://recruiting.paylocity.com/recruiting/jobs/Details/414298/NJI-Media-LLC/Full-Stack-Developer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUdVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dd71813ed120cc17d779364c83be1f02a735ca27/NJI-Full-RGB.png"},{"id":"a66b7899-6d6a-4be4-8fef-f0364fbdd0d0","type":"Full Time","url":"https://jobs.github.com/positions/a66b7899-6d6a-4be4-8fef-f0364fbdd0d0","created_at":"Wed Jan 06 14:51:01 UTC 2021","company":"VolkerWessels Telecom","company_url":"https://www.vwtelecom.com/","location":"Amersfoort ","title":"BI-architect","description":"\u003ch2\u003eBI Architect - Amersfoort\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eAls BI Architect ben je onderdeel van ons Data Analytics Team (DAN) binnen de afdeling digitalisering.\u003c/strong\u003e\u003c/p\u003e\n\u003ch2\u003eZie jij de connectie met VWT?\u003c/h2\u003e\n\u003cp\u003eHet DAN team focust op de ondersteuning van de business bij het omarmen van innovatieve, waardevolle, data gedreven processen. Samen met jouw team van data gedreven professionals, ben jij verantwoordelijk voor het creëren van een data platform voor VolkerWessels Telecom waarmee de business in staat wordt gesteld de waarde uit data te halen.\u003c/p\u003e\n\u003cp\u003eJouw taken en verantwoordelijkheden als...\u003c/p\u003e\n\u003cp\u003eBinnen DAN-team ben jij als BI-architect verantwoordelijk voor de gehele BI architectuur, zoals het:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOpzetten en bewaken van het beleid rondom DWH- en Visualistatietooling (dit is Power BI binnen VWT);\u003c/li\u003e\n\u003cli\u003eOpzetten en bewaken van DWH Architectuur en onderdeel van overall VWT ICT Architectuur en uitgangspunten;\u003c/li\u003e\n\u003cli\u003eInrichten hoe we data en dataproducten opleveren;\u003c/li\u003e\n\u003cli\u003eOnderdeel zijn van de strategische doorontwikkeling van Data en Integratie afdeling: vanuit technisch perspectief gaan bepalen hoe we met nieuwe strategische initiatieven omgaan;\u003c/li\u003e\n\u003cli\u003eOpstellen/bewaken van Technische roadmap dataplatform en hiervan de doorontwikkeling en het in staat kunnen stellen meer toegevoegde waarde uit data te halen;\u003c/li\u003e\n\u003cli\u003eAanspreekpunt/Bewaker voor Product Owners om te zorgen dat producten/oplevering binnen de huidige architectuur passen;\u003c/li\u003e\n\u003cli\u003ePositionering van zowel Master Data als Datawarehouse binnen VWT;\u003c/li\u003e\n\u003cli\u003eAansluiten van bijeenkomsten inzake informatie architectuur op bedrijf breed IT Enterprise architectuur;\u003c/li\u003e\n\u003cli\u003eAanhaken als VWT aanspreekpunt bij VW concern data vraagstukken/initiatieven.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWelkom bij VWT\u003c/h2\u003e\n\u003cp\u003eBij ons krijg je de mogelijkheid te groeien, zowel persoonlijk als inhoudelijk. Lijnen zijn kort, drempels zijn laag. Ben je ondernemend en kom je het beste tot je recht als je ruimte krijgt? Dan zit je bij ons op je plek. We belonen je met onze solide arbeidsvoorwaarden zoals:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJe krijgt de kans om aan mooie baanbrekende projecten te werken waar jij een belangrijke rol in speelt;\u003c/li\u003e\n\u003cli\u003eEen marktconform salaris op basis van een 38-urige werkweek en 25 vakantiedagen;\u003c/li\u003e\n\u003cli\u003eEen mobiele telefoon/laptop;\u003c/li\u003e\n\u003cli\u003eEen goed pensioen en een collectieve ziektekostenverzekering;\u003c/li\u003e\n\u003cli\u003eDiverse trainingen en opleidingen via onze VWT Academy;\u003c/li\u003e\n\u003cli\u003eMogelijkheid tot persoonlijke groei met een gedegen begeleiding, waarbij ondernemerschap de ruimte krijgt;\u003c/li\u003e\n\u003cli\u003eGunstige personeelskortingen op onder andere je fitnessabonnement, tanken en telefoon abonnement;\u003c/li\u003e\n\u003cli\u003eKennis uitwisselen en netwerken bij Jong VolkerWessels;\u003c/li\u003e\n\u003cli\u003eGezelligheid! Bootcampen met collega’s of liever een borrel op de vrijdagmiddag?.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDit ben jij\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eMinimaal HBO+ werk- en denkniveau aangevuld met tenminste 5 jaar relevante werkervaring;\u003c/li\u003e\n\u003cli\u003eAnalytisch goed onderlegd met oog voor detail en daarbij creatief in het uitwerken van (klant)oplossingen;\u003c/li\u003e\n\u003cli\u003ePlanmatig sterk en kent de impact van je prioriteiten en weet ze hierdoor goed te stellen;\u003c/li\u003e\n\u003cli\u003eStaat stevig in je schoenen, maar weet zowel kort als langer termijn doelstelling en visie van het team binnen de BI Architectuur uit te stippelen;\u003c/li\u003e\n\u003cli\u003eTeamplayer waarin je de visie van de organisatie en het team in verbinding met elkaar stelt;\u003c/li\u003e\n\u003cli\u003eErvaring in het werken met en analyseren van data sets in een bij voorkeur corporate omgeving;\u003c/li\u003e\n\u003cli\u003eHet is pré als je kennis hebt van: datawarehouse methodieken (Kimball en Inmon), Visualisatietools (Power BI), Microsoft Azure Stack (Data Factory,Eventhub, Data Lake, Synapse, TimeXtender, Databrick), Microsoft DevOps Services en/of Github, Value BlueDolphin, Agile Scrum, Dama-BOK\u003c/li\u003e\n\u003cli\u003eCommunicatief vaardig ; je bent in staat om de wensen/doel van de klant te vertalen naar de techniek en te voorzien van een passende oplossing.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eInteresse?\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/2JMKx7k\"\u003eKlik hier voor het sollicitatieformulier!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/2JMKx7k\"\u003eKlik hier voor het sollicitatieformulier!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDZVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e9dd745b9e7a10493a65ea12a8be3059c62e184d/volker.jpeg"},{"id":"d0814933-08b2-408d-82e6-d4b49ea01b5a","type":"Full Time","url":"https://jobs.github.com/positions/d0814933-08b2-408d-82e6-d4b49ea01b5a","created_at":"Wed Jan 06 14:39:52 UTC 2021","company":"Expert Systems AG","company_url":"https://www.provenexpert.com/de-de/","location":"Berlin","title":"Fullstack Developer (m/w/d)","description":"\u003cp\u003eProvenExpert ist mit über 100.000 glücklichen Kunden führender deutscher Anbieter von Online-Marketing-Software. Immer mehr Unternehmen aus über 50 Branchen boosten mit unserem Tool für professionelles Bewertungsmarketing aktiv ihre Online-Reputation und damit ihren Erfolg. Dafür setzt sich täglich unser wunderbares Team mit viel Spaß und Leidenschaft ein. Wir sind ein Berliner Unternehmen und stolz darauf, dass wir mittlerweile fast 50 Kollegen/innen zählen - bisher in Berlin und Krakau. Langweilig ist es bei uns nie, denn wir greifen nach den Sternen. Um mit unserem weiteren Wachstum Schritt zu halten, suchen wir aktuell 5 neue Kollegen (m/w/d) für unseren Standort Berlin.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls (Senior) Fullstack Developer (m/w/d) optimierst du kontinuierlich unsere Entwicklungs-, Test- und Produktivsysteme. Du bist zuständig für die Automatisierung und kontinuierliche Weiterentwicklung unserer Build- \u0026amp; Deployment-Prozesse. Du realisierst neue Features und Produktupdates in PHP und mit NoSQL-Datenbanken (MongoDB) und bist für die Wartung und Instandhaltung der Plattform zuständig - die Skalierbarkeit und Performance immer im Fokus. In unseren kleinen Teams hast du die Freiheit, deine Nische zu finden, in der du mit Leidenschaft entwickeln (und dich weiterentwickeln) kannst.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQualifikation\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMind. 2 Jahre praktische Berufserfahrung als Fullstack Developer (m/w/d)\u003c/li\u003e\n\u003cli\u003eDu verfügst über solide Kenntnisse in der Administration von Linux-Systemen und dem Betrieb von Web-Applikationen\u003c/li\u003e\n\u003cli\u003eDu hast Erfahrungen in PHP, JavaScript/TypeScript, NoSQL, Node.js und Git\u003c/li\u003e\n\u003cli\u003eFolgende Dienste sind für dich kein Neuland: nginx, MongoDB, Gitlab\u003c/li\u003e\n\u003cli\u003eOOP, MVC und Symfony sind für dich keine Fremdwörter\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu hast die Möglichkeit, Verantwortung zu übernehmen, dich fachlich und persönlich weiterzuentwickeln und dich auszuprobieren\u003c/li\u003e\n\u003cli\u003eAuf dich wartet ein vielfältiges Team, das mit dir wachsen und Großes bewegen möchte\u003c/li\u003e\n\u003cli\u003eDu arbeitest in modernen, neu eingerichteten Büroräumen in kleinen Teams\u003c/li\u003e\n\u003cli\u003eDu suchst dir deine Hardware aus, mit der du am liebsten arbeitest (PC/Mac bzw. Desktop/Notebook)\u003c/li\u003e\n\u003cli\u003eWork-Life-Balance ist uns wichtig - wir achten auf eine saubere Zeiterfassung (keine Überstunden) und bieten kostenlose Yoga-Kurse an\u003c/li\u003e\n\u003cli\u003eUnd nicht zu vergessen: neben einem attraktiven Gehalt erwarten dich eine Chill-Out-Lounge mit Massagesesseln und Fußballkickern, regelmäßige Teamevents, Parties sowie täglich frisches Obst, Snacks und Getränke\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDas klingt nach deinem neuen Job? Dann schick uns deine vollständige Bewerbung in einem PDF-Dokument inkl. frühestem Eintrittsdatum und Gehaltsvorstellung! Wir freuen uns, von dir zu hören! Für weitere Informationen besuche gern unsere Website.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://provenexpert.join.com/jobs/1732323-fullstack-developer-m-w-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=fullstack%2Bdeveloper%2Bm%2Bw%2Bd\"\u003ehttps://provenexpert.join.com/jobs/1732323-fullstack-developer-m-w-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=fullstack%2Bdeveloper%2Bm%2Bw%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGFVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fa28a38cbc7b23987ee9e23d21f3e01eeabfadb7/provenexpert-com_full_1460724201.jpg"},{"id":"7d20a54c-244b-4d92-9c6b-66c85cdbf876","type":"Full Time","url":"https://jobs.github.com/positions/7d20a54c-244b-4d92-9c6b-66c85cdbf876","created_at":"Wed Jan 06 14:09:51 UTC 2021","company":"Superside","company_url":"https://www.superside.com","location":"Remote/Europe","title":"Senior Backend Engineer (Kotlin/Spring boot)","description":"\u003cp\u003eSuperside is looking for a talented, driven and ambitious Backend Engineer to join our talented growing team.\u003c/p\u003e\n\u003cp\u003eWe are growing fast and need help to build our product into a great design platform that includes project  management features, real time chat, staffing, file annotation and more.\u003c/p\u003e\n\u003cp\u003eWork from wherever you want with a highly competitive salary, responsibility from day one and exciting learning opportunities.\u003c/p\u003e\n\u003cp\u003eWHAT YOU’LL DO\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eImplement the features of the internal Superside app (Superspace) like the Superchat and the staffing system\u003c/li\u003e\n\u003cli\u003eArchitect efficient and reusable front-end systems that drive complex web applications\u003c/li\u003e\n\u003cli\u003eCollaborate with Product Designers, Product Managers, and Software Engineers to deliver compelling user-facing products\u003c/li\u003e\n\u003cli\u003eIdentify and resolve performance and scalability issues\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWHAT YOU’LL NEED TO SUCCEED\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with Spring Boot and Hibernate\u003c/li\u003e\n\u003cli\u003eKnowledge of java and kotlin\u003c/li\u003e\n\u003cli\u003eKnowledge of distributed programming/microservices\u003c/li\u003e\n\u003cli\u003eKnowledge in algorithm and data structure\u003c/li\u003e\n\u003cli\u003eExcellent communication skills in English\u003c/li\u003e\n\u003cli\u003eHard-working team player\u003c/li\u003e\n\u003cli\u003eFast and stable internet connection\u003c/li\u003e\n\u003cli\u003eBS/MS in Computer Science or a related technical field preferred\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eABOUT SUPERSIDE\u003c/p\u003e\n\u003cp\u003eSuperside is a remote future-of-work startup that delivers great design at scale to global brands 24/7 — from everyday production work to large-scale strategic design solutions. By building workflow technology and an instant and fully-managed process, Superside makes design hassle-free for customers like Facebook, Redbull, Puma, Amazon, Salesforce, Cisco, HP, Twitch, Airbus, L'Oreal, Tiffany \u0026amp; Co. and more. Superside is backed by Y Combinator, Slack Fund, Freestyle Capital and High Alpha Capital. We're a fully distributed team of ex tier one agency designers and project managers located all around the world, spanning 58 countries and 19 timezones.\u003c/p\u003e\n\u003cp\u003eMission: Create more equal economic opportunities globally\u003c/p\u003e\n\u003cp\u003eVision: We find and grow the world’s best creative talent\u003c/p\u003e\n\u003cp\u003eWHY JOIN US\u003c/p\u003e\n\u003cp\u003eWe are a global community with people across 58 countries\nBe part of a highly talented tech team, and work with people with background in Spotify, Yandex and Booking.com\nCompetitive salary with the potential for earning equity in the company\nWe function in a trusting environment while seeking the truth in an ego-free manner\nPioneering the remote future of work with a fair, meritocratic and supportive community\nDisrupting a massive global industry with a huge market opportunity\nPaid vacation\u003c/p\u003e\n\u003cp\u003eTECHNICAL STACK\u003c/p\u003e\n\u003cp\u003eFrontend\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNodeJS\u003c/li\u003e\n\u003cli\u003eLambda Edge\u003c/li\u003e\n\u003cli\u003eNext.js/ React\u003c/li\u003e\n\u003cli\u003eStyled Components\u003c/li\u003e\n\u003cli\u003eTypescript\u003c/li\u003e\n\u003cli\u003eSanity Headless CMS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBackend\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJava/Kotlin\u003c/li\u003e\n\u003cli\u003eSpring Boot 2\u003c/li\u003e\n\u003cli\u003eHibernate/ AWS RDS / MySql\u003c/li\u003e\n\u003cli\u003eRedisson/Redis\u003c/li\u003e\n\u003cli\u003eJunit for testing\u003c/li\u003e\n\u003cli\u003eElasticSearch\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eInfrastructure\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTerraform\u003c/li\u003e\n\u003cli\u003eAWS SQS/SNS, ECS, Cloudfront, Route53,  EC2, S3, WAF, PageDuty, ParameterStore, ALB\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eJenkins\u003c/li\u003e\n\u003cli\u003ePusher\u003c/li\u003e\n\u003cli\u003eMailgun\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf you think Superside is the right place for you, get in contact!\u003c/p\u003e\n\u003cp\u003ePlease note that we receive many applications for this position and reply times will therefore vary. We screen applications continuously and will reach out to you as soon as we can after you have completed the assessments.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply here: \u003ca href=\"https://superside.vervoe.net/job-page/backend-engineer-full-time-remote/88af334e-0c0a-4834-b1fa-a0a00bbe8ea2\"\u003ehttps://superside.vervoe.net/job-page/backend-engineer-full-time-remote/88af334e-0c0a-4834-b1fa-a0a00bbe8ea2\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcFNVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--47778f21527351f7abde8cc5418d32a71dcbf218/last%20ned%20(2).jpeg"},{"id":"11db89a9-5b43-4deb-9780-81b3deb46005","type":"Full Time","url":"https://jobs.github.com/positions/11db89a9-5b43-4deb-9780-81b3deb46005","created_at":"Mon Nov 23 13:48:17 UTC 2020","company":"SoundCloud","company_url":"https://soundcloud.com/discover","location":"Berlin","title":"Principal Data Scientist (f/m/d)","description":"\u003cp\u003eWhat's next in music happens on SoundCloud first. As the world’s largest open audio platform, SoundCloud is powered by a connected community of creators, listeners and curators who share, discover and influence what’s new, now and next in music and audio.\u003c/p\u003e\n\u003cp\u003eWe are looking for an impact-driven Principal Data Scientist to solve and help others solve exciting problems across the SoundCloud product using Machine Learning and other Data Science tools. You will work closely with other data scientists and engineers to find opportunities, build, tune, instrument, and evaluate data science models.\u003c/p\u003e\n\u003cp\u003eOur Data Scientists work on a wide range of products and problems having direct impact on our millions of daily active users. We want people that come equipped with an open mind, creativity and a get-it-done attitude.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn this role you will be responsible for leading the efforts to build data products and internal solutions for some of the hardest problems at SoundCloud. You will see projects through from start to finish performing research, prototyping solutions, production deployment at scale and A/B testing to validate your solutions. We love specialists with deep experience, and we expect to use that experience alongside a Data Scientist’s ability to be general and tackle a wide range of problem areas.\u003c/p\u003e\n\u003cp\u003eSome projects you might work on include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop, adapt, combine, and choose data science methodology (statistics, machine learning, optimization, experimentation) to address complex problems.\u003c/li\u003e\n\u003cli\u003eEvaluate and validate correctness of data models and theoretical approaches. Assess and validate performance of models to meet business objectives.\u003c/li\u003e\n\u003cli\u003eDeepen in personalized user journeys to gain a comprehensive understanding of user behavior, develop targeted advertising, and improve digital experiences.\u003c/li\u003e\n\u003cli\u003eProvide guidance on how to improve the efficiency and effectiveness of current solutions with changes that affect the bottom line of the organization\u003c/li\u003e\n\u003cli\u003eCommunicate complex information to a wide and non technical audience. Determine data requirements and performance metrics to measure company wide business objectives.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout You\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou are a Principal Data Scientist with a curious analytical mindset, experience with software engineering, and a track record of shipping solutions at large scale. You have a broad toolkit that spans languages and runtimes, and you can get up-to-speed with new tech stacks quickly. You enjoy working cross-functional with Engineers, Product Managers and peer Data Scientists. You have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have a Ph.D. or M.Sc. in a quantitative field (Statistics, Machine Learning, AI, Computer Science, Physics, Mathematics, etc.) or demonstrated industry experience productionizing machine learning algorithms.\u003c/li\u003e\n\u003cli\u003eA minimum of 10 years of experience in a full-time industry position (not academic).\u003c/li\u003e\n\u003cli\u003eDemonstrated experience with and solid knowledge of cloud technologies (GCP, AWS).\u003c/li\u003e\n\u003cli\u003eExperience of software engineering techniques including version control, continuous integration, unit testing.\u003c/li\u003e\n\u003cli\u003eA deep understanding of the lifecycle of a Data Science project, with experience in research, solution development, tuning and inspecting models, etc.\u003c/li\u003e\n\u003cli\u003eExperienced wrangling very large datasets by writing and maintaining data processing pipelines.\u003c/li\u003e\n\u003cli\u003eStrong engineering background, with experience with Scala, Python or similar languages that are used to ship production models and systems.\u003c/li\u003e\n\u003cli\u003eYou have solid analytical capabilities; you know not just how to solve problems with machine learning but also where and when.\u003c/li\u003e\n\u003cli\u003eAn ability to tell a story about data, to explore and reveal patterns, and to communicate to stakeholders about your discoveries and hypothesis.\u003c/li\u003e\n\u003cli\u003eWorked in cross-functional teams and are able to work in multiple parts of a tech stack.\u003c/li\u003e\n\u003cli\u003eYou value the soft-side of applied research (e.g. communication, mentorship, team-work).\u003c/li\u003e\n\u003cli\u003eYou are excited by the opportunity to directly impact the daily experience and happiness of millions of people around the world.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eDiversity at SoundCloud\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eSoundCloud is for everyone. Diversity and open expression are fundamental to our organization; they help us build a social platform and global community where anyone can create, discover, and share sounds. We acknowledge the challenges in our industry, and strive to develop an inclusive culture where everyone can contribute.*\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe’re international! We operate in the US, Berlin and London and all of our communication is in English.\u003c/li\u003e\n\u003cli\u003eWe have a flexible, friendly and inclusive office environment in Mitte\u003c/li\u003e\n\u003cli\u003eOur environment is a learning one, with specific focus on development, including a professional development allowance and a possibility to use 20% of your time for a personal project.\u003c/li\u003e\n\u003cli\u003eYou can contribute to our Engineering Blog post.\u003c/li\u003e\n\u003cli\u003eNot located in Berlin? No worries, we offer extensive relocation support including allowances, one way flights, temporary accommodation and, by partnering with Expath, on the ground support on arrival.\nInterested in a gym membership, photography course or book? We have a Creativity and wellness benefit!\u003c/li\u003e\n\u003cli\u003eWe offer free German courses at beginning, intermediate and advanced.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.soundcloud.com/job?gh_jid=4902447002\"\u003ehttps://jobs.soundcloud.com/job?gh_jid=4902447002\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdmFRIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1adfb21862bf2a044a6e1f14dc0c5260b5c0e581/main@2x.png"},{"id":"00bcd48b-d062-4db7-9971-ea18ec6c563c","type":"Full Time","url":"https://jobs.github.com/positions/00bcd48b-d062-4db7-9971-ea18ec6c563c","created_at":"Mon Nov 23 13:45:19 UTC 2020","company":"SoundCloud","company_url":"https://soundcloud.com/discover","location":"Berlin","title":"Principal Data Architect (f/m/d)","description":"\u003cp\u003eWhat's next in music happens on SoundCloud first. As the world’s largest open audio platform, SoundCloud is powered by a connected community of creators, listeners and curators who share, discover and influence what’s new, now and next in music and audio.\u003c/p\u003e\n\u003cp\u003eWe’re looking for an experienced data architect to help us build the next generation of ML-powered data delivery systems that will allow us to manage and expose engaging experiences on SoundCloud by optimising predictive performance while serving hundreds of millions of users.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn this role, you will be responsible for the overall architecture of our production data delivery as well as for engineering practices to ensure the stability, compliance, reliability and timeliness of our systems. Daily, you will be mentoring engineers as well as collaborating with other technical leaders across the organisation, contributing to architecture decisions and solving cross-functional technical problems.\u003c/p\u003e\n\u003cp\u003eYou will be overarching all the stages of the delivery from event logging, data preparation, identification of relevant metrics for production-readiness, scalable inference, and feature stores. You will be in charge of implementing best practices to improve the overall machine learning infrastructure and unleash modelling and evaluation strategy to find patterns and predict unseen instances.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout you\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou have significant experience in Machine Learning engineering and a deep passion for data processing infrastructure. With a problem-solving mindset, you have architected and built data delivery systems at scale, applying data-mesh principles.\u003c/p\u003e\n\u003cp\u003eYou have a pragmatic, results-oriented approach to application architecture and are excited to work in all areas of the analytics and the cloud stack. In this role, are expected to acquire a deep technical understanding of our products; execute a solution development roadmap; as well as provide mentorship.\u003c/p\u003e\n\u003cp\u003eFinally, you have a proven record of success coordinating with other technical leaders in your organisation, explaining your technical vision and strategy and creating consensus around it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou have:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExpertise in the main components of continuous data delivery: project set up, design of data pipelines, modelling (selecting, training and debugging) and serving (testing, deploying, monitoring and maintaining).\u003c/li\u003e\n\u003cli\u003eProven track record of implementing machine-learning solutions and statistical frameworks.\u003c/li\u003e\n\u003cli\u003eStrong engineering background, with experience with Scala, Python, SparkML, Apache Beam, - TensorFlow or similar frameworks used to ship production models and systems.\u003c/li\u003e\n\u003cli\u003eDemonstrated experience with and solid knowledge of cloud platforms, preferably including GCP.\u003c/li\u003e\n\u003cli\u003eFamiliarity with common approaches used in practical applications of machine learning such as pattern recognition, text classification, time series analysis, recommender systems, dimensionality reduction, and feature engineering.\u003c/li\u003e\n\u003cli\u003ePerformed data modelling assessments and provided recommendations to correct data modelling deficiencies, including improvements to the underlined data design.\u003c/li\u003e\n\u003cli\u003eIterative training and evaluation of production machine learning delivery systems from baseline to optimization.\u003c/li\u003e\n\u003cli\u003eKnowledge of interpretable models and observable and attributable metrics.\u003c/li\u003e\n\u003cli\u003eYou excel in the human aspects of applied research (e.g. communication, empathy, mentorship, team-work).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e*Diversity at SoundCloud\u003c/p\u003e\n\u003cp\u003eSoundCloud is for everyone. Diversity and open expression are fundamental to our organization; they help us build a social platform and global community where anyone can create, discover, and share sounds. We acknowledge the challenges in our industry, and strive to develop an inclusive culture where everyone can contribute.*\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe’re international! We operate in the US, Berlin and London and all of our communication is in English.\u003c/li\u003e\n\u003cli\u003eWe have a flexible, friendly and inclusive office environment in Mitte\u003c/li\u003e\n\u003cli\u003eOur environment is a learning one, with specific focus on development, including a professional development allowance and a possibility to use 20% of your time for a personal project.\u003c/li\u003e\n\u003cli\u003eYou can contribute to our Engineering Blog post.\u003c/li\u003e\n\u003cli\u003eNot located in Berlin? No worries, we offer extensive relocation support including allowances, one way flights, temporary accommodation and, by partnering with Expath, on the ground support on arrival.\u003c/li\u003e\n\u003cli\u003eInterested in a gym membership, photography course or book? We have a Creativity and wellness benefit!\u003c/li\u003e\n\u003cli\u003eWe offer free German courses at beginning, intermediate and advanced.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.soundcloud.com/job?gh_jid=4948620002\"\u003ehttps://jobs.soundcloud.com/job?gh_jid=4948620002\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlNRIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8fb3804aec1982768d4fff382a9ba431fa5b8c3b/main@2x.png"},{"id":"7d842069-8242-4a7d-bbda-08d0fd5fcb1b","type":"Full Time","url":"https://jobs.github.com/positions/7d842069-8242-4a7d-bbda-08d0fd5fcb1b","created_at":"Wed Jan 06 08:58:48 UTC 2021","company":"lengoo GmbH","company_url":"https://www.lengoo.com/","location":"Berlin, Germany","title":"Node.js Backend Engineer (m/f/d)","description":"\u003cp\u003eYOUR MISSION\u003c/p\u003e\n\u003cp\u003eAs a Backend Engineer, you will be working with a dynamic, international tech team based in Berlin that has been operational for the last 2 years. Your mission is to design and develop a micro-service architecture that integrates at its core the best engineering practises and the latest generation of machine translation research.\u003c/p\u003e\n\u003cp\u003eYOUR RESPONSIBILITIES\u003c/p\u003e\n\u003cp\u003eGather, understand, and prioritize requirements, research potential solutions, rapidly build prototypes, and distill and communicate what was learned, expected risks, necessary resources, and potential security concerns.\nProvide high-level technical design, strategy roadmap development, and technical architecture related to our existing and new services and related infrastructure used by our front-end engineers.\nAssure that our architectures are consistent with industry best practices including scalability, availability, maintainability, and flexibility.\nCommunicate strategies and processes around our services to cross-functional groups.\nHack or learn whatever you want during bi-weekly learning afternoon.\nHelping us to select the best talent to join us in our Product Team (code reviews and participation in interviews).\nOnboard new colleagues.\u003c/p\u003e\n\u003cp\u003eYOUR PROFILE\u003c/p\u003e\n\u003cp\u003eYou are an experienced software engineer with 3+ years of experience.\nYou have professional working experience as a software engineer using Javascript / TypeScript / Node.js / NestJS and in writing highly tested software (unit testing, integration testing).\nYou have experience defining and modelling a consumable API.\nYou work autonomously, are energized by missions and goals more than a specific list of tasks.\nExperienced in designing, analyzing, optimising code, and troubleshooting large-scale distributed systems.\u003c/p\u003e\n\u003cp\u003eWHY US?\u003c/p\u003e\n\u003cp\u003eA fast-growing startup which is financially secured by EU research grants and well-known investors and already serves more than 3,000 business clients.\nThe opportunity to contribute to cutting edge developments in the field of machine learning.\nRegular feedback and check-ins on your well-being.\nFlexible work environment.\nA modern office in the heart of Berlin with lots of bars and restaurants closeby.\nOutstanding team atmosphere through regular team events, hackathons, and lunches.Development opportunities through conferences and own learning time slots.\nSubsidized gym membership (Urban Sports Club), free breakfast, coffee, drinks, fruits and dinner (after 8 pm).\nWe give you one additional day of vacation, both 24.12 and 31.12. are half day off\u003c/p\u003e\n\u003cp\u003eABOUT US\u003c/p\u003e\n\u003cp\u003eLengoo makes AI work for translation. As a language tech company, we supercharge human translators with AI technology. We custom-train neural machine translation systems for our clients using their own data. Our language models learn all about the enterprise’s individual way to communicate and produce high-quality machine translations. The feedback of human translators constantly improves our language models and allows us to provide professional translations 3 times faster and 50% cheaper than average. We support global enterprises like the car rental company Sixt, Swiss telecommunication provider Sunrise Communications, or French tire manufacturer Michelin. Join our fast-growing, international team and let’s shape the future of translation together!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply directly on the career page or send an email to \u003ca href=\"mailto:lengoo-jobs@m.personio.de\"\u003elengoo-jobs@m.personio.de\u003c/a\u003e, mentioning the job post on GitHub!\u003c/p\u003e\n","company_logo":null},{"id":"adc996fe-5e04-40ec-bb50-45f4059f0de6","type":"Full Time","url":"https://jobs.github.com/positions/adc996fe-5e04-40ec-bb50-45f4059f0de6","created_at":"Wed Jan 06 07:44:28 UTC 2021","company":"Binance","company_url":"http://binance.com","location":"Singapore","title":"Front-end Team Lead (React / Blockchain)","description":"\u003cp\u003eWe are looking for a Front-end Team Lead to join the Binance Chain team.\u003c/p\u003e\n\u003cp\u003eThe ideal candidate should have a solid engineering skills as well as people management capabilities. Crypto/blockchain experience (DApps, Wallets, etc) would be a huge advantage.\nIf you think you have what it takes to be part of a high performing team, we would like to hear from you.\nThis is a full-time position that can be remote or in one of our locations (e.g. Singapore). Our preference is Asian timezones.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eImplement new user-facing features in Binance’s products which have a huge amount of PV everyday\u003c/li\u003e\n\u003cli\u003eManage the team\u003c/li\u003e\n\u003cli\u003eWrite client-side code to create super-fast, easy-to-use, web-based applications which include website for both desktop and mobile browsers, and hybrid in-app pages\u003c/li\u003e\n\u003cli\u003eOptimize web applications to maximize speed and scale\u003c/li\u003e\n\u003cli\u003eBuild libraries and frameworks that support complex web applications, speedup development efficiency and improve code quality\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eMinimum qualifications:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years developing production JavaScript code and strong knowledge of React.JS\u003c/li\u003e\n\u003cli\u003eFluent English. Proficiency in Chinese would be of an advantage, to communicate with a variety of stakeholders across the company\u003c/li\u003e\n\u003cli\u003eFamiliar with crypto technology, experience in using dApp and wallets\u003c/li\u003e\n\u003cli\u003eUnderstanding of state-management patterns such as Redux, Flux or similar\u003c/li\u003e\n\u003cli\u003eProven track record of delivering projects with high quality UI\u003c/li\u003e\n\u003cli\u003eBachelor’s/Master’s degree in computer science, engineering or equivalent industry experience\u003c/li\u003e\n\u003cli\u003eExperience in developing responsive web sites for diverse clients from high powered desktop computers to small footprint mobile devices\u003c/li\u003e\n\u003cli\u003eExperience with modern front end technologies (Styled System, Webpack, etc)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePreferred:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOpen-source contributor, especially in the crypto/blockchain area\u003c/li\u003e\n\u003cli\u003eFamiliarity with the whole web stack, including protocols and server side techniques\u003c/li\u003e\n\u003cli\u003eFamiliar with server-side rendering\u003c/li\u003e\n\u003cli\u003eFamiliar with the source code of one or two famous front-end libraries\u003c/li\u003e\n\u003cli\u003eTypeScript\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via: \u003ca href=\"https://jobs.lever.co/binance/94e2b754-d49b-4606-b92b-74818f74646c\"\u003ehttps://jobs.lever.co/binance/94e2b754-d49b-4606-b92b-74818f74646c\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbzZVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a4796cb9addb3eca55f27d40c91af110cf7ad3fe/binance_logo.png"},{"id":"241a62bb-3a28-476c-85c0-f9b19b7c3f49","type":"Contract","url":"https://jobs.github.com/positions/241a62bb-3a28-476c-85c0-f9b19b7c3f49","created_at":"Tue Jan 05 08:11:50 UTC 2021","company":"PERI","company_url":"https://www.peri.com/de","location":"Weissenhorn, Germany","title":"Software Engineer* Dynamics 365","description":"\u003cp\u003eSie tragen Verantwortung für\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003edie agile Anwendungsentwicklung im gesamten Lebenszyklus der Dynamics 365 Landschaft inklusive Power Platform\u003c/li\u003e\n\u003cli\u003eden Aufbau und die Weiterentwicklung einer automatisierten CI/CD Pipeline\u003c/li\u003e\n\u003cli\u003edie Erarbeitung und Validierung von IT-Konzepten\u003c/li\u003e\n\u003cli\u003edie Spezifikation und Implementierung von optimalen Schnittstellen sowie Integration externer Datenquellen\u003c/li\u003e\n\u003cli\u003edie Unterstützung bei der Durchführung von Migrations- und Rolloutprojekten\u003c/li\u003e\n\u003cli\u003edas Management von externen Dienstleistern und der Entwicklungstätigkeiten gemäß dem IT-Vorgehensmodell, Entwicklungsprozess und Qualitätsmanagement\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSie erwartet bei uns\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eflache Hierarchien\u003c/li\u003e\n\u003cli\u003eanspruchsvolle Projekte in interdisziplinären und interkulturellen Teams\u003c/li\u003e\n\u003cli\u003einternationale Einsatzmöglichkeiten\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSie zeichnen sich aus durch\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eein abgeschlossenes Hochschulstudium der Wirtschaftsinformatik, technischen Informatik oder einer vergleichbaren Fachrichtung\u003c/li\u003e\n\u003cli\u003emehrjährige praktische Erfahrungen im Bereich der Software-Entwicklung, vorzugsweise im Dynamics 365 Umfeld\u003c/li\u003e\n\u003cli\u003esehr gutes Verständnis von agilen Methoden (SCRUM, Kanban)\u003c/li\u003e\n\u003cli\u003ehöchste Lösungsorientierung und Innovationsbereitschaft\u003c/li\u003e\n\u003cli\u003eIhre Reisebereitschaft\u003c/li\u003e\n\u003cli\u003esehr gute Deutsch- und Englischkenntnisse in Wort und Schrift\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e*Mit unseren Stellenausschreibungen sprechen wir alle Geschlechter gleichermaßen an.\u003c/p\u003e\n\u003cp\u003eEin Stellenangebot der Peri-Werk Artur Schwörer GmbH \u0026amp; Co. KG.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply online:\n\u003ca href=\"https://www.peri.com/de/karriere/stellenboerse/DE01883.html\"\u003ehttps://www.peri.com/de/karriere/stellenboerse/DE01883.html\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBblNVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--61a048bb68c029a499987bf81ac2582a6c134397/PERI_Logo_oR_RGB%20jpg.jpg"},{"id":"43ddd9a4-4c49-46a0-8b3e-6f1b3e7c522b","type":"Full Time","url":"https://jobs.github.com/positions/43ddd9a4-4c49-46a0-8b3e-6f1b3e7c522b","created_at":"Tue Jan 05 19:31:47 UTC 2021","company":"Welcome","company_url":"https://heywelcome.com","location":"Remote | NYC","title":"Senior Software Engineer","description":"\u003ch1\u003eAbout the role\u003c/h1\u003e\n\u003cp\u003eThe Senior Software Engineer is a experienced technical leader who drives the development of new products and initiatives. Collaborating closely with Design, Product Management, and Engineering teams, this role works with others to determine what to build and how to build it. Senior software engineers @ Welcome are highly autonomous user-focused professionals that know how to deliver rapid value while building software with a high degree of craftsmanship.\u003c/p\u003e\n\u003ch2\u003eAbout Welcome\u003c/h2\u003e\n\u003cp\u003eOur mission is to help companies build lasting relationships with candidates and employees. We're reimagining the closing experience with the goal of improving close and retention rates, while building the first real-time compensation data set to help companies make better offers and level-set pay equity.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eFor Employees\u003c/strong\u003e: We make it easy to understand their total compensation and how their financial relationship with the company grows and evolves over time (cash, equity, refresher grants, benefits/perks, etc).\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eFor Candidates\u003c/strong\u003e: We make it easy to understand their offer (digital and fully branded), which includes total compensation, equity, benefits, perks, the team they’ll work with, and the culture of the company.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eFor HR \u0026amp; People teams\u003c/strong\u003e: With a heavy focus on the candidate experience, we streamline offer creation and collaboration to run a more effective closing process, better explain total compensation through our digital offer experience, and integrate our real-time comp and equity data to make better offers.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur team is deeply invested in encouraging a culture that promotes design thinking, collaboration and a passion for excellence. We work together as a team to build exceptional products that transform the hiring experience.\u003c/p\u003e\n\u003ch2\u003eResponsibilities\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eWrite server-side functionality using Python / Django and develop client-side interfaces using Javascript / ReactJs.\u003c/li\u003e\n\u003cli\u003eDrive the creation, shipping, and maintenance of capabilities across the Welcome Platform.\u003c/li\u003e\n\u003cli\u003eParticipate in the entire product creative process, including user interviews, design meetings, technical architecture decisions, and resulting implementation.\u003c/li\u003e\n\u003cli\u003eContinually collaborate with other members of the Engineering team, in addition to Product and Design teams.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eTL;DR\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://heywelcome.com\"\u003eWelcome\u003c/a\u003e (100% remote, NYC based) is looking for \u003cstrong\u003eSenior Software engineers\u003c/strong\u003e in any of the following domains: backend, frontend, and data. Our stack is 100% Python on the backend and ReactJS on the frontend. We like you already and hope the feeling is mutual.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eemail your resume to \u003ca href=\"mailto:dan@heywelcome.com\"\u003edan@heywelcome.com\u003c/a\u003e 💌\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3lVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2dd272482033bb28b0310ed0d882496cb19a575f/Green%20Avatar.png"},{"id":"a01151be-f939-48e7-9ce8-2d15cf88ce65","type":"Full Time","url":"https://jobs.github.com/positions/a01151be-f939-48e7-9ce8-2d15cf88ce65","created_at":"Tue Jan 05 18:56:16 UTC 2021","company":"Parade","company_url":"https://yourparade.com","location":"Remote","title":"Frontend Engineer","description":"\u003cp\u003eParade is growing! We are hiring another remote, full-time frontend developer to join our Digital team as we continue to rewrite the American underwear story.\u003c/p\u003e\n\u003cp\u003eAs a front-end developer, you’ll build innovative e-commerce digital products to provide our community with a seamless and fun shopping experience. You’ll do much more than just write code - you’ll be an integral part of the entire digital product development process, from ideation through delivery and iteration.\u003c/p\u003e\n\u003cp\u003eYou’ll work on our Digital team, made up of folks across growth, design, and engineering, to drive our business forward and bring Parade to hundreds of thousands of people across the United States over the next year. This role reports to the Head of Engineering and will work closely with both them and our current engineer.\u003c/p\u003e\n\u003cp\u003eOur Stack \u0026amp; Process:\nNew frontend projects typically start with a set of Figma designs, coupled with detailed interaction notes, which we’d hand off to you. You’ll take these and turn them into live code on a weekly cadence. We value good software and believe in nimbleness as a defining characteristic of our success.\u003c/p\u003e\n\u003cp\u003eOur storefront runs on Shopify Plus, so you should be comfortable with Liquid templating and generally know your way around Shopify theme development and deployment. Strong HTML, CSS, and JS skills are a must-have. You should also be comfortable doing performance optimization on the frontend (and it’s a bonus if you’ve also previously optimized Liquid code.) It’s also important to have experience collaborating on complex, multi-developer projects.\u003c/p\u003e\n\u003cp\u003eIt’s also a plus if you’ve ever worked with (or are comfortable building) Ruby on Rails apps -- we have a custom backend that powers a bunch of missing Shopify features, as well as supports our Product and Community teams’ internal processes; you’d periodically be helping ship features there, too. We typically operate on a one- to three-week sprint cycle, but are not overly dogmatic and prioritize opportunities to impact the business day-to-day.\u003c/p\u003e\n\u003cp\u003eRole \u0026amp; Responsibilities:\nThis is a fully-remote, full-time position. We’d start with a paid sample project, building a hypothetical new feature for our live storefront, as well as doing some brainstorming exercises around how you think about product. We’re mostly in LA and NYC, so at minimum you should be able to be available for a chunk of time during Eastern Time working hours. Ideally you’re someone who has always worked remotely, are comfortable communicating over Slack and email, and can self-manage your time and priorities.\u003c/p\u003e\n\u003cp\u003eRequired Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have 4+ years of web development experience in E-Commerce, with at least some Shopify experience\u003c/li\u003e\n\u003cli\u003eStrong JavaScript development skills and understanding of new ES6 concepts\u003c/li\u003e\n\u003cli\u003eExpert knowledge of CSS/SCSS and implementing web animations\u003c/li\u003e\n\u003cli\u003eExperience with integrating front-end frameworks like React with Shopify\u003c/li\u003e\n\u003cli\u003eKnowledge of build tools like Webpack and Babel for web performance and optimization.\u003c/li\u003e\n\u003cli\u003eStrong design instincts and enjoys working collaboratively with a team of designers\u003c/li\u003e\n\u003cli\u003eA commitment to creating readable, clean, and well documented code\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eVery Nice to Have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA website or a portfolio\u003c/li\u003e\n\u003cli\u003eExperience with Shopify Plus, Storefront API, GraphQL, and Ruby on Rails\u003c/li\u003e\n\u003cli\u003eExperience with headless architecture\u003c/li\u003e\n\u003cli\u003eExperience managing projects end to end\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBenefits + Perks\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMedical, dental, and vision insurance\u003c/li\u003e\n\u003cli\u003eCompetitive compensation, including equity\u003c/li\u003e\n\u003cli\u003ePaid time off including Vacation PTO, Sick Leave, and Quarterly Company-wide Wellness Days\u003c/li\u003e\n\u003cli\u003eWFH setup stipend\u003c/li\u003e\n\u003cli\u003eCommuter benefits\u003c/li\u003e\n\u003cli\u003eEmployee discounts on Parade products\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eApply via Lever: \u003ca href=\"https://jobs.lever.co/ParadeInc/115b5c46-5880-427e-bd18-76618a89d2e7?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/ParadeInc/115b5c46-5880-427e-bd18-76618a89d2e7?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb21VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e1ac88258fbd6286ab8c24e4ebb39d803ae1f613/parade-logo.png"},{"id":"2940d1d6-767a-44dd-814a-f8e923bac67c","type":"Full Time","url":"https://jobs.github.com/positions/2940d1d6-767a-44dd-814a-f8e923bac67c","created_at":"Tue Jan 05 18:14:57 UTC 2021","company":"Rigado","company_url":"https://www.rigado.com/","location":"Portland, OR or Remote","title":"Senior Software Engineer","description":"\u003ch3\u003eWhat we do in engineering at Rigado:\u003c/h3\u003e\n\u003cp\u003eWe design and build scalable, maintainable solutions to real-world business problems using low-power wireless devices, edge computing and the cloud. Whether the solution monitors room occupancy to maintain a safe workplace, tracks temperature of critical vaccines or tracks inventory in a warehouse, it needs to be managed, monitored and updated in a secure and stable way. Rigado’s products meet this need.\u003c/p\u003e\n\u003cp\u003eJoin us as we develop and evolve our edge platform to monitor end-devices, load balance sensor data collection across multiple edge compute nodes and continue to make our system more stable and robust.\u003c/p\u003e\n\u003ch3\u003eHow we do in engineering:\u003c/h3\u003e\n\u003cp\u003eCuriosity, empathy, ownership, and collaboration underline our work. We like strong opinions, weakly held. If you're eager to both learn from and teach fellow engineers and non-engineers alike, build excellent products for our customers, and dive headfirst into unfamiliar technology, approaches, and challenges, please be in touch.\u003c/p\u003e\n\u003ch3\u003eThe tech details:\u003c/h3\u003e\n\u003cp\u003eWe're building a distributed system, primarily in Go, to manage devices on the edge. Our systems must function effectively in the absence of a reliable connection between the server and the client. The system extends from the backend in the cloud down to actual management devices, so we've got software, firmware, and hardware engineers all working together. No experience with the other the areas of engineering required for this software position but it is a bonus.\u003c/p\u003e\n\u003cp\u003eWe've also got some of the standard hopes and dreams of a senior backend engineer job posting:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience designing and building distributed systems\u003c/li\u003e\n\u003cli\u003eExperience with a non-relational database such as DynamoDB\u003c/li\u003e\n\u003cli\u003eFamiliarity with AWS services or other cloud vendors\u003c/li\u003e\n\u003cli\u003eCommitment to writing stable and maintainable software that's tested, documented, and has a barest minimum of TODOs\u003c/li\u003e\n\u003cli\u003eUnderstanding of how to use metrics, monitoring, and alerting to ensure system health\u003c/li\u003e\n\u003cli\u003eExperience with operations and hosting services you build\u003c/li\u003e\n\u003cli\u003eExperience in Go is a plus but not a requirement\u003c/li\u003e\n\u003cli\u003eUnderstanding of networking (OSI, TLS, HTTP)\u003c/li\u003e\n\u003cli\u003eFamiliarity with Linux (embedded or otherwise)\u003c/li\u003e\n\u003cli\u003eExperience with Docker or other container technology\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMost importantly, we're looking for someone who is excited to learn and tackle new challenges, is motivated to be a valued colleague, is not afraid to ask for help, and doesn't hesitate to provide help. This is a lot exciting stuff coming down the pike so there's a lot of room to help shape the future of software at Rigado and of IoT device management generally.\u003c/p\u003e\n\u003ch3\u003eThe people details:\u003c/h3\u003e\n\u003cp\u003eWe're building a team in addition to software, and we value and seek inclusion and diversity in that team. We're not thrilled to be representative of the state of the industry at the moment and are committed to pushing a sea change on that front. If this commitment resonates with you and the work sounds interesting to you, please reach out.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply through our careers page at \u003ca href=\"https://www.rigado.com/careers/\"\u003ehttps://www.rigado.com/careers/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1dVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1566e5b1f008d24f6ca61e2c4e52c52079525404/BlogPosts_RigadoLogo-2-640x422.png"},{"id":"e5948998-64f6-4186-9bdb-bf71aeb5fc01","type":"Full Time","url":"https://jobs.github.com/positions/e5948998-64f6-4186-9bdb-bf71aeb5fc01","created_at":"Tue Jan 05 15:14:49 UTC 2021","company":"ALDI Einkauf GmbH \u0026 Co. oHG","company_url":"https://vonq.io/2Xe5qvf","location":"Essen","title":"Solution Architect (m/w/d)","description":"\u003ch2\u003eDas sind deine Aufgaben\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eDigitale Lösungen auf Basis unserer Digital Plattform zu entwerfen\u003c/li\u003e\n\u003cli\u003eAnalyse der fachlichen Anforderungen und Übersetzung in technische Lösungen\u003c/li\u003e\n\u003cli\u003eSchnittstellen zu entwerfen und Datenflüsse zu analysieren zwischen den Komponenten der Digital Plattform mit Blick auf Hochverfügbarkeit und Skalierbarkeit\u003c/li\u003e\n\u003cli\u003eUnterstützung unserer Projektteams bei der Analyse, Planung und Dokumentation der Architektur der Digital Plattform\u003c/li\u003e\n\u003cli\u003eIntegration von Applikationen in die Gesamtarchitektur\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDas bringst du mit\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAbgeschlossenes Studium mit digitalem Schwerpunkt (z.B. Wirtschaftsinformatik, Informatik, Digitales Marketing, ECommerce) oder eine vergleichbare Qualifikation\u003c/li\u003e\n\u003cli\u003eSehr gute Deutsch- und Englischkenntnisse in Wort und Schrift\u003c/li\u003e\n\u003cli\u003eTiefgehendes Fachwissen in Adobe Experience Manager Architekturen und Technologien (OSGi Framework, JCR, Sling)\u003c/li\u003e\n\u003cli\u003eErfahrung mit Entwicklungswerkzeugen (z. B. Maven und Git) und Webservern (Apache, Tomcat, MongoDB)\u003c/li\u003e\n\u003cli\u003eErfahrungen mit SAP Commerce\u003c/li\u003e\n\u003cli\u003eKenntnisse in anderen Adobe Marketing Cloud Produkten (z.B. Analytics, Target und Campaign)\u003c/li\u003e\n\u003cli\u003eErfahrung in der Entwicklung von Java-basierten Content Management Systemen, insbesondere im Bereich Adobe (CQ5 / AEM 6)\u003c/li\u003e\n\u003cli\u003eErste Erfahrungen in eCommerce Systemen (z.B. hybris) von Vorteil\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDas bieten wir dir\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eTop-Branchengehalt!\u003c/li\u003e\n\u003cli\u003eEine abwechslungsreiche und anspruchsvolle Tätigkeit im internationalen Umfeld\u003c/li\u003e\n\u003cli\u003eEinen sicheren Arbeitsplatz bei der Nr. 1 im Discount\u003c/li\u003e\n\u003cli\u003eEin leistungsstarkes und angenehmes Arbeitsumfeld in einem Team, das sich auf Dich freut!\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eInteressiert?\u003c/h2\u003e\n\u003cp\u003eWir freuen uns auf Ihre Bewerbung über das \u003cstrong\u003eBewerbungsformular\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/2Xe5qvf\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/2Xe5qvf\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb09VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b42249a31c8686fc32dae959f8c8d50b8e8c78f0/Aldi.jpg"},{"id":"6bb39f1f-18a1-45ec-b985-696e2f5a698b","type":"Full Time","url":"https://jobs.github.com/positions/6bb39f1f-18a1-45ec-b985-696e2f5a698b","created_at":"Tue Jan 05 15:03:07 UTC 2021","company":"advalyze GmbH","company_url":"https://www.advalyze.com/de/","location":"Berlin","title":"Marketing Data Engineer (m/w/d)","description":"\u003cp\u003eadvalyze steht für analyze | advice | advertise\u003c/p\u003e\n\u003cp\u003eÜber 25 Digitalexperten aus den Bereichen Growth, Creative, MarTech und Reach helfen Startups, mittelständischen Unternehmen und Konzernen bei der Skalierung ihrer Geschäftsmodelle. Growth Marketing, Marketing Automation, Sales Automation, Lean Startup, A/B Tests – Digitalisierung wird bei advalyze gelebt und spannende Herausforderungen sind garantiert. Ganz nach unserem Motto „Dream big, get shit done, know how to have fun” suchen wir Leute mit derselben Hands-On-Attitude, die Spaß an ihrer Arbeit haben, sich einbringen und über ihren Tellerrand hinausschauen können. Spaß und eine sehr steile Lernkurve sind garantiert!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDEINE HERAUSFORDERUNG\u003c/p\u003e\n\u003cp\u003eWir suchen ab sofort einen Data Engineer (m/w/d), der für unsere Kunden die technische Infrastruktur der Datenerfassung und -verarbeitung aufbaut sowie in der datengetriebenen Analyse digitaler Marketingkampagnen berät. Zusätzlich unterstützt du uns mit deiner Kompetenz unsere eigenen Operations datengetrieben zu steuern.\u003c/p\u003e\n\u003cp\u003eDEINE AUFGABEN\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu übernimmst das Tracking und Monitoring unserer Kundenprojekte und unterstützt unsere Marketers mit Segmentierungen in unseren DMP, CDP, CRM, DWH und Marketing Automation Systemen.\u003c/li\u003e\n\u003cli\u003eDu bist für den Aufbau unseres eigenen MarTech-Stacks zur Datenanalyse verantwortlich und entwickelst ein Standard-Reporting-Framework mit relevanten KPI’s für unsere Kunden.\u003c/li\u003e\n\u003cli\u003eDu konzipierst und entwickelst unser DWH mit den Daten unserer Zeiterfassung, Finanzen, Sales etc. in Google Bigquery und wertest die Daten für die Businessplanung, People Analytics und das Client Reporting aus.\u003c/li\u003e\n\u003cli\u003eDu bereitest Daten und Reportings mit Hilfe von Visualisierungstools wie Google Data Studio, Looker, Chartio oder Power BI auf und kannst komplexe Zusammenhänge einfach erklären.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQualifikation\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu hast erste Berufserfahrung im Bereich Data und/oder Analytics eines digitalen Umfelds (z.B. Startup, Agentur, Beratung, digitaler PurePlayer etc.) sammeln können.\u003c/li\u003e\n\u003cli\u003eDu bist Experte in der Daten- und Prozessmodellierung und programmierst bereits einige Jahre in Python, SQL und idealerweise auch JavaScript.\u003c/li\u003e\n\u003cli\u003eDu verfügst über solide Kenntnisse im Web Tracking (z.B. Tag Manager, Google Analytics, Snowplow) und der Datenanalyse in einschlägigen Tools wie Google Data Studio, R, Power BI.\u003c/li\u003e\n\u003cli\u003eDu sprichst Deutsch und Englisch fließend.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDie Möglichkeit mit einem dynamischen Unternehmen zu wachsen und schnell viel Verantwortung zu übernehmen\u003c/li\u003e\n\u003cli\u003eEine unbefristete Anstellung mit attraktiver Vergütung\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten mit einer ehrlichen 40-Stunden-Woche und die Option auf Homeoffice\u003c/li\u003e\n\u003cli\u003eAgile Prozesse, flache Hierarchien und kurze Entscheidungswege Moderne, klimatisierte Büroräume in Berlin Weißensee mit sehr guter Anbindung an die öffentlichen Verkehrsmittel\u003c/li\u003e\n\u003cli\u003eBudget für deine persönliche Weiterbildung\u003c/li\u003e\n\u003cli\u003eRegelmäßige Teamevents wie ein Besuch im Freizeitpark, die Teilnahme am ToughMudder und eine jährliche Weihnachtsfeier\u003c/li\u003e\n\u003cli\u003eLust mit uns zu arbeiten? Dann klick auf den Button und bewirb dich jetzt. Nach Bewerbungseingang und sorgfältiger Prüfung melden wir uns innerhalb einer Woche bei dir.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWiebke Schmidt HR Managerin\u003c/p\u003e\n\u003cp\u003eUm die Gesundheit unserer MitarbeiterInnen und BewerberInnen zu gewährleisten, ist unser Interviewprozess aktuell zu 100% remote.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://advalyze.join.com/jobs/1749662-marketing-data-engineer-m-w-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=marketing%2Bdata%2Bengineer%2Bm%2Bw%2Bd\"\u003ehttps://advalyze.join.com/jobs/1749662-marketing-data-engineer-m-w-d?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=marketing%2Bdata%2Bengineer%2Bm%2Bw%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb0dVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--583d3f4280cc871761f21cb44456105918a5dbb7/advalyze_Logo_Rz-2-e1597052637998.png"},{"id":"912fc53b-1b7f-427a-bc69-25f03b597f8c","type":"Full Time","url":"https://jobs.github.com/positions/912fc53b-1b7f-427a-bc69-25f03b597f8c","created_at":"Fri Oct 30 15:33:27 UTC 2020","company":"Defendify","company_url":"https://www.defendify.io/","location":"Portland, ME (Remote OK)","title":"Senior Full Stack Developer","description":"\u003cp\u003eThanks for your interest in working with us! Defendify is a fast-growing, fun-loving cybersecurity startup with a small, vibrant team based in Portland, Maine. Resourcefulness, responsiveness, problem-solving, and simplicity are values that shape who we are, what we do, and how we deliver amazing customer experiences.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePosition Details\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe're looking for a senior level full stack developer to join us full-time, locally and/or in a remote capacity. This is a unique and exciting opportunity as we continue to expand the footprint of our groundbreaking, all-in-one cybersecurity platform. Every team member is a valuable contributor to our core SaaS product with day-to-day responsibilities covering a variety of development needs including building, maintaining, QA, and support for every aspect of the Defendify platform.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe are looking for a team player who:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHas a passion for solving problems and is eager to grow, learn, and tackle daily and long-term challenges and goals.\u003c/li\u003e\n\u003cli\u003eWill dig in and ask questions from users to understand requirements; make a plan; dive into an existing codebase and learn where to make changes, or where to start new code.\u003c/li\u003e\n\u003cli\u003eIs a good communicator who enjoys collaboration and thrives in a development culture that values clean code, automation and testability.\u003c/li\u003e\n\u003cli\u003eMaintains excellent knowledge of how modern web applications work, including REST API usage, application security, cloud deployment and development best practices.\u003c/li\u003e\n\u003cli\u003eIs comfortable self-directing their own work. No micro-management here!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements – Experience\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of Full-Stack Development experience\u003c/li\u003e\n\u003cli\u003eHas been responsible for the entire lifecycle of code in at least one project, from scratch to QA to deployment to maintenance.\u003c/li\u003e\n\u003cli\u003eHas experience implementing a RESTful API and an application which consumes it.\u003c/li\u003e\n\u003cli\u003eIs familiar with the philosophy and implementation of development automation: tests, continuous integration, cloud deployment, and frequent production releases using an Agile/SCRUM process.\u003c/li\u003e\n\u003cli\u003eDevOps experience is a plus.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements – Technical\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperienced in JavaScript including ES6, await/async, linting and front-end frameworks. We use libraries and frameworks as needed, but you need to be able to write and understand plain JS.\u003c/li\u003e\n\u003cli\u003eExperience with Node and Browser based environments is required.\u003c/li\u003e\n\u003cli\u003eUnderstand REST APIs and their role in application architectures.\u003c/li\u003e\n\u003cli\u003eExperience with front end development: HTML, CSS, and familiarity with the ecosystem of related technologies (SASS, DOM). In addition, Vue (or similar framework) experience and knowledge of static site generators such as Jekyll/Hugo are helpful.\u003c/li\u003e\n\u003cli\u003eUnderstand how to use Git(+Hub) and GitHub Flow.\u003c/li\u003e\n\u003cli\u003eSome relational database experience is needed. Pluses include: Experiences in relational and in-memory databases (MySQL, Postgres, Redis) as well as knowledge in generic SQL.\u003c/li\u003e\n\u003cli\u003eSome experience with Amazon Web Services (AWS), Heroku, or similar services.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Success\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou are not alone in your role – Defendify's development team is made up of \"A\" players dedicated to your training and success. We thrive on an open-door policy and transparent management system that fosters team collaboration.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation and Benefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis is a flexible position open to candidates with varying levels of experience and offers long term growth potential via a well-defined career path. Compensation is competitive and commensurate with experience, and is variable based on personal and team performance. Our benefits package is comprehensive and includes health, dental, and vision coverage, educational reimbursement, a 401(k) program, paid time-off and more.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLove What You Do\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDefendify employees enjoy a modern work environment and culture where everyone genuinely cares about the work they do. We're passionate about our product, the problems we're solving, our customers, our partners, and our team. We're in it together, enjoying work and play every day from team lunches, impromptu social outings and celebrations, and charity missions. And yes, there is coffee, lots and lots of coffee!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOpportunity Knocks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis position offers a great opportunity to make an impact as a part of a small team solving big problems, making cybersecurity possible for Small Business. Are you a creative self-starter with an appetite to learn and grow? If so, we'd love to hear from you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply now at \u003ca href=\"https://defendify.breezy.hr/p/267bbae0c690-senior-full-stack-developer\"\u003ehttps://defendify.breezy.hr/p/267bbae0c690-senior-full-stack-developer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBblNOIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a2730d55401adcd2e1832cebe43cc72f28ecbf83/Defendify_grey_R.png"},{"id":"b003b45c-6abb-4206-8a5c-171c6efb7d00","type":"Full Time","url":"https://jobs.github.com/positions/b003b45c-6abb-4206-8a5c-171c6efb7d00","created_at":"Tue Jan 05 12:09:20 UTC 2021","company":"dirico","company_url":"https://dirico.io/","location":"Koblenz","title":"Fullstack Developer (m/w/d)","description":"\u003cp\u003eWir sind die 247GRAD Labs GmbH, das IT-Unternehmen hinter dirico, der All-in-one-Plattform für Kommunikations- und Marketingteams.\u003c/p\u003e\n\u003cp\u003edirico unterstützt Unternehmen weltweit dabei, ihren Content besser zu planen, zu erstellen und zu veröffentlichen als jemals zuvor. Das macht unsere Kunden so glücklich, dass sie dirico bereits in über 20 Ländern einsetzen. Unser Kundenkreis wächst stetig und beinhaltet einige der Top-50-Unternehmen Deutschlands.\u003c/p\u003e\n\u003cp\u003eDeshalb suchen wir Dich als Unterstützung für unser Team in Koblenz und Oradea (Rumänien).\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://t3u1.mjt.lu/lnk/AMoAAJAQ2_8AAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBf9E3hBOk8hPn6TLWSxTHCe0ChBAAGCXo/2/vrL58i3wIjjrjnoVeddf-g/aHR0cHM6Ly9kaXJpY28uaW8vdWViZXItdW5zLw\"\u003eErfahre mehr über uns und wirf einen Blick hinter die Kulissen.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDas sind deine Aufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNeu- und Weiterentwicklung unserer Softwarelösung mit den Schwerpunkten C#, .NET, React und Angular\u003c/li\u003e\n\u003cli\u003eErstellung von Systemarchitektur und Softwaredesign\u003c/li\u003e\n\u003cli\u003eAktive Mitgestaltung der Infrastruktur und eingesetzten Prozesse im Entwicklungsteam\u003c/li\u003e\n\u003cli\u003eEinsatz und Test modernster Praktiken und Umsetzung neuer Ideen\u003c/li\u003e\n\u003cli\u003eEvaluierung und Auswahl neuer Technologien für die Nutzung in der Entwicklung\u003c/li\u003e\n\u003cli\u003eZusammenarbeit in einem international agierenden Umfeld von Entwicklungsteams\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas solltest Du mitbringen\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSehr gute Kenntnisse in .NET und C#\u003c/li\u003e\n\u003cli\u003eKenntnisse in mindestens einem der JavaScript-Frameworks wie React, Angular oder Vue.js\u003c/li\u003e\n\u003cli\u003eErfahrungen mit TypeScript, HTML und CSS sind gerne gesehen\u003c/li\u003e\n\u003cli\u003eGute Kenntnisse im Bereich von relationalen Datenbanken/SQL, Design Pattern sowie gängigen Frameworks (z.B. EF)\u003c/li\u003e\n\u003cli\u003eOptimalerweise bringst du Erfahrungen zu Schnittstellen von Social-Media-Plattformen mit\u003c/li\u003e\n\u003cli\u003eSicherer Umgang mit objektorientiertem Code, UML und Design Patterns\u003c/li\u003e\n\u003cli\u003eScrum, Git und Clean Code sind keine Fremdwörter, sondern alte Bekannte\u003c/li\u003e\n\u003cli\u003eSehr gute Kenntnisse der deutschen und der englischen Sprache\u003c/li\u003e\n\u003cli\u003eEine analytische und strukturierte Arbeitsweise, Zuverlässigkeit und Lösungskompetenz zeichnen dich aus, messbare Ergebnisse sind Dir wichtig\u003c/li\u003e\n\u003cli\u003eDu bist bereit, dich weiterzuentwickeln und neuen Herausforderungen zu stellen\u003c/li\u003e\n\u003cli\u003eErfahrungen mit der Azure Plattform runden Dein Profil ab\u003c/li\u003e\n\u003cli\u003eSelbstständige Arbeitsweise\u003c/li\u003e\n\u003cli\u003eDu bist engagiert und hast Interesse daran, Dich mit Deiner Meinung aktiv im Team einzubringen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas erwartet dich bei uns\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEin innovatives Softwareprodukt im spannenden Marketing-Kontext\u003c/li\u003e\n\u003cli\u003eRenommierte Referenzkunden wie ThyssenKrupp, Lanxess, WetterOnline, R+V, Dr. Oetker, Sport2000 und viele mehr\u003c/li\u003e\n\u003cli\u003eEin stark wachsendes und motiviertes Team mit Weltklasse-Kollegen\u003c/li\u003e\n\u003cli\u003eAbwechslungsreiche und anspruchsvolle Aufgaben, die Spaß machen\u003c/li\u003e\n\u003cli\u003eEchte Start-up-Atmosphäre in einem mittelständischen Unternehmen\u003c/li\u003e\n\u003cli\u003eFlache Hierarchien und schnelle Entscheidungswege für Deine kreativen Ideen\u003c/li\u003e\n\u003cli\u003eAgile Arbeitsprozesse und modernste Hardware\u003c/li\u003e\n\u003cli\u003eEin jährliches Weiterbildungsbudget zur Unterstützung Deiner fachlichen und persönlichen Weiterentwicklung\u003c/li\u003e\n\u003cli\u003eFlexible Vertrauensarbeitszeit in Gleitzeit\u003c/li\u003e\n\u003cli\u003eDie Möglichkeit auf Homeoffice nach Absprache\u003c/li\u003e\n\u003cli\u003eErgonomisches Arbeitsumfeld mit höhenverstellbaren Tischen und rückenschonenden Stühlen\u003c/li\u003e\n\u003cli\u003eZuschuss zum Premium-Fitnessstudio Danys\u003c/li\u003e\n\u003cli\u003eRegelmäßige Teamevents\u003c/li\u003e\n\u003cli\u003eBetriebliche Altersvorsorge\u003c/li\u003e\n\u003cli\u003eFrisches Obst, Kaffeevariationen und Wasser for free\u003c/li\u003e\n\u003cli\u003eKein Dresscode – wir wollen, dass Du dich wohlfühlst, also: come as you are\u003c/li\u003e\n\u003cli\u003eUnsere Bürohunde sind ausgebildete Feelgood-Manager\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/2c6be01ea691c2ce642d9d67af9c220690ea857a/68747470733a2f2f742e676f686972696e672e636f6d2f682f61353530396230363535633464323339623366666165373563323732366135363632623963633034303638313937336635376461386463636135343734323136\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/c5a40ff4193b71eca19e915c274117af6c2052975787abf3de0ec28707a69775\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmlVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6c0b3a4b1af8460136574669056b869a55cd7205/dirico.png"},{"id":"82f87bd6-2732-4555-8784-2595d662ccd8","type":"Full Time","url":"https://jobs.github.com/positions/82f87bd6-2732-4555-8784-2595d662ccd8","created_at":"Tue Jan 05 11:02:58 UTC 2021","company":"Pixtunes GmbH","company_url":"https://pixtunes.com","location":"Berlin","title":"System Architect / Software Lead (m/w/d)","description":"\u003cp\u003ePixtunes is a Berlin-based deep-tech startup with the goal of introducing a completely new entertainment technology to the world of consumer electronics that will change the way people perceive their own reality in everyday life.\u003c/p\u003e\n\u003cp\u003eWe are design-oriented visionaries who hope to create experiences that go far beyond what people have ever encountered before. Our vision for a new kind of music has led us to invent a revolution that we can proudly call our own — a technology that transforms existing music formats and entertainment systems to a whole new level.\u003c/p\u003e\n\u003cp\u003eFrom the individual consumer to global markets, our goal is to provide everyone with their own unique soundtrack for their lives. An intense experience like in the cinema, only it is drawn from your own reality, accompanied by ground-breaking music and sound.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, develop, and deploy client/server audio applications with a focus on software quality, performance, and reliability\u003c/li\u003e\n\u003cli\u003eDevelop and optimise the Pixtunes software architecture with all components (Server, Client, APP)\u003c/li\u003e\n\u003cli\u003eSpecification and definition of the overall system architecture incl. the relevant interfaces / SDKs\u003c/li\u003e\n\u003cli\u003eEntire project life cycle - from architecting to deploying in various channels in the industry\u003c/li\u003e\n\u003cli\u003eGuide the team and collaborate closely with other engineers, product designers, and sound designers, becoming a core member of an autonomous, cross-functional team\u003c/li\u003e\n\u003cli\u003eMentorship, code review, and advisement on best practices for junior team members\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e7+ years experience with C++ programming and development of mobile APPs (iOS/(Android)\u003c/li\u003e\n\u003cli\u003eExperience with programming language Rust and in deploying software in embedded systems\u003c/li\u003e\n\u003cli\u003eAudio/DSP development \u0026amp; programming desirable\u003c/li\u003e\n\u003cli\u003eExperience in defining requirements for projects with a complex deployment structure, interfacing with hardware, cloud backends and multiple platform support.\u003c/li\u003e\n\u003cli\u003eDedication to industry-standard development processes and long-term code base quality\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFast-growing high tech company with a great network of investors and partners\u003c/li\u003e\n\u003cli\u003eAbility to contribute directly to the future of music\u003c/li\u003e\n\u003cli\u003eFlexible career development path within an international and diverse team\u003c/li\u003e\n\u003cli\u003eAn inspiring working environment with modern workspaces, flexible work time, short lines of communication, flat structures, positive leadership, and great team spiritA fun startup work environment in the middle of Berlin, with team gatherings and company parties!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDoes this sound like the perfect challenge for you? Please send your application!\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://pixtunes.join.com/jobs/1723382-system-architect-software-lead-m-w-d?pid=71fbd6149a82b0b128ee\u0026amp;utm_source=stackoverflow\u0026amp;utm_medium=paid\u0026amp;utm_campaign=stackoverflow\u0026amp;utm_content=system%2Barchitect%2Bsoftware%2Blead%2Bm%2Bw%2Bd\"\u003ehttps://pixtunes.join.com/jobs/1723382-system-architect-software-lead-m-w-d?pid=71fbd6149a82b0b128ee\u0026amp;utm_source=stackoverflow\u0026amp;utm_medium=paid\u0026amp;utm_campaign=stackoverflow\u0026amp;utm_content=system%2Barchitect%2Bsoftware%2Blead%2Bm%2Bw%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmFVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3228aabc2e54e6aae2358db1811bfebe190cefff/pixtunes.jpg"},{"id":"6d3173e8-15bb-46b0-b24d-7bbc6d8def32","type":"Full Time","url":"https://jobs.github.com/positions/6d3173e8-15bb-46b0-b24d-7bbc6d8def32","created_at":"Tue Jan 05 07:52:00 UTC 2021","company":"Construyo","company_url":"https://construyo.de","location":"Berlin","title":"Senior Javascript Developer","description":"\u003cp\u003eBeing one of the biggest industries in Germany and the world, construction failed to take advantage of the new opportunities offered by digitalization.\u003c/p\u003e\n\u003cp\u003eConstruyo offers a project management tool that connects the architecture, engineering and real estate, the goal is to increase transparency and optimize stakeholders by applying the latest technologies in order to support and implement projects efficiently.\u003c/p\u003e\n\u003cp\u003eWe are a growing startup with the mission to shape the construction industry in a new and future-oriented way. To meet our ambitious product roadmap we are looking for a Senior JavaScript Developer to join our team located in the Berlin. You will be part of an agile and talented team that applies the newest technologies across all domains of our product.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSupporting our Tech team in executing our product roadmap both front and back.\u003c/li\u003e\n\u003cli\u003eDiscovering and implementing new technologies that yield competitive advantage.\u003c/li\u003e\n\u003cli\u003eMaintaining and improving our JavaScript tech stack, primarily using NodeJS and React.\u003c/li\u003e\n\u003cli\u003eImproving our infrastructure built on Firebase, Google Cloud, Salesforce and Heroku to name a few.\u003c/li\u003e\n\u003cli\u003eContributing to the development of our product vision.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou should be a team player with a keen eye for detail and problem-solving skills with experience in Agile frameworks, and deep knowledge in both front-end and back-end.\u003c/li\u003e\n\u003cli\u003e5 years + hands-on experience in JavaScript (NodeJS \u0026amp; React), in maintaining and developing a digital product.\u003c/li\u003e\n\u003cli\u003eA sharp thinker who can leverage all information available at Construyo to define strategies and creative solutions.\u003c/li\u003e\n\u003cli\u003eSomeone who thrives in agile environments where feedback exchange is constant, being capable of giving and receiving.\u003c/li\u003e\n\u003cli\u003eA curious and passionate professional who can go beyond the expectations. Who leans into action, capable of making decisions and that seeks autonomy.\u003c/li\u003e\n\u003cli\u003eSomeone committed to develop the best work experience of their career and who will add to our incredible culture.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Construyo, our most valuable resource is our people - with a diversity of backgrounds, ideas and life experiences. We hire smart and creative professionals that have demonstrated excellence through their skills and character.\u003c/p\u003e\n\u003cp\u003eEmployees are more than just coworkers, our dynamic company culture encourages meaningful interactions between colleagues. We face challenges together and we celebrate together; our work environment is vibrant!\u003c/p\u003e\n\u003cp\u003eWe offer all of the perks of Berlin startups: team events, urban sports, beer fridays and much more! All in an office located in the heart of Europe´s most exciting capital.\nMore importantly, we are helping people living in a home that they love. Data shows that in Germany alone the time spent at home increased by up to 17% due to the pandemic. Thus, living in an environment that feels like home is more important than ever!\u003c/p\u003e\n\u003cp\u003eCome Build with us!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://construyo.join.com/jobs/1751035-senior-javascript-developer?pid=\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bjavascript%2Bdeveloper\"\u003ehttps://construyo.join.com/jobs/1751035-senior-javascript-developer?pid=\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bjavascript%2Bdeveloper\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbkdVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bc02aa9af48683beb8ce22c1b4126a7fa3f00012/construyo-logo-l.png"},{"id":"903ceca2-52e9-443c-a639-b2f032204589","type":"Full Time","url":"https://jobs.github.com/positions/903ceca2-52e9-443c-a639-b2f032204589","created_at":"Mon Jan 04 17:49:33 UTC 2021","company":"Spanflug Technologies GmbH","company_url":"https://spanflug.de/","location":"Munich","title":"Software Engineer – Web (Python, React.js)","description":"\u003cp\u003eSpanflug is a Munich-based start-up running an online-platform for custom manufactured parts.\nThe user can upload the CAD-Model of the part they want to have manufactured and our algorithm then analyses the CAD file and calculates an instant price quote. If the customer submits the order, we broker it to our network of suppliers.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDescription\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are looking for an experienced, self-driven and conscientious full-stack web-developer with experience in React.js and Python to complement our small web-development (and devops) team.\u003c/p\u003e\n\u003cp\u003eThe responsibilities of the web-development team are extremely diverse and include among others designing the software-architecture, developing specific customer-facing features, automating our own internal processes, integrating external services, designing APIs, and dev-ops activities in order to ensure smooth deployments and reliable service.\u003c/p\u003e\n\u003cp\u003eOur web-team works in close collaboration with our algorithm and marketing/sales/operations teams and is therefore involved in the full product lifecycle. We work in very short product iteration cycles based on a GitHub-workflow so that contributions will usually be deployed immediately after completion.\u003c/p\u003e\n\u003cp\u003eOur web-stack currently includes the following technologies:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReact.js / Redux / Semantic UI\u003c/li\u003e\n\u003cli\u003eFlask\u003c/li\u003e\n\u003cli\u003ePostgreSQL\u003c/li\u003e\n\u003cli\u003eRedis\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop, test and deploy new frontend and backend features for the spanflug web-platform\u003c/li\u003e\n\u003cli\u003eDesign and implement APIs\u003c/li\u003e\n\u003cli\u003eIntegrate external services\u003c/li\u003e\n\u003cli\u003eContribute to the design and software architecture of the spanflug web-platform\u003c/li\u003e\n\u003cli\u003eSet up and manage server infrastructure\u003c/li\u003e\n\u003cli\u003ePerform deployments and ensure smooth operations\u003c/li\u003e\n\u003cli\u003ePractice test-driven development\u003c/li\u003e\n\u003cli\u003eCollaborate closely with our algorithm team to ensure ensure timely and seamless deployment of algorithm updates\u003c/li\u003e\n\u003cli\u003eCollaborate closely with our sales/marketing and customer success team in order to help define new requirements\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s and/or Master’s degree in computer science or equivalent qualifications\u003c/li\u003e\n\u003cli\u003e3+ years of relevant industry experience\u003c/li\u003e\n\u003cli\u003eExcellent Python and Javascript skills and experience collaborating on larger projects\u003c/li\u003e\n\u003cli\u003eExperience with React.js\u003c/li\u003e\n\u003cli\u003eExperience with Dev-Ops and basic Linux system administration\u003c/li\u003e\n\u003cli\u003eExperience working with relational databases\u003c/li\u003e\n\u003cli\u003eA good understanding of web-technologies\u003c/li\u003e\n\u003cli\u003eA good grasp of security best-practices and common vulnerabilities\u003c/li\u003e\n\u003cli\u003eExperience with CI/CD development workflows\u003c/li\u003e\n\u003cli\u003eProficiency with git and Docker\u003c/li\u003e\n\u003cli\u003eExcellent communication skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy Spanflug?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGreat office location in the centre of Munich near the Sendlinger Tor\u003c/li\u003e\n\u003cli\u003e30 vacation days\u003c/li\u003e\n\u003cli\u003eFlexible workhours\u003c/li\u003e\n\u003cli\u003eBudget for conferences and trainings\u003c/li\u003e\n\u003cli\u003eSubsidised lunches\u003c/li\u003e\n\u003cli\u003eFree snacks and drinks\u003c/li\u003e\n\u003cli\u003eFriday afternoon „mini-hackathons“\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/b18f10a8003ec3431cfbf1879837ae811e9bea4e/68747470733a2f2f742e676f686972696e672e636f6d2f682f31383935303630373832613464376637613337333262633339306434373138363634656230323962626235646430336564333961613938336561353232306664\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/c4c8e633cec4d8e537966a0542eb18263c8990f86810ab57973dfafe6edc9bce\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbStVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--169cc427b5cf198a85f76614e526e9d6677e034e/Spanflug%20Technologies%20GmbH.png"},{"id":"703a5132-4062-42d8-bb80-3a08ddbc8f94","type":"Full Time","url":"https://jobs.github.com/positions/703a5132-4062-42d8-bb80-3a08ddbc8f94","created_at":"Mon Jan 04 15:39:16 UTC 2021","company":"neubau kompass AG","company_url":"https://www.neubaukompass.de/","location":"Munich","title":"Senior Frontend Developer (m/w/d)","description":"\u003cp\u003eneubau kompass ist nicht umsonst eine der bekanntesten Online-Plattformen für Neubau-Wohnimmobilien. Wir sind so erfolgreich, weil wir nie stehen bleiben und unsere Leistungsqualität immer wieder auf den Prüfstand stellen und verbessern. Unsere Mitarbeiter wissen, dass wir ihnen viel zutrauen. Wir schätzen sie nicht nur als Fachkräfte, sondern auch als Menschen.\u003c/p\u003e\n\u003cp\u003eWir arbeiten mit flachen Hierarchien, bieten spannende Karrieremöglichkeiten sowie eine faire Bezahlung. Unser guter Teamgeist wird von unseren Werten getragen: Engagement, Empathie, Teamgeist und der Willen, sich fachlich weiterzuentwickeln.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEinleitung\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSie haben Spaß am Erstellen von Web-Designs, Blog-Designs und nutzerfreundlichen Website-Elementen wie Formularen oder Listenansichten? Sie sind sicher im Umgang mit HTML und CSS und JS? Bewerben Sie sich bei neubau kompass! Für unseren Standort in München suchen wir zum nächstmöglichen Termin eine(n) engagierte(n) \u003cstrong\u003eSenior Frontend Developer (m/w/d)\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDiese Aufgaben erwarten Sie bei uns\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFrontend-Entwicklung unseres Immobilien-Portals\u003c/li\u003e\n\u003cli\u003eOptimierung unserer Plattform für verschiedene Endgeräte\u003c/li\u003e\n\u003cli\u003eUmsetzung und Ausarbeitung von Screendesigns in HTML und CSS und JavaScript\u003c/li\u003e\n\u003cli\u003eVerbesserung von Usability und Micro-Interactions\u003c/li\u003e\n\u003cli\u003eBeratung und Unterstützung bei der Erstellung von Konzepten und Lösungen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas bringen Sie mit\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIdealerweise Studium oder Ausbildung im Bereich  Informatik, Web-Entwicklung oder vergleichbare Qualifikation\u003c/li\u003e\n\u003cli\u003eMindestens 3 Jahre Berufserfahrung\u003c/li\u003e\n\u003cli\u003eSehr gute Kenntnisse in HTML5, CSS3, Bootstrap, Tailwind, JS und JQuery\u003c/li\u003e\n\u003cli\u003eErfahrung mit gulp, sass, less, composer, node.js und anderen modernen Frameworks\u003c/li\u003e\n\u003cli\u003eErfahrung mit GIT\u003c/li\u003e\n\u003cli\u003eGute PHP Skills\u003c/li\u003e\n\u003cli\u003eEine eigenständige und lösungsorientierte Arbeitsweise, Teamfähigkeit, Kommunikationsstärke\u003c/li\u003e\n\u003cli\u003eQualitätsbewusstsein, eigenverantwortliches Arbeiten und Lösen von Problemstellungen\u003c/li\u003e\n\u003cli\u003eEine hohe Motivation und Auffassungsgabe sowie ein schnelles Umsetzungsvermögen\u003c/li\u003e\n\u003cli\u003eBelastbarkeit, auch unter Zeitdruck\u003c/li\u003e\n\u003cli\u003eGrundkenntnisse in Englisch\u003c/li\u003e\n\u003cli\u003eErfahrung mit UX, Customer Journey und Conversion-Optimierung\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas bieten wir Ihnen\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFestanstellung in Vollzeit\u003c/li\u003e\n\u003cli\u003eFaire Bezahlung\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten\u003c/li\u003e\n\u003cli\u003eMöglichkeit im Homeoffice zu arbeiten\u003c/li\u003e\n\u003cli\u003eUnterstützung bei der fachlichen Weiterbildung\u003c/li\u003e\n\u003cli\u003eRaum für Eigeninitiative und spannende Aufgaben\u003c/li\u003e\n\u003cli\u003eModerne und hochwertige Büroräume\u003c/li\u003e\n\u003cli\u003eMac oder Windows Notebook\u003c/li\u003e\n\u003cli\u003eKurze Kommunikationswege\u003c/li\u003e\n\u003cli\u003eEin angenehmes Arbeitsklima\u003c/li\u003e\n\u003cli\u003eKompetente, hilfsbereite und engagierte Kollegen\u003c/li\u003e\n\u003cli\u003eKostenlose Getränke: (Milch-)Kaffee, Tee, Mineralwasser\u003c/li\u003e\n\u003cli\u003eHervorragende Anbindung an den MVV\u003c/li\u003e\n\u003cli\u003eKostenfreie Parkplätze\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eMöchten Sie Teil unseres engagierten Teams werden?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDann senden Sie uns Ihre aussagekräftige Bewerbung (inkl. Anschreiben und CV im PDF-Format) über unser Bewerberportal. Bitte geben Sie den frühestmöglichen Eintrittstermin sowie Ihre Gehaltsvorstellungen an!\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/75b21d34340386254b0d84efe7f06440fbc7666e/68747470733a2f2f742e676f686972696e672e636f6d2f682f35616235633739313661353163666563386663316264643334393038303934393138333634383863396638393837666438343563353832376436356561623566\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/4935a92404e4fc8c87eba02ca6471a9b6c54e9e19a8bed0dd9cd5900fac1e60a\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbTJVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9d83c8393c731ec15b17323991c15b980314999f/neubau%20kompass%20AG.png"},{"id":"4d7664c8-8133-4ae7-b924-831a16721cdf","type":"Full Time","url":"https://jobs.github.com/positions/4d7664c8-8133-4ae7-b924-831a16721cdf","created_at":"Mon Jan 04 15:34:21 UTC 2021","company":"Politie Nederland","company_url":"https://vonq.io/3rSjcC0","location":"Utrecht","title":"full stack ontwikkelaar","description":"\u003cp\u003eVoor de applicatielijn Connect zijn we op zoek naar een ondernemende en vakbekwame ontwikkelaar. De applicatielijn ondersteunt de politie met innovatieve software oplossingen zodat deze binnen de organisatie taakgericht samen kunnen werken en het mogelijk maakt een professionele (digitale) dialoog met de burger aan te gaan. Binnen een Scrumteam ontwikkel en implementeer je hiertoe toepassingen met andere ontwikkelaars.\u003c/p\u003e\n\u003cp\u003eLocatie(s): Utrecht\nOrganisatieonderdeel: Politiedienstencentrum\nVakgebied(en) :ICT\nNiveau :HBO\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWat ga je doen?\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eHet Cluster Kennis en Informatievoorziening Politie (KIP) is verantwoordelijk voor de interne webapplicaties van de politie. Hierbij kan je denken aan het (vernieuwde) intranet van de politie of een app voor de collega’s op straat. Binnen ons cluster zijn we de bezig om van component teams naar feature teams te migreren. Hiertoe zijn inmiddels de eerste stappen gezet. Mede hierdoor zijn we op zoek naar (nieuwe) collega’s die breed inzetbaar zijn binnen de teams. Zo zal er van je gevraagd worden om naast het ontwikkelen van software, onder andere ook te assisteren bij het testen, testautomatisering en specificeren van de features. Als full stack ontwikkelaar ben je dus medeverantwoordelijk voor het hele proces, van specificering tot uitrol van de software in productie.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWaar ga je werken?\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eJe werkt op de Afdeling Softwareontwikkeling in een van de Scrumteams. Een leuk en informeel team, waarbinnen je samenwerkt met andere ontwikkelaars, een tester, een UX-designer en de Product Owner. Jullie ontwikkelen software in sprints van twee weken en die software wordt vervolgens ook binnen enkele weken in gebruik genomen. Zo zie je dus heel snel resultaat van je werk.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWie ben jij?\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eJij bent een ontwikkelaar in hart en nieren die zich graag verder ontwikkelt in het vakgebied. Je werkt graag in een Scrumteam en helpt je collega’s waar nodig. Verder vragen we:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eeen hbo-diploma in een IT-technische richting;\u003c/li\u003e\n\u003cli\u003eervaring in front-end of mobile development; back-end ontwikkeling en visual design;\u003c/li\u003e\n\u003cli\u003ekennis van technologieën als:\n\u003cul\u003e\n\u003cli\u003eHTML5;\u003c/li\u003e\n\u003cli\u003eCSS;\u003c/li\u003e\n\u003cli\u003eAngular;\u003c/li\u003e\n\u003cli\u003etypescript;\u003c/li\u003e\n\u003cli\u003eCordova;\u003c/li\u003e\n\u003cli\u003eXamarin;\u003c/li\u003e\n\u003cli\u003eJAVA;\u003c/li\u003e\n\u003cli\u003e.NET.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eVoldoe je niet aan alle functie-eisen, maar heb je wel de drive en potentie om door te groeien tot een sterke ontwikkelaar? Ook dan nodigen we je uit om te solliciteren.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWat wij bieden\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eDe standplaats is Utrecht. Er is ruimte voor 2 fte. Het betreft een functie voor 36 uur per week. Omdat goede mensen belangrijk zijn binnen de politie investeren we in jouw toekomst. We bieden uitgebreide ontwikkelingsmogelijkheden en een vaste aanstelling, waarbij een proeftijd van 1 jaar van toepassing is.\u003c/p\u003e\n\u003cp\u003eVerder kun je het volgende van ons verwachten:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eeen bruto maandsalaris van minimaal € 2.866,- en maximaal € 4.624,- (schaal 10 Bbp) op basis van een 36-urige werkweek;\u003c/li\u003e\n\u003cli\u003e8% vakantie- en eindejaarsuitkering;\u003c/li\u003e\n\u003cli\u003egoede pensioenregeling en betaald ouderschapsverlof (meer info over verlof, regelingen en mogelijkheden).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDe formele functie binnen het functiegebouw van de politie is bedrijfsvoeringspecialist B, werkterrein informatie- en communicatietechnologie.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eInteresse?\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eBel met Donja Huidar, recruiter ICT (06 - 18 63 45 09) als je meer informatie over de functie en over de sollicitatieprocedure wilt hebben.\u003c/p\u003e\n\u003cp\u003eSolliciteer uiterlijk 20 januari 2021 via de 'Solliciteer' button.\n\u003ca href=\"https://vonq.io/3rSjcC0\"\u003eKlik hier voor het sollicitatieformulier!\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWat verder belangrijk is\u003c/strong\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eEen veiligheidsonderzoek maakt deel uit van de selectieprocedure.\u003c/li\u003e\n\u003cli\u003eZonder IT'ers zijn we nergens. Ben jij expert in IT? Lees alles over o.a. data science, legaal hacken of cybersecurity en test je digitale skills in de Cybercrime Challenge op \u003ca href=\"http://it.kombijdepolitie.nl/\"\u003ehttp://it.kombijdepolitie.nl/\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003eDe politie zet in op vernieuwing en cultuurverschillen binnen teams. Divers samengestelde teams presteren beter. Daarom werken we hard aan een open en veilige cultuur waarin divers talent tot bloei komt.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3rSjcC0\"\u003eKlik hier voor het sollicitatieformulier!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXVVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--48cfa13b5ee724ec3bdf50ac699d9f0035c74083/politie-logo-..jpg"},{"id":"43bcafc4-3710-4f12-8701-120c3f1e4c83","type":"Full Time","url":"https://jobs.github.com/positions/43bcafc4-3710-4f12-8701-120c3f1e4c83","created_at":"Mon Jan 04 15:18:29 UTC 2021","company":"Axios","company_url":"http://axios.com","location":"Remote (USA)","title":"Senior React Native Engineer (Mobile)","description":"\u003cp\u003eQuick Take: Axios is a growth-stage startup dedicated to providing trustworthy, award-winning news content in an audience-first format. We are hiring a Senior React Native Engineer (Mobile)! \u003c/p\u003e\n\u003cp\u003eWhy it Matters: Our Mobile Engineers are a critical part of our mission to deliver the cleanest, smartest, most efficient and trustworthy content to our users. You will architect and grow new and existing codebases, give technical input and feedback to Axios’ product and design teams for new features, and help develop the skills of your teammates with industry best practices around testing, accessibility, and documentation.\u003c/p\u003e\n\u003cp\u003eGo Deeper: In this role, you will make an impact on Axios through the following responsibilities:\u003c/p\u003e\n\u003cp\u003eHelp architect and build significant new features in the Axios mobile app\nPartner with Senior Mobile, Frontend and React Native engineers on the team\nWrite clean, well-documented, and well-tested code using best practices for React and React Native development\nCollaborate with Axios’ platform, product, and design teams to ensure we quickly ship and iterate on high-quality products\nDebug and develop mobile platform-specific features on iOS and Android in a React Native codebase\nMentor and coach members of the team through pair-programming and empathetic code review\nStay up to date with industry trends and advise the team on best practices to implement\u003c/p\u003e\n\u003cp\u003eThe Details: Ideal candidates will embody an entrepreneurial spirit and passion for Axios’ mission and have the following skills:\u003c/p\u003e\n\u003cp\u003eExperience building large, high traffic frontend codebases in React Native\nProven ability to ship high quality, testable, and accessible code quickly\nExperience working on cross-functional teams is preferred\nExperience working on mobile performance and accessibility is preferred\nExperience debugging mobile applications on iOS and Android is preferred\u003c/p\u003e\n\u003cp\u003eDon’t Forget:\u003c/p\u003e\n\u003cp\u003eCompetitive salary\nHealth insurance (100% paid for individuals, 75% for families)\nPrimary caregiver 12-week paid leave\n401K\nGenerous vacation policy, plus company holidays\nCompany equity\nCommuter and cell phone benefit\nA commitment to an open, inclusive, and diverse work culture\u003c/p\u003e\n\u003cp\u003eAdditional pandemic-related benefits:\u003c/p\u003e\n\u003cp\u003eOne mental health day per quarter\n$100 monthly work-from-home stipend\nTele-mental health services \nOneMedical membership, including tele-health services \nIncreased work flexibility for parents and caretakers \nAccess to the Axios “Family Fund”, which was created to allow employees to request financial support when facing financial hardship or emergencies \nWeekly company-sponsored exercise and meditation classes \nVirtual company-sponsored social events\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/91c4e28d1us\"\u003ehttps://grnh.se/91c4e28d1us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbVdVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--416ae799483ed12d8492905d35ba699737d9e4a1/Axios%20logo%20-%20RGB%20-%20minimum%20space.jpg"},{"id":"1f0bc6cd-6347-48a1-8754-98b09c264cf2","type":"Full Time","url":"https://jobs.github.com/positions/1f0bc6cd-6347-48a1-8754-98b09c264cf2","created_at":"Mon Jan 04 13:58:41 UTC 2021","company":"Superside","company_url":"https://www.superside.com","location":"Remote","title":"Frontend Engineer (React/NextJS)","description":"\u003cp\u003eSuperside is looking for a talented, driven and ambitious Frontend Engineer to join our talented growing team.\u003c/p\u003e\n\u003cp\u003eWe are growing fast and need help to build our product into a great design platform that includes project  management features, real time chat, staffing, file annotation and more.\u003c/p\u003e\n\u003cp\u003eWork from wherever you want with a highly competitive salary, responsibility from day one and exciting learning opportunities.\u003c/p\u003e\n\u003cp\u003eWHAT YOU’LL DO\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eImplement the features and user interfaces of the internal Superside app (Superspace) like the Superchat and the staffing system\u003c/li\u003e\n\u003cli\u003eArchitect efficient and reusable front-end systems that drive complex web applications\u003c/li\u003e\n\u003cli\u003eCollaborate with Product Designers, Product Managers, and Software Engineers to deliver compelling user-facing products\u003c/li\u003e\n\u003cli\u003eIdentify and resolve performance and scalability issues\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWHAT YOU’LL NEED TO SUCCEED\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with React and Node.js\u003c/li\u003e\n\u003cli\u003eHTML/CSS experience, including concepts like layout, specificity, cross-browser compatibility, and accessibility\u003c/li\u003e\n\u003cli\u003eJavaScript experience, including concepts like asynchronous programming, closures, types, and ES6.\u003c/li\u003e\n\u003cli\u003eExperience with browser APIs and optimizing front end performance\u003c/li\u003e\n\u003cli\u003eExcellent communication skills in English\u003c/li\u003e\n\u003cli\u003eHard-working team player\u003c/li\u003e\n\u003cli\u003eFast and stable internet connection\u003c/li\u003e\n\u003cli\u003eBS/MS in Computer Science or a related technical field preferred\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eABOUT SUPERSIDE\u003c/p\u003e\n\u003cp\u003eSuperside is a remote future-of-work startup that delivers great design at scale to global brands 24/7 — from everyday production work to large-scale strategic design solutions. By building workflow technology and an instant and fully-managed process, Superside makes design hassle-free for customers like Facebook, Redbull, Puma, Amazon, Salesforce, Cisco, HP, Twitch, Airbus, L'Oreal, Tiffany \u0026amp; Co. and more. Superside is backed by Y Combinator, Slack Fund, Freestyle Capital and High Alpha Capital. We're a fully distributed team of ex tier one agency designers and project managers located all around the world, spanning 58 countries and 19 timezones.\u003c/p\u003e\n\u003cp\u003eMission: Create more equal economic opportunities globally\u003c/p\u003e\n\u003cp\u003eVision: We find and grow the world’s best creative talent\u003c/p\u003e\n\u003cp\u003eWHY JOIN US\u003c/p\u003e\n\u003cp\u003eWe are a global community with people across 58 countries\nBe part of a highly talented tech team, and work with people with background in Spotify, Yandex and Booking.com\nCompetitive salary with the potential for earning equity in the company\nWe function in a trusting environment while seeking the truth in an ego-free manner\nPioneering the remote future of work with a fair, meritocratic and supportive community\nDisrupting a massive global industry with a huge market opportunity\nPaid vacation\u003c/p\u003e\n\u003cp\u003eTECHNICAL STACK\u003c/p\u003e\n\u003cp\u003eFrontend\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eNodeJS\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLambda Edge\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eNext.js/ React\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStyled Components\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eTypescript\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSanity Headless CMS\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBackend\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eJava/Kotlin\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSpring Boot 2\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHibernate/ AWS RDS / MySql\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eRedisson/Redis\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eJunit for testing\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eElasticSearch\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eInfrastructure\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTerraform\u003c/li\u003e\n\u003cli\u003eAWS SQS/SNS, ECS, Cloudfront, Route53,  EC2, S3, WAF, PageDuty, ParameterStore, ALB\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eJenkins\u003c/li\u003e\n\u003cli\u003ePusher\u003c/li\u003e\n\u003cli\u003eMailgun\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf you think Superside is the right place for you, get in contact!\u003c/p\u003e\n\u003cp\u003ePlease note that we receive many applications for this position and reply times will therefore vary. We screen applications continuously and will reach out to you as soon as we can after you have completed the assessments.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eSubmit here: \u003ca href=\"https://superside.vervoe.net/job-page/frontend-engineer-full-time-remote/50bd7a7c-7354-4c7d-bb8d-02ef2a702832\"\u003ehttps://superside.vervoe.net/job-page/frontend-engineer-full-time-remote/50bd7a7c-7354-4c7d-bb8d-02ef2a702832\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbU9VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--062afe27ff39c811c45fb63c1c56145fca8490c5/last%20ned%20(2).jpeg"},{"id":"b35a2dd9-f16b-46fd-a1ef-223417e7ab77","type":"Full Time","url":"https://jobs.github.com/positions/b35a2dd9-f16b-46fd-a1ef-223417e7ab77","created_at":"Mon Jan 04 10:58:07 UTC 2021","company":"Amun","company_url":"http://amun.com","location":"Remote Remote [GMT+2 to GMT-5 zone preferred]","title":"Dev Ops Engineer","description":"\u003cp\u003eAbout Amun:\u003c/p\u003e\n\u003cp\u003eAmun is a leading cryptocurrency issuer which aims to make purchasing crypto more accessible, and efficient.\u003c/p\u003e\n\u003cp\u003eUnder its 21Shares brand, Amun is the world's largest issuer of crypto exchange-traded products (ETPs). The 21Shares suite of ETPs has simplified access to crypto for both institutional and retail investors in the traditional finance community. In a similar fashion, Amun aims to provide tokens that will make it easy for the crypto community to access sophisticated strategies that are not otherwise readily available in this space. Amun is a team of entrepreneurs, engineers, and financial product developers who are uniquely placed to revolutionize cryptocurrency investing through the issuance of our broad range of tokens. Our goal is to make these tokens present a new paradigm in cryptocurrency investing and to facilitate their use.\u003c/p\u003e\n\u003cp\u003eOur Stack:\u003c/p\u003e\n\u003cp\u003eAWS infrastructure\nGrafana\nPostgresql\nNode backend (Typescript, feathersjs)\nVue (Nuxt) frontend\nPython and Rust in the mix as well\u003c/p\u003e\n\u003cp\u003eJob Summary:\u003c/p\u003e\n\u003cp\u003eMaintain, guide and develop continuous integration practices in the organisation by creating pipelines, automating build and release processes and working to standardise those processes across our application suite. Aid in the technical design and delivery of new systems with regard to continuous integration, automated testing and effective monitoring.\u003c/p\u003e\n\u003cp\u003eKey Accountabilities and Scope:\u003c/p\u003e\n\u003cp\u003eArchitect infrastructure and deploy production systems\nImplement and maintain CI/CD pipelines to support teams during development and release cycles\nBuild tooling to reduce the overhead of deployment and monitoring\nProduce and update documentation of standards and procedures\nProvide on-demand support as needed\nPrepare disaster recovery and incident response plan for production deployments\nImplement best practices and cost optimization strategies\nCommunicates with wider team to solve and diagnose problems, to design technical solutions and discuss technology choices\nCollaborates in a multi-skilled agile team to estimate, plan, deliver and test prioritised features\nMentors and guides fellow engineers in technical skills and the application of DevOps practices and development methodologies\nInvestigate, diagnose and fix problems in existing systems using creative thought processes\u003c/p\u003e\n\u003cp\u003eSkills Required:\u003c/p\u003e\n\u003cp\u003eHigh comfort in working with Linux environment and typical sysadmin tools\nGood understanding of concepts like CI/CD, configuration management, cloud platforms, version control, automation, monitoring, analytics, containerization, and microservices architecture\nStrong experience and understanding of using Agile methodologies to plan, develop, test and deliver software through the value stream. Ability to mentor others in its use.\nexcellent organisational and time management skills, and the ability to work on multiple projects at the same time\nFamiliarity with orchestration systems and containerisation, e.g. Kubernetes, Docker\nKnowledgeable in communication protocols and the OSI model\nExcellent team working and communication skills\nSkilled in communicating across the organisation to communicate technical solutions and resolve technical problems\nData security is your middle name\nExperience investigating and diagnosing problems with large-scale IT systems\nDegree in Engineering or Computer Science - preferred\nCapable of writing E2E and integration tests - preferred\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply through the following link: \u003ca href=\"https://amun.bamboohr.com/jobs/view.php?id=26\u0026amp;source=aWQ9MTg%3D\"\u003ehttps://amun.bamboohr.com/jobs/view.php?id=26\u0026amp;source=aWQ9MTg%3D\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUdVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--92db31c67c76baf2fc6a591b9c1eefff34e3abc5/amun-icon-outline-gold.png"},{"id":"a7c16735-0426-47aa-9d61-97388054f81b","type":"Full Time","url":"https://jobs.github.com/positions/a7c16735-0426-47aa-9d61-97388054f81b","created_at":"Mon Jan 04 10:54:59 UTC 2021","company":"Amun","company_url":"http://amun.com","location":"Remote Remote [GMT+2 to GMT-5 zone preferred]","title":"Front End Developer","description":"\u003cp\u003eAbout Amun:\u003c/p\u003e\n\u003cp\u003eAmun is a leading cryptocurrency issuer which aims to make purchasing crypto more accessible, and efficient.\u003c/p\u003e\n\u003cp\u003eUnder its 21Shares brand, Amun is the world's largest issuer of crypto exchange-traded products (ETPs). The 21Shares suite of ETPs has simplified access to crypto for both institutional and retail investors in the traditional finance community. In a similar fashion, Amun aims to provide tokens that will make it easy for the crypto community to access sophisticated strategies that are not otherwise readily available in this space. Amun is a team of entrepreneurs, engineers, and financial product developers who are uniquely placed to revolutionize cryptocurrency investing through the issuance of our broad range of tokens. Our goal is to make these tokens present a new paradigm in cryptocurrency investing and to facilitate their use.\u003c/p\u003e\n\u003cp\u003eOur Stack:\u003c/p\u003e\n\u003cp\u003eAWS infrastructure\nPostgresql\nNode backend (Typescript, feathersjs)\nVue (Nuxt) frontend\nPython and Rust in the mix as well\u003c/p\u003e\n\u003cp\u003eJob Summary:\u003c/p\u003e\n\u003cp\u003eWork with Engineering and Product teams to deliver quality user interfaces across our internal and client facing (transactional and non-transactional) websites and applications.\u003c/p\u003e\n\u003cp\u003eKey Accountabilities and Scope:\u003c/p\u003e\n\u003cp\u003eImplementing the UI coming from the designers.\nWriting effective and accurate code\nImplementing responsive web applications.\nMaintaining the company UI components shared between different projects.\nMaintaining and implementing new features to the current Vue applications.\nWork with databases, servers, microservices, and APIs, and the integration of all these processes with the core environment.\nWork collaboratively by proposing solutions and alternative points of view to problems.\nUnit Testing and Code Reviews.\u003c/p\u003e\n\u003cp\u003eSkills Required:\u003c/p\u003e\n\u003cp\u003eA minimum of 4yrs of coding as a Frontend Developer.\nJavaScript/ES6\nGood experience of writing JavaScript tests.\nGood attention to detail\nAPIs integration experience\nExcellent organisational and time management skills, and the ability to work on multiple projects at the same time\nExcellent team working and communication skills\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply through the following link: \u003ca href=\"https://amun.bamboohr.com/jobs/view.php?id=27\u0026amp;source=aWQ9MTg%3D\"\u003ehttps://amun.bamboohr.com/jobs/view.php?id=27\u0026amp;source=aWQ9MTg%3D\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbCtVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5a322a6ea95d2b9dbd38969a555255ae78e0c7f7/amun-icon-solid-gold.png"},{"id":"aa5a4c42-7a7a-4513-9de6-a0daeba36d87","type":"Full Time","url":"https://jobs.github.com/positions/aa5a4c42-7a7a-4513-9de6-a0daeba36d87","created_at":"Mon Nov 30 12:07:01 UTC 2020","company":"Microsoft","company_url":"https://www.microsoft.com/en-ie/futurenavigators","location":"Dublin, Ireland","title":"Microsoft Software Engineer. Dublin, Ireland.","description":"\u003cp\u003eAbout This Role:\u003c/p\u003e\n\u003cp\u003eMicrosoft engineers inspire, empower and lead. As an engineer at Microsoft Ireland, you can develop solutions used by hundreds of millions of people around the world. With teams working on Microsoft 365, Azure, Modern Workplace Transformation Solutions, Identity and Natural Language Experiences, there is no limit to what you can achieve\u003c/p\u003e\n\u003cp\u003eWe are recruiting Software Engineers for teams across the organisation. Successful candidates must have an inquisitive, can-do mindset.The ability to break barriers, challenge the status quo, and build connections across organizations is crucial.\u003c/p\u003e\n\u003cp\u003eIf you want to build best-in-class solutions using robust coding practices and the latest tech in a fast-paced DevOps environment, apply today.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and deliver the next generation of highly scalable, intelligent cloud services and products.\u003c/li\u003e\n\u003cli\u003eBuild and support modern web applications and large-scale distributed services.\u003c/li\u003e\n\u003cli\u003eProduce high quality code that is unit tested, code reviewed, and checked regularly for continuous integration.\u003c/li\u003e\n\u003cli\u003eCollaborate with colleagues including product owners, UX designers, ML Engineers/Researchers, data scientists and other engineers to create delightful and meaningful experiences for our customers.\u003c/li\u003e\n\u003cli\u003eEvangelize and/or propose new ideas while \"bringing others along”.\u003c/li\u003e\n\u003cli\u003eDemonstrate a sense of pride, ownership, and personal accountability for end-to-end products.\u003c/li\u003e\n\u003cli\u003eLearn continuously and work comfortably with the latest technologies (serverless, containerized apps, AI/ML, IoT, .NET Core, etc.) in Microsoft. \u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eJob Requirements:\u003c/p\u003e\n\u003cp\u003eBasic Requirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAt least 5 years of experience as a software engineer or as a software developer\u003c/li\u003e\n\u003cli\u003e3 years' minimum software development experience using OOP languages (C#, C++, Java, etc.)\u003c/li\u003e\n\u003cli\u003e2 years' minimum experience working with cloud computing platforms like Azure, AWS, or similar\u003c/li\u003e\n\u003cli\u003eExperience with distributed systems design and implementation, especially microservices architecture\u003c/li\u003e\n\u003cli\u003eSoftware engineering fundamentals (data structures, algorithms, async programming patterns, object-oriented design, parallel programming).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePreferred Qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with TypeScript or JavaScript or React or Angular;\u003c/li\u003e\n\u003cli\u003eA minimum of a bachelor’s degree in Computer Science, Engineering or a related field, or equivalent alternative education, skills, and/or practical experience is required.\u003c/li\u003e\n\u003cli\u003eMachine Learning or Deep Learning experience would be a bonus but not required. After all, we believe in learning and growing on the job.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAbout you\u003c/p\u003e\n\u003cp\u003eAre you customer obsessed? Do you think about your customer’s needs and the scenarios they will arise in? Do you demonstrate user empathy and seek to create solutions that delight your customers?\u003c/p\u003e\n\u003cp\u003eAre you passionate about learning and applying the latest technologies while building high-quality web applications, APIs and microservices with high availability and reliability?\u003c/p\u003e\n\u003cp\u003eIf this all sounds like you, you’re exactly the kind of candidate we’re looking for. Apply today.\u003c/p\u003e\n\u003cp\u003eAbout Microsoft Engineering\u003c/p\u003e\n\u003cp\u003eAt Microsoft Engineer you can have impact at scale. we embrace the Growth Mindset to deliver impactful solutions for our customers. Collaboration, innovation and customer obsession are central to our culture. This environment inspires better solutions for our customers, partners and ultimately the world.\u003c/p\u003e\n\u003cp\u003eBenefits\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIndustry leading healthcare\u003c/li\u003e\n\u003cli\u003eSavings and investments\u003c/li\u003e\n\u003cli\u003eGenerous annual leave\u003c/li\u003e\n\u003cli\u003eMaternity and paternity leave\u003c/li\u003e\n\u003cli\u003eOpportunities to network and connect\u003c/li\u003e\n\u003cli\u003eDiscounts on products and services\u003c/li\u003e\n\u003cli\u003eGiving programs\u003c/li\u003e\n\u003cli\u003eEducational resources\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBenefits/perks listed may vary depending on the nature of your employment with Microsoft and the country where you work.\u003c/p\u003e\n\u003cp\u003eEqual Opportunities\u003c/p\u003e\n\u003cp\u003eMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, colour, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eFor more information and to apply, visit \u003ca href=\"https://www.microsoft.com/en-ie/futurenavigators\"\u003ehttps://www.microsoft.com/en-ie/futurenavigators\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbE9SIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d00c59bdddb26215f09bc6a5499ceb35b6306594/MSFT_logo_rgb_C-Gray_200x200%5B2%5D.jpg"},{"id":"94a0f7e3-a485-4a7a-be7f-39c5adb7353c","type":"Full Time","url":"https://jobs.github.com/positions/94a0f7e3-a485-4a7a-be7f-39c5adb7353c","created_at":"Sun Jan 03 18:58:53 UTC 2021","company":"Discover New Art","company_url":"http://www.discovernewart.com","location":"Remote","title":"Solution Architect/Lead Developer","description":"\u003cp\u003e\u003cstrong\u003eWe are looking for a solution architect as a Technical Co-founder who wants to go on an adventure...\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSomeone who wants to be part of leading a web/mobile product development team from day one. This is an opportunity to have a voice and make big decisions about how a new online service will be created. We are a funded “startup” that is spinning out of an existing, profitable company that already has thousands of customers. Through our subject matter expertise, we’ve spotted an opportunity to create incredible value. We are looking for the right person to architect and lead the development of a new web service that will involve web/mobile web and hybrid mobile apps built with React Native.\u003c/p\u003e\n\u003cp\u003eWe are looking for someone who is willing to use off-the-shelf software tools to speed up the MVP launch cycle, yet has the technical chops to build it all from scratch. This project will involve implementing a headless CMS, among other components. We want someone who understands development best practices, modern application development, and modern techniques that would make the solution supportable by non-superhero programmers. We want a believer in elegant, adequately documented solutions. We don’t want to go down the rabbit hole with esoteric technology. We want a well-worn path that’s modern and leading edge.\u003c/p\u003e\n\u003cp\u003eWe are looking for a team leader who, in addition to being a great solution architect and developer, is also an open communicator who has an entrepreneurial bend and work ethic. You will have led multiple cross-platform, hybrid app development projects before and enjoy mentoring junior team members. You may be based anywhere if you have the right experience and skills. The position is 100% remote.\u003c/p\u003e\n\u003cp\u003eWe are looking for someone who wants to find sustained success at a company over a longer period of time. The right candidate will receive a vesting equity stake as well as salary and benefits. If you are looking for a friendly yet fierce place to call home and something above resonates with you, please reach out to us at your earliest convenience. We are waiting for you.\u003c/p\u003e\n\u003cp\u003eSalary: $125,000 to $145,000, plus benefits, 401k and vesting equity.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo apply, please email your resume to \u003ca href=\"mailto:scott@discovernewart.com\"\u003escott@discovernewart.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"0f48aadd-549a-4d74-a461-d889342de1aa","type":"Full Time","url":"https://jobs.github.com/positions/0f48aadd-549a-4d74-a461-d889342de1aa","created_at":"Thu Dec 31 18:49:26 UTC 2020","company":"Benco Dental","company_url":"http://www.benco.com","location":"Nationwide/Remote","title":"Software Developer - Full Stack","description":"\u003cp\u003eBenco Dental, the Nation's largest privately-owned dental distributor, is searching for a Developer to join its team in Pittston, PA or remotely!\u003c/p\u003e\n\u003cp\u003eWhy Join our Team?\u003c/p\u003e\n\u003cp\u003eWe drive dentistry forward by leveraging innovative solutions and our caring family culture.\u003c/p\u003e\n\u003cp\u003eFamily-owned for 80+ years\u003c/p\u003e\n\u003cp\u003e#19 Best Companies to Work for in Health Care\u003c/p\u003e\n\u003cp\u003eAnnual Profit Sharing\u003c/p\u003e\n\u003cp\u003eMedical, Dental, Vision effective Day 1\u003c/p\u003e\n\u003cp\u003eJob Summary:  Responsible for developing code and software as per specifications, both new code and modifications to existing code; troubleshooting and resolving issues with code; documenting changes; training users on changes as appropriate. This application developer role will be part of the Benco Enterprise Application and Architecture team, which is dedicated to sustainability and modernization of Benco’s core systems.  We are a fast pace, agile team that works on a wide range of projects across multiple technologies.\u003c/p\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cp\u003eEducation:  Associates degree in Computer Systems or equivalent education/experience; Bachelor’s degree preferred.\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e         Experience:  3-5 years\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eSkills needed:  Ability to communicate clearly, persuasively and effectively both verbally and written; good organizational skills; experience with\u003c/p\u003e\n\u003cp\u003eSQL\u003c/p\u003e\n\u003cp\u003eC# (.NET Core/.NET Framework)\u003c/p\u003e\n\u003cp\u003eFront-end Web Development (HTML, CSS, JS)\u003c/p\u003e\n\u003cp\u003eFront-end JavaScript Framework (Angular, React, etc.) Experience is a plus not required.\u003c/p\u003e\n\u003cp\u003eSystem Integration (ETL, REST API)\u003c/p\u003e\n\u003cp\u003eDuties and Responsibilities:\u003c/p\u003e\n\u003cp\u003eEffectively develops code and software as per specifications.\u003c/p\u003e\n\u003cp\u003eTests software that has been created or modified.\u003c/p\u003e\n\u003cp\u003eDocuments changes to software.\u003c/p\u003e\n\u003cp\u003eDemonstrates good oral and written communication skills and listening skills.\u003c/p\u003e\n\u003cp\u003eEffectively trains appropriate personnel on newly developed or modified software.\u003c/p\u003e\n\u003cp\u003eTroubleshoots and debugs software.\u003c/p\u003e\n\u003cp\u003eConsistently and effectively updates ALM tool (Jira) with appropriate comments to track progress of work.\u003c/p\u003e\n\u003cp\u003ePerforms Code Reviews for other team members.\u003c/p\u003e\n\u003cp\u003eBreaks down work into estimable pieces and delivers accurate and consistent difficulty estimates.\u003c/p\u003e\n\u003cp\u003eWorks as an effective team member and works to improve team morale.\u003c/p\u003e\n\u003cp\u003eUnderstands IT’s role in helping Benco realize its mission.\u003c/p\u003e\n\u003cp\u003ePerforms other duties as assigned to support the efficient operation of the department and company.\u003c/p\u003e\n\u003cp\u003eAll job duties and responsibilities are essential functions of the position.\u003c/p\u003e\n\u003cp\u003eWho We Are: It’s our mission to deliver success smile after smile.\u003c/p\u003e\n\u003cp\u003eBenco Dental is the largest privately owned, full-service dental distributor in the United States and has remained in the family since 1930 - a family that now includes our more than 30,000 customers and over 1,400 associates in the 48 contiguous states.\u003c/p\u003e\n\u003cp\u003eWe provide more supply and equipment options than any other full-service distributor, an offering enhanced by a comprehensive suite of services, including office design, equipment repair, practice coaching, financing and project management, wealth management and dental-specific technology solutions. These services are supported by over 400 professionally trained sales representatives and 300 factory-trained service technicians who begin every task by asking \"What does the customer want?\"\u003c/p\u003e\n\u003cp\u003eIf you enjoy working for a progressive company that is growth minded and values customers \u0026amp; associates we encourage you to learn more about our Benco family. We are looking for driven professionals who want to play a key role in our future success.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply at \u003ca href=\"http://www.benco.com/careers\"\u003ewww.benco.com/careers\u003c/a\u003e or by clicking on the link:\n\u003ca href=\"https://benco.hrmdirect.com/employment/job-opening.php?req=1469247\u0026amp;\u0026amp;#job\"\u003ehttps://benco.hrmdirect.com/employment/job-opening.php?req=1469247\u0026amp;\u0026amp;#job\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGVVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d62f0959d9f4f10d672f89867337ab5d5c08e952/19_BencoLogo_Color_2019.jpg"},{"id":"438e8528-77e3-4b85-a8ad-78fd6237cebd","type":"Full Time","url":"https://jobs.github.com/positions/438e8528-77e3-4b85-a8ad-78fd6237cebd","created_at":"Thu Dec 31 09:19:41 UTC 2020","company":"ALDI Einkauf GmbH \u0026 Co. oHG","company_url":"https://www.aldi-nord.de/","location":"Essen","title":"Data \u0026 Analytics DevOps Engineer (m/w/d)","description":"\u003ch2\u003eDas sind deine Aufgaben\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eUmsetzung von DevOps für eine Cloud-basierte Analytics Plattform\u003c/li\u003e\n\u003cli\u003eAufbau automatischer Tools zu Orchestrierung, Monitoring und Entstörung automatisierter Daten- und Analysestrecken\u003c/li\u003e\n\u003cli\u003eOptimierung existierender Datenbeladungsprozessen und ggf. Überführung in einen modernen Zielzustand\u003c/li\u003e\n\u003cli\u003eEinhaltung von datenbezogenen Prioritäten zur Sicherstellung optimaler Verfügbarkeit der verschiedenen Daten zur richtigen Zeit\u003c/li\u003e\n\u003cli\u003eÜberwachung der Auslastung der Plattformkomponenten und Ableitung geeigneter Maßnahmen zur Performanceproblemen\u003c/li\u003e\n\u003cli\u003eDokumentation und Wissensvermittlung zu den Datenstrecken und deren Orchestrierung\u003c/li\u003e\n\u003cli\u003eAnbindung und Aufbau neuer Daten- und Analysestrecken durch Mitarbeit in cross-funktionalen, agilen Projektteams zur Realisierung von Use Cases\u003c/li\u003e\n\u003cli\u003eEnge Zusammenarbeit mit Data Engineering, Modelling und Quality\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDas bringst du mit\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eErfolgreich abgeschlossenes Studium der Informatik oder eine vergleichbare Qualifikation mit technischem Schwerpunkt\u003c/li\u003e\n\u003cli\u003eMehrjährige Erfahrung mit dem Aufsetzen von Cloud-Umgebungen für und dem Einsatz von DevOps-Technologien für das Data Management oder Analytics Use Cases\u003c/li\u003e\n\u003cli\u003eFundierte Kenntnisse in den Bereichen ETL/ELT, SQL, Automatisierungstechnologien und Software Engineering Methodiken\u003c/li\u003e\n\u003cli\u003eAusgeprägte technische und analytische Fähigkeiten, hohe Methodenkompetenz\u003c/li\u003e\n\u003cli\u003eHohe Kommunikations- und Beratungsstärke\u003c/li\u003e\n\u003cli\u003eSehr gute Deutsch- und Englischkenntnisse in Wort und Schrift\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDas bieten wir dir\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eTop-Branchengehalt\u003c/li\u003e\n\u003cli\u003eEine abwechslungsreiche und anspruchsvolle Tätigkeit\u003c/li\u003e\n\u003cli\u003eEin hohes Maß an Gestaltungsspielraum in einem neu geschaffenen Unternehmensbereich\u003c/li\u003e\n\u003cli\u003eEinen sicheren Arbeitsplatz bei der Nr. 1 im Discount\u003c/li\u003e\n\u003cli\u003eEin leistungsstarkes und angenehmes Arbeitsumfeld in einem Team, das sich auf Sie freut!\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eInteressiert?\u003c/h2\u003e\n\u003cp\u003eWir freuen uns auf Ihre Bewerbung \u003ca href=\"https://vonq.io/2L5vq9o\"\u003eüber das Bewerbungsformular!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKontakt\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eALDI Einkauf GmbH \u0026amp; Co. oHG\u003c/p\u003e\n\u003cp\u003eEckenbergstr. 16\u003c/p\u003e\n\u003cp\u003e45307 Essen\u003c/p\u003e\n\u003ch2\u003eÜber uns\u003c/h2\u003e\n\u003cp\u003eALDI Nord zählt mit einer mehr als 100-jährigen Erfolgsgeschichte zu den führenden Lebensmitteleinzelhändlern in Europa. Als Erfinder des Discounts ist es unser Anspruch, das Einkaufen für unsere Kunden so einfach wie möglich zu machen. Dafür erfinden wir uns immer wieder neu, entwickeln uns weiter und gestalten so die Zukunft des Discounts. Sie haben die POWER, gemeinsam mit uns zu wachsen? Werden Sie Teil unseres Teams!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/2L5vq9o\"\u003eKlick hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbEtVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6aac566ea334f751972dbf65bba18a9b1902aae9/Aldi.png"},{"id":"636efdf7-4397-410a-8c6c-87c7b5e40e61","type":"Full Time","url":"https://jobs.github.com/positions/636efdf7-4397-410a-8c6c-87c7b5e40e61","created_at":"Wed Dec 30 16:56:29 UTC 2020","company":"Runding Corporation","company_url":null,"location":"Folsom, CA","title":"Full stack Developer","description":"\u003cp\u003e\u003ca href=\"http://www.runding.com\"\u003ewww.runding.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eRunding is a consulting group consisting of technical development and business consulting for capital construction projects…our clients think we’re pretty good at it (so do we). In business for over 15 years, we are a small business growing in these challenging times. This work will be remote until such time that we transition back to our Folsom office.\u003c/p\u003e\n\u003cp\u003eAre you a good candidate?\nOur successful technical consultants\nhave a wide variety of backgrounds in software. The right candidate must have a\ndesire to learn, work well with others, grow professionally, displays a sense\nof leadership, is self-motivated, a problem solver and very thorough. You\nwill juggle multiple tasks and have a strong sense of ownership in your work.\u003c/p\u003e\n\u003cp\u003eWhat's the job?\u003c/p\u003e\n\u003cp\u003eRunding is looking for a Mid to Senior level, full stack developer to contribute to a\ndynamic team working on enhancing and extending a number of products in the\u003c/p\u003e\n\u003cp\u003eConstruction Project Controls space for a large client base.  Each project\nand client has their own requirements for success and an ideal candidate would\nbe able to support the development team in discovering requirements and\napplying technical knowledge to build solutions to fit the client needs.\nRequired skills include at least 3 years of experience in the following:\u003c/p\u003e\n\u003cp\u003e.NET Framework 4.5+ and/or .NET Core 2.0+\nMicrosoft SQL\nOne or more Modern Front-end UI technology (Bootstrap, Agile, React)\u003c/p\u003e\n\u003cp\u003ePreferred, but not required:\u003c/p\u003e\n\u003cp\u003eDynamics 365\nAzure Functions\nDirect client requirement gathering\nFamiliarity with Agile and SDLC processes\u003c/p\u003e\n\u003cp\u003ePrevious experience working in a consultant role with exposure to business process implementation and client interaction is a big plus. This includes providing estimates, managing customer expectations, and working with business requirements and rules.\u003c/p\u003e\n\u003cp\u003eWe look forward to hearing from you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to:\n\u003ca href=\"mailto:jnoonan@runding.com\"\u003ejnoonan@runding.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3lVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5d859bc49d91b60ae66b91a6c2b9806eb1b034f7/160710306090608423.png"}]